      *%METADATA                                                       *
      * %TEXT Change or display a program's associated space           *
      *%EMETADATA                                                      *
      * Usage:
      *   ===> call pgm 'R'
      *     read the associated space entry
      *   ===> call pgm 'S'
      *     set the associated space entry
      * For 'S', it displays the length and data returned
      * For example this indicates that the length returned
      * was 10, and that the data was 'The Value'
      *   DSPLY         10    The Value
     IPSDS       SDS
     I                                     *PROGRAM THISPG
     I                                       81  90 THISLB
     IQUALNM      DS
     I I                                      1  10 PGMNAM
     I I                                     11  20 PGMLIB
     IERRCOD      DS
     I I            0                     B   1   40BTPRV
     I I                                  B   5   80BTAVL
     I            DS
     I                                    B   1   40LENRET
     I            DS
     I                                    B   1   40DTALEN
     I            DS
     I                                    B   1   40STKOFF
      *
     C           *ENTRY    PLIST
     C                     PARM           WHAT    1
      * Copy the program info from the PSDS
     C                     MOVELTHISPG    PGMNAM
     C                     MOVELTHISLB    PGMLIB
      * Read or write the associated space depending on
      * the parameter
     C           WHAT      IFEQ 'R'
     C           WHAT      OREQ 'r'
     C                     CALL 'QCLRPGAS'
     C                     PARM           DATA   10
     C                     PARM 10        DTALEN
     C                     PARM           QUALNM
     C                     PARM 0         STKOFF
     C                     PARM 'MY HNDL' HANDLE 16
     C                     PARM           LENRET
     C                     PARM           ERRCOD
     C           LENRET    DSPLY          DATA
     C                     ELSE
     C           'new val?'DSPLY          DATA
     C                     CALL 'QCLSPGAS'
     C                     PARM           DATA   10
     C                     PARM 10        DTALEN
     C                     PARM           QUALNM
     C                     PARM 0         STKOFF
     C                     PARM 'MY HNDL' HANDLE 16
     C                     PARM           ERRCOD
     C                     ENDIF                                      lr
     C                     SETON                     LR
