      *%METADATA                                                       *
      * %TEXT Compare File Record Levels Between Two Libraries         *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: CMPRECLVLR
     H*Purpose: Compare File Record Levels between two libraries.
     H*         Changed files are copied to a third library, and a
     H*         report is printed.
     H*Called By: CMPRECLVL CL program (CPP for CMPRECLVL Command)
     H*
     H*Notes:
     H* NEWLIB = Library with Newest Files
     H* OLDLIB = Library with Old Files
     H* CHGLIB = Library for Changed Files
     H* RFFTYP = File Type (P = Physical, L = Logical, D = Display)
     H* RFFILE = File Name
     H* RFNAME = Record Format Name
     H* RFID   = Record Format Level
     H* RFFTXT = Text Description
     H*
     H*Input: Created by OPNQRYF
     H*Output: New files, report.
     H*External Calls: QCMDEXC
     H*Compilation Notes/Parameters: The two input files, NEWFILES and
     H* OLDFILES, are renamed output of the DSPFD command. You can. . .
     H*1. Execute the CMPRECLVL command - the CL program will create
     H*   the files in QTEMP for the compile.
     H*2. Override to the sample files in QSYS before compiling:
     H*      OVRDBF     FILE(NEWFILES) TOFILE(QSYS/QAFDRFMT)
     H*      OVRDBF     FILE(OLDFILES) TOFILE(QSYS/QAFDRFMT)
     H*3. Create files for the compile by issuing the DSPFD command for
     H*   any file and specifying the output file name:
     H*      DSPFD      FILE(QSYS/QAFDRFMT) TYPE(*RCDFMT) +
     H*                   OUTPUT(*OUTFILE) OUTFILE(QTEMP/NEWFILES)
     H*      DSPFD      FILE(QSYS/QAFDRFMT) TYPE(*RCDFMT) +
     H*                   OUTPUT(*OUTFILE) OUTFILE(QTEMP/OLDFILES)
     H*
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * *
     FNEWFILESIP DE                    DISK
     FOLDFILESIS DE                    DISK
     F            QWHFDFMT                          KRENAMEOLDREC
     FQPRINT  O   F     132     OF     PRINTER
     F*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     IQWHFDFMT    01
@1A  I              RFFTYP                          RFTYP1  M3
     I              RFFILE                          RFFIL1  M2
     I              RFNAME                          RFNAM1  M1
     I              RFID                            RFID1
@3A  I              RFFTXT                          RFTXT1
     I*
     IOLDREC      02
@1A  I              RFFTYP                          RFTYP2  M3
     I              RFFILE                          RFFIL2  M2
     I              RFNAME                          RFNAM2  M1
     I              RFID                            RFID2
@3A  I              RFFTXT                          RFTXT2
     I*
     I* Program Status Data Structure:
     I           SDS
     I                                     *PROGRAM PGM
     I                                     *STATUS  STATUS
     I                                       40  46 ERRMSG
     I                                       51  80 WRKARA
     I                                       91 170 MSGDTA
     I*
     I           UDS
     I                                        1  10 NEWLIB
     I                                       11  20 OLDLIB
     I                                       21  30 CHGLIB
     I*
     I* Constants:  Value                           Field Name
     I              ')'                   C         CLOSEP
     I              'CRTDUPOBJ OBJ('      C         CRTDUP
@1A  I              'CRTLF FILE('         C         CRTLF
     I              'DATA(*NO)'           C         DATA
     I              'FROMLIB('            C         FRMLIB
     I              'OBJTYPE(*FILE)'      C         OBJTYP
     I              '('                   C         OPENP
@1A  I              'OPTION(*NOSRC -      C         OPTION
     I              '*NOLIST)'
     I              'TOLIB('              C         TOLIB
@1A  I              '/'                   C         SLASH
@4A  I              'QDDSSRC'             C         DDSSRC
@1A  I              'SOURCE'              C         SOURCE
@4C  I              'SRCFILE('            C         SRCFIL
@4A  I              'UENERGY'             C         U7LIB
@4A  I              'UPATIND'             C         U9LIB
@4A  I              'UPATRNG'             C         U9LIB2
@4A  I              'UINVEST'             C         UILIB
     I*
     C* * * * * * * * * * *   Calculations   * * * * * * * * * * * * * * * **
     C                     MOVE *OFF      *IN03
     C*
     C* Don't copy IBM-Supplied files (First letter of name = 'Q')
@2A  C           1         SUBSTRFFIL1:1  FIRST   1        First Letter
     C*          -              ------ -  --->place substring in this field
     C*     Length              From   start
     C*
     C*   If file in both libraries, but Record Level doesn't match, copy
     C* into the changed files library:
     C   MR 02   RFID1     IFNE RFID2                      Record Levels <>
@2A  C           FIRST     ANDNE'Q'                        Skip IBM files
     C                     EXSR CRTOBJ
     C                     MOVE *ON       *IN03            Lvl Mismatch Msg
     C                     ENDIF
     C*
     C*   If file in new but not old library, copy into the changed
     C* files library: (Exception: Use CRTLF for Logical Files)
@2C  C  NMR 01   FIRST     IFNE 'Q'                        Skip IBM files
@1C  C           RFTYP1    IFEQ 'L'                         Logical File
@1A  C                     EXSR CRTLOG                       CrtLf
@1A  C                     ELSE                             Else
     C                     EXSR CRTOBJ                       CrtDupObj
@1A  C                     ENDIF                            End RFTYP1=L
@2A  C                     ENDIF                           End FIRST <> Q
     C*
@3A  C           *IN01     IFEQ *ON
@3A  C                     MOVELRFTXT1    WWFTXT 40        TEXT
@3A  C                     ELSE
@3A  C                     MOVELRFTXT2    WWFTXT           TEXT
@3A  C                     ENDIF
     C*
     C* * * * * * * * * * *   Subroutines  * * * * * * * * * * * * * * * * **
     C*           -----    -----
     C           *INZSR    BEGSR
     C* Initial Subroutine; executed automatically when program starts:
     C*
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C*
     C                     ENDSR                           END *INZSR
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           CRTOBJ    BEGSR
     C*   Build and execute the "Create Duplicate Object" Command to copy
     C* a file into the "Changed Files" Library:
     C           CRTDUP    CAT  RFFIL1    CMDSTR256 P      CRTDUPOBJ OBJ(
     C                     CAT  CLOSEP:0  CMDSTR           )
     C                     CAT  FRMLIB:1  CMDSTR           FROMLIB( Keyword
     C                     CAT  NEWLIB:0  CMDSTR           Library Name
     C                     CAT  CLOSEP:0  CMDSTR           )
     C                     CAT  OBJTYP:1  CMDSTR           OBJTYP(*FILE)
     C                     CAT  TOLIB:1   CMDSTR           TOLIB( Keyword
     C                     CAT  CHGLIB:0  CMDSTR           Library Name
     C                     CAT  CLOSEP:0  CMDSTR           )
     C                     CAT  DATA:1    CMDSTR           DATA(*NO)
     C*
     C                     Z-ADD256       CMDLEN 155
     C                     CALL 'QCMDEXC'              99  ERROR
     C                     PARM           CMDSTR
     C                     PARM           CMDLEN
     C*
     C                     ENDSR                           END CRTOBJ
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
@1A  C           CRTLOG    BEGSR
     C*   Build and execute the "Create Logical File" Command to
     C* create a Logical file in the "Changed Files" Library:
     C*
     C* DDS Source is in QDDSSRC for Grain files:
     C* CMDSTR = CRTLF FILE(CHGLIB/RFFIL1) OPTION(*NOSRC *NOLIST)
     C           CRTLF     CAT  CHGLIB:0  CMDSTR    P      CRTLF FILE(&CHGLIB
     C                     CAT  SLASH:0   CMDSTR           /
     C                     CAT  RFFIL1:0  CMDSTR           &RFFIL1
     C                     CAT  CLOSEP:0  CMDSTR           )
     C                     CAT  OPTION:1  CMDSTR           OPTION(*NOSRC)
     C*
     C                     Z-ADD256       CMDLEN 155
     C                     CALL 'QCMDEXC'              99  ERROR
     C                     PARM           CMDSTR
     C                     PARM           CMDLEN
     C*
     C* If create failed, the DDS source may be in a file called SOURCE
     C* CMDSTR = CRTLF FILE(CHGLIB/RFFIL1) SRCFILE(SOURCE) OPTION(*NOSRC *NOLIST
     C           *IN99     IFEQ *ON                        ERROR
     C           CRTLF     CAT  CHGLIB:0  CMDSTR    P      CRTLF(&CHGLIB
     C                     CAT  SLASH:0   CMDSTR           /
     C                     CAT  RFFIL1:0  CMDSTR           &RFFIL1
     C                     CAT  CLOSEP:0  CMDSTR           )
@4C  C                     CAT  SRCFIL:1  CMDSTR           SCRFILE(
@4A  C                     CAT  SOURCE:0  CMDSTR           SOURCE
@4A  C                     CAT  CLOSEP:0  CMDSTR           )
     C                     CAT  OPTION:1  CMDSTR           OPTION(*NOSRC)
     C*
     C                     Z-ADD256       CMDLEN 155
     C                     CALL 'QCMDEXC'              99  ERROR
     C                     PARM           CMDSTR
     C                     PARM           CMDLEN
     C                     ENDIF                           END 99=ON
     C*
@4A  C* If create failed, it may be because the DDS source is in a
@4A  C* file called SOURCE in lib UENERGY Try it and see:
@4A  C* CMDSTR = CRTLF FILE(CHGLIB/RFFIL1) SRCFILE(UENERGY/SOURCE) +
@4A  C*                OPTION(*NOSRC *NOLIST)
@4A  C           *IN99     IFEQ *ON                        ERROR
@4A  C           CRTLF     CAT  CHGLIB:0  CMDSTR    P      CRTLF(&CHGLIB
@4A  C                     CAT  SLASH:0   CMDSTR           /
@4A  C                     CAT  RFFIL1:0  CMDSTR           &RFFIL1
@4A  C                     CAT  CLOSEP:0  CMDSTR           )
@4A  C                     CAT  SRCFIL:1  CMDSTR           SCRFILE(
@4A  C                     CAT  U7LIB:0   CMDSTR           UENERGY
@4A  C                     CAT  SLASH:0   CMDSTR           /
@4A  C                     CAT  SOURCE:0  CMDSTR           SOURCE
@4A  C                     CAT  CLOSEP:0  CMDSTR           )
@4A  C                     CAT  OPTION:1  CMDSTR           OPTION(*NOSRC)
@4A  C*
@4A  C                     Z-ADD256       CMDLEN 155
@4A  C                     CALL 'QCMDEXC'              99  ERROR
@4A  C                     PARM           CMDSTR
@4A  C                     PARM           CMDLEN
@4A  C                     ENDIF                           END 99=ON
@4A  C*
@4A  C* If create failed, it may be because the DDS source is in a
@4A  C* file called SOURCE in lib UPATIND Try it and see:
@4A  C* CMDSTR = CRTLF FILE(CHGLIB/RFFIL1) SRCFILE(UPATIND/SOURCE) +
@4A  C*                OPTION(*NOSRC *NOLIST)
@4A  C           *IN99     IFEQ *ON                        ERROR
@4A  C           CRTLF     CAT  CHGLIB:0  CMDSTR    P      CRTLF(&CHGLIB
@4A  C                     CAT  SLASH:0   CMDSTR           /
@4A  C                     CAT  RFFIL1:0  CMDSTR           &RFFIL1
@4A  C                     CAT  CLOSEP:0  CMDSTR           )
@4A  C                     CAT  SRCFIL:1  CMDSTR           SCRFILE(
@4A  C                     CAT  U9LIB:0   CMDSTR           UPATIND
@4A  C                     CAT  SLASH:0   CMDSTR           /
@4A  C                     CAT  SOURCE:0  CMDSTR           SOURCE
@4A  C                     CAT  CLOSEP:0  CMDSTR           )
@4A  C                     CAT  OPTION:1  CMDSTR           OPTION(*NOSRC)
@4A  C*
@4A  C                     Z-ADD256       CMDLEN 155
@4A  C                     CALL 'QCMDEXC'              99  ERROR
@4A  C                     PARM           CMDSTR
@4A  C                     PARM           CMDLEN
@4A  C                     ENDIF                           END 99=ON
@4A  C*
@4A  C*
@4A  C* If create failed, it may be because the DDS source is in a
@4A  C* file called SOURCE in lib UPATRNG Try it and see:
@4A  C* CMDSTR = CRTLF FILE(CHGLIB/RFFIL1) SRCFILE(UPATRNG/SOURCE) +
@4A  C*                OPTION(*NOSRC *NOLIST)
@4A  C           *IN99     IFEQ *ON                        ERROR
@4A  C           CRTLF     CAT  CHGLIB:0  CMDSTR    P      CRTLF(&CHGLIB
@4A  C                     CAT  SLASH:0   CMDSTR           /
@4A  C                     CAT  RFFIL1:0  CMDSTR           &RFFIL1
@4A  C                     CAT  CLOSEP:0  CMDSTR           )
@4A  C                     CAT  SRCFIL:1  CMDSTR           SCRFILE(
@4A  C                     CAT  U9LIB2:0  CMDSTR           UPATRNG
@4A  C                     CAT  SLASH:0   CMDSTR           /
@4A  C                     CAT  SOURCE:0  CMDSTR           SOURCE
@4A  C                     CAT  CLOSEP:0  CMDSTR           )
@4A  C                     CAT  OPTION:1  CMDSTR           OPTION(*NOSRC)
@4A  C*
@4A  C                     Z-ADD256       CMDLEN 155
@4A  C                     CALL 'QCMDEXC'              99  ERROR
@4A  C                     PARM           CMDSTR
@4A  C                     PARM           CMDLEN
@4A  C                     ENDIF                           END 99=ON
@4A  C*
@4A  C* If create failed, it may be because the DDS source is in a
@4A  C* file called QDDSSRC in lib UINVEST Try it and see:
@4A  C* CMDSTR = CRTLF FILE(CHGLIB/RFFIL1) SRCFILE(UINVEST/SOURCE) +
@4A  C*                OPTION(*NOSRC *NOLIST)
@4A  C           *IN99     IFEQ *ON                        ERROR
@4A  C           CRTLF     CAT  CHGLIB:0  CMDSTR    P      CRTLF(&CHGLIB
@4A  C                     CAT  SLASH:0   CMDSTR           /
@4A  C                     CAT  RFFIL1:0  CMDSTR           &RFFIL1
@4A  C                     CAT  CLOSEP:0  CMDSTR           )
@4A  C                     CAT  SRCFIL:1  CMDSTR           SCRFILE(
@4A  C                     CAT  UILIB:0   CMDSTR           UINVEST
@4A  C                     CAT  SLASH:0   CMDSTR           /
@4A  C                     CAT  DDSSRC:0  CMDSTR           QDDSSRC
@4A  C                     CAT  CLOSEP:0  CMDSTR           )
@4A  C                     CAT  OPTION:1  CMDSTR           OPTION(*NOSRC)
@4A  C*
@4A  C                     Z-ADD256       CMDLEN 155
@4A  C                     CALL 'QCMDEXC'              99  ERROR
@4A  C                     PARM           CMDSTR
@4A  C                     PARM           CMDLEN
@4A  C                     ENDIF                           END 99=ON
@4A  C*
@4A  C* If the create STILL didn't work, give up & send user a message:
@4A  C           *IN99     IFEQ *ON                        ERROR
@4A  C                     EXCPTERROR
@4A  C                     ENDIF                           END 99=ON
     C*
     C                     ENDSR                           END CRTLOG
     C*                    -----
     O* * * * * * * * * * *   Output Specifications   * * * * * * * * * * *
     OQPRINT  H  203   1P
     O       OR        OF
     O                         PGM       10
     O                                   63 'Compare Record Levels'
     O                                   95 'DATE'
     O                         UDATE Y  104
     O                         TIME     116 '  :  :  '
     O                                  127 'Page'
     O                         PAGE  Z  132
     O*
     O        H  1     1P
     O       OR        OF
@3C  O                                   34 'New Files Library:'
     O                         NEWLIB    46
     O                                   72 'Old Files Library:'
     O                         OLDLIB    83
     O                                  110 'Changed Files in:'
     O                         CHGLIB   121
     O*
     O        H  2     1P
     O       OR        OF
     O                                    7 'Message'
     O                                   20 'File'
@3A  O                                   28 'Typ'
     O                                   35 'Format'
     O                                   45 'Level'
     O                                   58 'File'
@3A  O                                   66 'Typ'
     O                                   73 'Format'
     O                                   83 'Level'
     O*
     O        D  1    NMR
     O                 01                15 'Not in Old Lib '
     O                 02                15 'Not in New Lib '
     O                 01      RFFIL1 B  26
@3A  O                 01      RFTYP1 B  28
     O                 01      RFNAM1 B  39
     O                 01      RFID1  B  53
     O                 02      RFFIL2 B  64
@3A  O                 02      RFTYP2 B  66
     O                 02      RFNAM2 B  77
     O                 02      RFID2  B  91
@3A  O                         WWFTXT B 132
     O*
     O        D  1     MR 03
     O                                   15 '*Level Mismatch'
     O                         RFFIL1 B  26
@3A  O                         RFTYP1 B  28
     O                         RFNAM1 B  39
     O                         RFID1  B  53
     O                         RFFIL2 B  64
@3A  O                         RFTYP2 B  66
     O                         RFNAM2 B  77
     O                         RFID2  B  91
@3A  O                         WWFTXT B 132
     O*
@4A  O        E  1             ERROR
@4A  O                                   10 '*** ERROR:'
@4A  O                         ERRMSG B  18
@4A  O                         MSGDTA B  99
