      *%METADATA                                                       *
      * %TEXT Using a Data Area & checking for valid numeric fld       *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: DATAAREA
     H*Purpose: Using a data area (*DTAARA) in an RPG program.
     H*Called by: Command Line
     H*External Calls: None
     H*Compilation Notes/Parameters: None
     H* Indicator Usage Summary:
     H* --------- ----- -------
     H* 99 Error reading data area.
     H*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     I            DS
     I                                        1  50 ANNE
     I                                       12  14 LOCN
     I*
     I           UDS
     I                                        1   30LDALOC
     I*
     C* * * * * * * * * * *   Calculations   * * * * * * * * * * * * * * * **
     C*
     C*                  Define ExtName = PgmName
     C*                  ------ -------   ------
     C           *NAMVAR   DEFN COMDTA    ANNE
     C                     IN   ANNE                   99  ERR
     C                     TESTN          LOCN       010203 NU BN BL
     C* 01 = Result field has valid numeric data.
     C* 02 = Result field has valid numeric data with leading blanks.
     C* 03 = Result field is blank.
     C           *IN01     IFEQ *ON
     C           *IN02     OREQ *ON
     C                     MOVE LOCN      LOC     30
     C                     ELSE
     C                     Z-ADD*ZERO     LOC
     C                     ENDIF
     C*
     C           LOC       MULT 5         LDALOC
     C*
     C                     MOVE *ON       *INLR
     C*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
