      *%METADATA                                                       *
      * %TEXT 99Mar Fig 4   Web Only: Display Deleted Record Cou       *
      *%EMETADATA                                                      *
      ****************************************************************
      * Program Name: DSPDELRECR
      *  Program Lib: QGPL
      *   Created By: J.SULLIVAN    Date 18 Feb 1998
      *
      * FUNCTION:
      *      1. Display the deleted record counts for all the files
      *         within the requested library.
      *
      *      2. Calculate the ratio of deleted-to-active records.
      *
      *      3. Calculate the space savings of the deleted records.
      *
      *      4. Calculate total DASD usage.
      *
      *      5. Calculate the DASD savings of the deleted records.
      *
      ****************************************************************
      * Subroutine Usage                                             *
      ****************************************************************
      * *INZSR  Initialization
      * S001    Load file data and extract results
      * S002    Print subfile listing
      * S099    Housekeeping - Clear User Areas
      ****************************************************************
      * Indicator Usage                                              *
      ****************************************************************
      * 03  Exit requested by the operator
      * 06  Print requested by the operator
      * 09  Clear the subfile record
      * 10  Display subfile control record
      * 11  Display subfile record
      * 13  Chain error on subfile during printing subroutine
      * 21  EOF subfile
      * OV  Printer overflow
      ****************************************************************
      * FILE USAGE
      ****************************************************************
     FDSPDELFMCF  E                    WORKSTN
     F                                        RN1   KSFILE DSPDEL01
     FQSYSPRT O   F     132     OV     PRINTER
      ****************************************************************
      * Data Structures Required for API Use
      ****************************************************************
     I           SDS
     I                                     *ROUTINE LOC
     I                                     *STATUS  ERR
     I                                     *PARMS   PARM
     I                                     *PROGRAM NAME
     ISTRUCT      DS
     I                                    B   1   40USSIZE
     I                                    B   5   80GENLEN
     I                                    B   9  120RTVLEN
     I                                    B  13  160STRPOS
     I                                    B  17  200RCVLEN
     I                                    B  21  240SPLF#
     I                                       33  38 FIL#
     I                                    B  39  420GENL3
     I                                    B  43  460STRPS3
     ICSNTRY      DS
     I                                        1  16 ENTPTR
     I            DS
     I                                    B   1   40CSCNTR
     I            DS
     I                                    B   1   40WAITTM
     I            DS
     I                                    B   1   40MSGLGT
     I            DS
     I                                    B   1   40RCVLT4
      *========================================================
      * User Space for File Listing
      *========================================================
     I            DS
     I                                        1  20 USRSP1
     I I            'FILELIST  '              1  10 USRPG1
     I I            'QTEMP     '             11  20 USRLI1
      *========================================================
      * User Space for Number of Records
      *========================================================
     I            DS
     I                                        1  20 USRSP2
     I I            'FILERECS  '              1  10 USRPG2
     I I            'QTEMP     '             11  20 USRLI2
      *========================================================
      * User Space for Record Size
      *========================================================
     I            DS
     I                                        1  20 USRSP3
     I I            'FILESIZE  '              1  10 USRPG3
     I I            'QTEMP     '             11  20 USRLI3
      *========================================================
      * User Space for Source Type
      *========================================================
     I            DS
     I                                        1  20 USRSP4
     I I            'FILESRC   '              1  10 USRPG4
     I I            'QTEMP     '             11  20 USRLI4
      *========================================================
      * General User Space Result Fields
      *========================================================
     IGENHDR      DS
     I                                    B   1   40OFFSET
     I                                    B   9  120NUMENT
     I                                    B  13  160LSTSIZ
     IGENH3       DS
     I                                    B   1   40OFFST3
     I                                    B   9  120NUMEN3
     I                                    B  13  160LSTSZ3
      *========================================================
      * Error Code Data Structures
      *========================================================
     IERRCOD      DS
     I                                    B   1   40BYTPRO
     I                                    B   5   80BYTAVA
     I                                        9  15 EXCID
     I                                       16  16 RESRVD
     I                                       17 116 EXCDTA
      *========================================================
      * Error Handling API Structures
      *========================================================
     IMSGDTA      DS
     I                                    B   1   40MSGBRT
     I                                    B   5   80MSGBAV
     I                                    B   9  120MSGSEV
     I                                       13  19 MSGID
     I                                       20  21 MSGT
     I                                       22  25 MSGK
     I                                       26  32 RESV
     I                                    B  33  360CCS1
     I                                    B  37  400CCS2
     I                                    B  41  440RDLG1
     I                                    B  45  480RDLG2
      *============================================================
      * Data Structure for List of Files Within a Library
      *============================================================
     IRTVVAR      DS
     I                                        1  10 OBJNM
     I                                       11  20 OBJLIB
     I                                       21  30 OBJTYP
     I                                       31  31 OBJSTS
     I                                       32  41 OBJEXT
     I                                      193 202 SRCMBR
     I                                      541 548 LASTUD
      *============================================================
      * Data Structure Specific to Physical File Information
      *============================================================
     IRCVVAR      DS
     I                                    B   1   40BYTRTN
     I                                    B   5   80BYTVAL
     I                                        9  18 RFNAME
     I                                       19  28 RFLIBR
     I                                       29  38 RFMEMB
     I                                       39  48 RFATTR
     I                                       49  58 RFSRCT
     I                                       59  71 RFCRD
     I                                       72  84 RFLCD
     I                                       85 134 RFMEMT
     I                                      135 135 RFSRCF
     I                                      136 136 RFRMT
     I                                      137 137 RFLOP
     I                                      138 138 RFODP
     I                                      139 140 RFRESV
     I                                    B 141 1440RFRECN
     I                                    B 145 1480RFRECD
      *============================================================
      * Data Structure Specific to Record Format Information
      *============================================================
     IRCDVAR      DS
     I                                        1  10 RCDFMT
     I                                       11  23 RCDFID
     I                                       24  24 RESV3
     I                                    B  25  280RCDLGT
      *============================================================
      * Data Structure Specific to File Source Type Information
      *============================================================
     ISRCVAR      DS
     I                                    B   1   40STBYTR
     I                                    B   5   80STBAVA
     I                                    B   9  100STFTYP
     I                                       11 144 STF2
     I                                      145 400 STF3
      *============================================================
      * Constants
      *============================================================
     I              '*ALL      '          C         CONST1
     I              '*FILETYPE'           C         CONST2
     I              'DISPLAY DELETED RECO-C         HDG1
     I              'RDS'
     I              'No Files in library' C         ERR1
      ****************************************************************
      * Load the subfile with the physical file entries              *
      ****************************************************************
     C                     EXSR S000
     C                     EXSR S001
      ****************************************************************
      * Main processing                                              *
     C****************************************************************
     C           *IN03     DOUEQ'1'
     C                     WRITEDSPDEL99
     C                     EXFMTDSPDEL02
      * Exit Key requested
     C           *IN03     IFEQ '1'
     C                     EXSR S099
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     ENDIF
      * Print a list requested     =
     C           *IN06     IFEQ '1'
     C                     EXSR S002
     C                     ENDIF
      *
     C                     ENDDO
     C****************************************************************
     C* Load the File Data Subroutine.                               *
     C****************************************************************
     C           S000      BEGSR
      * Use API call 'QUSLOBJ' to list the *FILE objects
      * in the requested library LIBNAM
     C                     CALL 'QUSLOBJ'
     C                     PARM           USRSPC
     C                     PARM 'OBJL0600'FMTNM1  8
     C                     PARM           LIBF
     C                     PARM '*FILE'   OBJTYP
     C                     PARM           ERRCOD
      * Use API call 'QUSRTVUS' to get the offset to the
      * start of the list
     C                     Z-ADD16        GENLEN
     C                     Z-ADD125       STRPOS
     C                     CALL 'QUSRTVUS'
     C                     PARM           USRSPC
     C                     PARM           STRPOS
     C                     PARM           GENLEN
     C                     PARM           GENHDR
     C                     PARM           ERRCOD
      * Adjust position to value
     C                     Z-ADDOFFSET    STRPOS
     C                     ADD  1         STRPOS
     C                     Z-ADDLSTSIZ    RTVLEN
     C                     Z-ADD148       RCVLEN
     C                     Z-ADD1         COUNT  150
     C                     ENDSR
      *
      ****************************************************************
      * S001  Load Physical File Entries                             *
      ****************************************************************
     C           S001      BEGSR
      * Clear the subfile
     C                     Z-ADD1         RN1
     C                     MOVE *ON       *IN09
     C                     MOVE *OFF      *IN10
     C                     MOVE *OFF      *IN11
     C                     WRITEDSPDEL02
     C                     MOVE *OFF      *IN09
     C                     MOVE *ON       *IN10
     C                     MOVE *ON       *IN11
     C                     MOVE *ON       *IN21
      * Loop thru the 1st user space and get the file names
     C           COUNT     DOWLENUMENT
     C                     CALL 'QUSRTVUS'
     C                     PARM           USRSPC
     C                     PARM           STRPOS
     C                     PARM           RTVLEN
     C                     PARM           RTVVAR
     C                     PARM           ERRCOD
      * Set up the retrieval of the file member
     C           OBJNM     CAT  OBJLIB    DFILE  20
      * Call API to get the file's source type information
     C                     Z-ADD400       RCVLT4
     C                     MOVELCONST2    SRCSYS 10
     C                     CALL 'QDBRTVFD'
     C                     PARM           SRCVAR
     C                     PARM           RCVLT4
     C                     PARM           SRCFNM 20
     C                     PARM 'FILD0100'SRCFMT  8
     C                     PARM           DFILE
     C                     PARM '*FIRST'  SRCRCD 10
     C                     PARM '0'       SRCOVR  1
     C                     PARM           SRCSYS
     C                     PARM '*EXT'    SRCDEF 10
     C                     PARM           ERRCOD
      * Check the bit that determines *DATA or *SRC
      * *in86 = *ON  it's *SRC   *in86 = *OFF it's *DATA
     C                     MOVELSTFTYP    STFA    1
     C                     TESTB'6'       STFA           86
      * Skip anything that's not a physical file (PF)
      * Skip anything whose source type is *SRC
     C           OBJEXT    IFEQ 'PF'
     C           *IN86     ANDEQ*OFF
      * Call the Member Description Retrieval API
     C                     CALL 'QUSRMBRD'
     C                     PARM           RCVVAR
     C                     PARM           RCVLEN
     C                     PARM 'MBRD0200'FMTNM2  8
     C                     PARM           DFILE
     C                     PARM '*FIRST'  DMEMB  10
     C                     PARM '0'       DFOVRD  1
     C                     PARM           ERRCOD
      * Call the Record Format Retrieval API
     C                     CALL 'QUSLRCD'
     C                     PARM           USRSP3
     C                     PARM 'RCDL0200'FMTNM3  8
     C                     PARM           DFILE
     C                     PARM '0'       DFOVRD
     C                     PARM           ERRCOD
      * Now point to the start of the data in the space
     C                     Z-ADD132       GENL3
     C                     Z-ADD369       STRPS3
     C                     CALL 'QUSRTVUS'
     C                     PARM           USRSP3
     C                     PARM           STRPS3
     C                     PARM           GENL3
     C                     PARM           RCDVAR
     C                     PARM           ERRCOD
      * Move data to display fields
     C                     MOVELOBJNM     NAM#
     C                     Z-ADDRFRECD    DEL#
     C           RFRECN    ADD  RFRECD    NUM#
     C                     MOVELRFMEMT    TXT#
      * Calculate percentage of deleted records
     C           RFRECN    IFGT 0
     C           RFRECD    ORGT 0
     C           RFRECD    ADD  RFRECN    TOTREC 110
     C           RFRECD    DIV  TOTREC    PCTV    63
     C           PCTV      MULT 100.000   PCT#
     C                     ELSE
     C                     Z-ADD*ZEROS    PCT#
     C                     ENDIF
      * Calculate the total disk space used by the file
      *  (Number of Records) * (Record Length)
     C           RFRECN    MULT RCDLGT    TOTUSG 110
     C                     ADD  TOTUSG    DASDU
      * Calculate the total disk space you could return
      * to the main storage pool
      *  (Number of Deletes) * (Record Length)
     C           RFRECD    MULT RCDLGT    SAV#
     C                     ADD  1         FCOUNT
      * Increment the total number of files with deletes =
     C           RFRECD    IFGT *ZEROS
     C                     ADD  1         RCOUNT
     C                     ENDIF
      * Write a subfile record if the delete percentage
      * is above the threshold percentage and increment
      * the "Over Threshold" counter and the total
      * library variables
     C           PCT#      IFGE THLD
     C                     WRITEDSPDEL01
     C                     ADD  1         RN1
     C                     ADD  SAV#      DASDS
     C                     ENDIF
      *
     C                     ENDIF
      *
     C           LSTSIZ    ADD  STRPOS    STRPOS
     C           1         ADD  COUNT     COUNT
     C                     ENDDO
      * Say something if no files found                  =
     C           RN1       IFEQ 1
     C                     CLEARNAM#
     C                     CLEARNUM#
     C                     CLEARDEL#
     C                     CLEARTXT#
     C                     CLEARPCT#
     C                     CLEARSAV#
     C                     MOVELERR1      TXT#
     C                     WRITEDSPDEL01
     C                     ADD  1         RN1
     C                     ENDIF
     C                     MOVE *OFF      *IN21
     C                     ENDSR
      ****************************************************************
      * S002  Print a List                                           *
      * Loop thru the subfile and print the data                     *
      ****************************************************************
     C           S002      BEGSR
      *
      * Use print index (PX) to chain to subfile and print each
      * record.
      *
     C                     Z-ADD1         PX      40
     C                     Z-ADDRN1       FTOT    40
     C                     EXCPTHDG
      *
     C           PX        DOWLEFTOT
      *
     C           PX        CHAINDSPDEL01             13
     C           *IN13     IFEQ *OFF
      *
     C           *INOV     IFEQ *ON
     C                     EXCPTHDG
     C                     ENDIF
      *
     C                     EXCPTDET
     C                     ENDIF
      *
     C                     ADD  1         PX
     C                     ENDDO
      *
      *  Print Final Totals
      *
     C           *INOV     IFEQ *ON
     C                     EXCPTHDG
     C                     ENDIF
     C                     EXCPTTOT
      *
     C                     ENDSR
     C****************************************************************
     C* S098 Create the User Spaces                                  *
     C****************************************************************
     C           S098      BEGSR
      *
     C                     CALL 'QUSCRTUS'
     C                     PARM           USRSPC
     C                     PARM *BLANKS   USEXAT 10
     C                     PARM 4096      USSIZE
     C                     PARM X'00'     USINIT  1
     C                     PARM '*CHANGE 'USAUTH 10
     C                     PARM *BLANKS   USTEXT 50
     C                     PARM '*YES    'USREPL 10
     C                     PARM           ERRCOD
      *
     C                     ENDSR
     C****************************************************************
     C* S099 Delete the User Spaces                                  *
     C****************************************************************
     C           S099      BEGSR
      * File Listing
      * Housekeeping: Use API call 'QUSDLTUS' to delete
      *               the 1st User Space
     C                     CALL 'QUSDLTUS'
     C                     PARM           USRSPC
     C                     PARM           ERRCOD
      * File Data
      * Housekeeping: Use API call 'QUSDLTUS' to delete
      *               the 2nd User Space
     C                     CALL 'QUSDLTUS'
     C                     PARM           USRSP2
     C                     PARM           ERRCOD
      * File Size
      * Housekeeping: Use API call 'QUSDLTUS' to delete
      *               the 3rd User Space
     C                     CALL 'QUSDLTUS'
     C                     PARM           USRSP3
     C                     PARM           ERRCOD
      * File Source Type
      * Housekeeping: Use API call 'QUSDLTUS' to delete
      *               the 4th User Space
     C                     CALL 'QUSDLTUS'
     C                     PARM           USRSP4
     C                     PARM           ERRCOD
     C                     ENDSR
     C****************************************************************
     C*INITIAL SUBROUTINE                                            *
     C****************************************************************
     C           *INZSR    BEGSR
      * Passed Parms  (Library Name and Threshold Value)
     C           *ENTRY    PLIST
     C                     PARM           LIBNAM 10
     C                     PARM           THLD    20
      * User Space and Totaling Variables Setup
     C                     Z-ADD1         RN1     40
     C                     Z-ADD*ZEROS    FCOUNT
     C                     Z-ADD*ZEROS    RCOUNT
     C                     Z-ADD*ZEROS    DASDU  110
     C                     Z-ADD*ZEROS    DASDS  110
     C                     MOVE *BLANKS   ERRCOD
     C                     Z-ADD116       BYTPRO
     C                     Z-ADD36        BYTAVA
      *
     C           *LIKE     DEFN USRSP1    USRSPC
     C           *LIKE     DEFN USRSP1    LIBF
     C           CONST1    CAT  LIBNAM    LIBF
      *
      * Use API call 'QUSCRTUS' to create User Spaces
     C                     MOVELUSRSP1    USRSPC
     C                     EXSR S098
      *
     C                     MOVELUSRSP2    USRSPC
     C                     EXSR S098
      *
     C                     MOVELUSRSP3    USRSPC
     C                     EXSR S098
      *
     C                     MOVELUSRSP4    USRSPC
     C                     EXSR S098
      *
     C                     ENDSR
      ****************************************************************
      *OUTPUT                                                        *
      ****************************************************************
     OQSYSPRT E    2           HDG
     O                                   10 'DSPDELRECR'
     O                         HDG1      45
     O                         UDATE Y   55
     O        E 1              HDG
     O                                   10 'Threshold'
     O                         THLD  3   15
     O                                   16 '%'
     O        E 1              HDG
     O                                    7 'Library'
     O                                   17 'File'
     O                                   29 'Desc'
     O                                   59 'Records'
     O                                   69 'Deleted'
     O                                   76 'Del %'
     O                                   91 'Saved '
     O        E 1              DET
     O                         LIBNAM    11
     O                         NAM#      23
     O                         TXT#      49
     O                         NUM#  1   59
     O                         DEL#  1   69
     O                         PCT#  1   76
     O                         SAV#  1   91
     O        E 1              TOT
     O                                   32 'Library:'
     O                         LIBNAM    50
     O        E 1              TOT
     O                                   32 'Number of Files:'
     O                         FCOUNT1   50
     O        E 1              TOT
     O                                   32 'Files with Deleted Recs:'
     O                         RCOUNT1   50
     O        E 1              TOT
     O                                   32 'Approx Total DASD:'
     O                         DASDU 1   50
     O        E 1              TOT
     O                                   32 'Approx Reusable DASD:'
     O                         DASDS 1   50
