      *%METADATA                                                       *
      * %TEXT Display Field Attributes for a File                      *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*DSPFLDATTR "Display Field Attributes of a File"
     H*Purpose: List all fields with their length & text for a given file.
     H*
     H*Input: FFD - output of DSPFFD COMMAND
     H*Output: Printed report
     H*
     H*External Calls: None
     H*Compilation Notes/Parameters: FILE = File Name
     H*                              TEXT = File Description
     F*********************** File Specifications **************************
     FFFD     IP  E                    DISK
     FDSPFLDATO   F      80     OF     PRINTER
     C*********************** Calculations **********************************
     C* Parm list for this program:
     C           *ENTRY    PLIST
     C                     PARM           FILE   10
     C                     PARM           TEXT   50
     C*
     C           WHFLDT    IFEQ 'A'
@1A  C           WHFLDT    OREQ 'L'
@1A  C           WHFLDT    OREQ 'T'
@1A  C           WHFLDT    OREQ 'Z'
     C                     Z-ADDWHFLDB    LENGTH  50       ALPHA: # BYTES
     C                     MOVE *ON       *IN01
     C                     ELSE
     C                     Z-ADDWHFLDD    LENGTH  50       NUM: # DIGITS
     C                     MOVE *OFF      *IN01
     C                     ENDIF
     O*********************** Output Specifications ************************
     ODSPFLDATH  103   1P
     O       OR        OF
     O                                   10 'DSPFLDATTR'
     O                                   29 'Record Layout for'
     O                                   34 'file'
     O                         FILE      45
     O                                   56 'DATE'
     O                         UDATE Y   65
     O                                   75 'Page'
     O                         PAGE  Z   80
     O        H  2     1P
     O       OR        OF
     O                         TEXT      62
     O        H  2     1P
     O       OR        OF
     O                                   17 'Field Name'
     O                                   29 'Length'
     O                                   41 'Description'
     O        D  1    N1P
     O                         WHFLDI    17
     O                         WHFLDT    19
     O                         LENGTHZ   26
     O                 01                29 '   '
     O                N01      WHFLDP    29 '0 '
     O                         WHFTXT    80
