      *%METADATA                                                       *
      * %TEXT Using externally defined data area to pass parms         *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: ExtDtaAra
     H*Title: Using an externally defined data area to pass parms
     H*Function:
     H*1. Use DDS to define a physical file record layout matching the parms
     H* you want to pass, and create it with MBR(*NONE) - it will NOT
     H* be used to hold data, it's just to externally define the parms.
     H*
     H*2. Reference it in both caller and called programs.
     H*
     H*Input:
     H*Output:
     H*Called by:
     H*External Calls: None
     H*Compilation Notes/Parameters: None
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * *
     F*
     FQPRINT  O   F     132     OF     PRINTER
     F*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     I* Extra Parms described in an external data area:
     IEXTPAR    EUDSEXTPARMS
     I* Note that the actual file can have an 8-byte name, but the
     I* name used by the program is limited to 6 bytes.
     I*
     C* * * * * * * * * *  Calculations  * * * * * * * * * * * * * * * * * * * *
     C*
     C                     OUT  EXTPAR
     C*
     C                     SETON                     LR
     C*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*
     C* * * * * * * * * *  Subroutines  * * * * * * * * * * * * * * * * * * * *
     C*           -----    -----
     C           *INZSR    BEGSR
     C* Initial Subroutine; executed automatically when program starts:
     C*
     C           *ENTRY    PLIST
     C                     PARM           PARM1  32
     C                     PARM           PARM2  32
     C*
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C*
     C                     ENDSR                           End *INZSR
     C*                    -----
     C*
     O* * * * * * * * * * *   Output Specifications   * * * * * * * * * * *
     OQPRINT  H  203   1P
     O       OR        OF
     O                         PGM       10
     O* Report name left justified in first 10 positions
     O                         X2LC  Z   14
     O                         X2CNAM    40
     O                                   63 'Report Title'
     O* Report Title can be up to 50 characters; center between 40 and 90
     O                                   95 'Date'
     O                         UDATE Y  104
     O                         TIME     116 '  :  :  '
     O                                  127 'Page'
     O                         PAGE  Z  132
