      *%METADATA                                                       *
      * %TEXT Processing a multi-format logical file                   *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name:
     H*Purpose:
     H*Function:
     H*Notes:
     H*Input:
     H*Output:
     H*Called by:
     H*External Calls: None
     H*Compilation Notes/Parameters: None
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * *
     F*
     FU5CKWRT IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     F*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     I* Define RIIs for the four formats in the U5CHKWRT logical file:
     IU5K1REC     01
     I*
     IU5K2REC     02
     I*
     IU5K3REC     03
     I*
     IU5K4REC     04
     I*
     I* Program Status Data Structure:
     I           SDS
     I                                     *PROGRAM PGM
     I                                     *PARMS   #PARMS
     I                                      244 253 WSID
     I                                      254 263 URID
     I*
     I* 2 DS used by Date Conversion Subroutines CVT628 and CVT826:
     I            DS
     I                                        1   80DATE8
     I                                        1   20C8
     I                                        3   40Y8
     I                                        5   80MD8
     I                                        5   60M8
     I                                        7   80D8
     I*
     I            DS
     I                                        1   60DATE6
     I                                        1   40MD6
     I                                        1   20M6
     I                                        3   40D6
     I                                        5   60Y6
     I*
     C* * * * * * * * * * *   Calculations   * * * * * * * * * * * * * * * **
     C*
     C                     Z-ADDCWCKDT    DATE8
     C                     EXSR CVT826
     C*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*
     C* * * * * * * * * * *   Subroutines  * * * * * * * * * * * * * * * * **
     C*           -----    -----
     C           *INZSR    BEGSR
     C* Initial Subroutine; executed automatically when program starts:
     C*
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C*
     C                     ENDSR                           END *INZSR
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*                    -----
     C           CVT826    BEGSR
     C* Convert 8-digit CCYYMMDD dates to 6-digit MMDDYY format:
     C                     Z-ADDMD8       MD6
     C                     Z-ADDY8        Y6
     C                     ENDSR                           CVT826
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*                    -----
     C           CVT628    BEGSR
     C* Convert 6-digit MMDDYY dates to 8-digit CCYYMMDD format:
     C           Y6        IFGE 40
     C                     Z-ADD19        C8
     C                     ELSE
     C                     Z-ADD20        C8
     C                     END
     C                     Z-ADDY6        Y8
     C                     Z-ADDMD6       MD8
     C                     ENDSR                           CVT628
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     O* * * * * * * * * * *   Output Specifications   * * * * * * * * * * *
     OQPRINT  H  203   1P
     O       OR        OF
     O                         PGM       10
     O                                   63 'Check Writer Records'
     O                                   95 'DATE'
     O                         UDATE Y  104
     O                         TIME     116 '  :  :  '
     O                                  127 'Page'
     O                         PAGE  Z  132
     O        D  1     01
     O                         CWPYNO     7
     O                         CWPYNM    58
     O                         CWCOD1    60
     O                         DATE6 Y   69
     O                         CWCKNOZ   77
     O*
     O        D  1     02
     O                         CWPYNO     7
     O                         CWPYNM    58
     O                         CWCOD2    60
     O                         CWTEXT   132
     O*
     O        D  1     03
     O                         CWPYNO     7
     O                         CWPYNM    58
     O                         CWCOD3    60
     O                         CWCRDE    80
     O*
     O        D  1     04
     O                         CWPYNO     7
     O                         CWPYNM    58
     O                         CWCOD4    60
     O                         CWLNN1   132
