      *%METADATA                                                       *
      * %TEXT Level Breaks With Chains                                 *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H* Sample Level Break Program with Chains
     H*
     H* Code L1 totals first, then L2, etc.
     H*
     H* Sort input from Major to Minor order: L3, L2, L1
     H*
     H* L1 changes more frequently than L2, etc.
     H*
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     F* * * * * * * * * * * * File Specifications * * * * * * * * * * ******
     FTESTDATAIP  E                    DISK
     FCOMAST  IF  E           K        DISK
     FLOCMAST IF  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I* * * * * * * * * * * * Input Specifications  * * * * * * * * * ******
     ITESTREC
     I                                              COMP  L2
     I                                              LOC   L1
     I*
     I* Program Status Data Structure:    (Program Name)
     I           SDS
     I                                     *PROGRAM PGM
     I*
     C* * * * * * * * * * * * Calculations  * * * * * * * * * * * * * *******
     C   L1      LOC       CHAINLOCMAST              99
     C   L2      COMP      CHAINCOMAST               98
     C                     ADD  SALE      L1AMT   82
     CL1                   ADD  L1AMT     L2AMT   82
     CL2                   ADD  L2AMT     LRAMT   92
     C* * * * * * * * * * * * Subroutines * * * * * * * * * * * * * * *******
     C           *INZSR    BEGSR
     C*           -----    -----
     C* Put all KLISTs, PLISTs, *LIKE definitions here.
     C*
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C                     ENDSR                           *INZSR
     C*                    -----
     O*********************** Output Specifications ************************
     OQPRINT  H  203   L2
     O       OR        OFNL2
     O                         PGM       10
     O                                   63 'Sales Report'
     O                                   95 'Date'
     O                         UDATE Y  104
     O                         TIME     116 '  :  :  '
     O                                  127 'Page'
     O                         PAGE  Z  132
     O        H  3     L2
     O       OR        OFNL2
     O*                                  20 'Company'
     O*                                  41 'Location'
     O                                   45 'Emp #'
     O                                   60 'Amount'
     O        D  2
     O                 L2      CONAME    20
     O                 L2                28 'Company'
     O        D  2
     O                         EMP   Z   45
     O                         SALE  K   60
     O        T  2     L1
     O                                    9 'Location'
     O                         LOCNAM    30
     O                                   36 'Total'
     O                         L1AMT KB  60
     O        T 13     L2
     O                                   45 'Company Total'
     O                         L2AMT KB  60
     O        T 3      LR
     O                                   45 'Report Total'
     O                         LRAMT K   60
