      *%METADATA                                                       *
      * %TEXT Validity Checking Program for MIXEDLIST Command          *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*MIXEDLISTR:
     H*Purpose: Validity Checking Program for the MIXEDLIST Command
     H*
     H*
     H*
     H*Parameters:
     H*Input: P1
     H*Output:
     H*
     H*
     H*External Calls: None
     H*Compilation Notes/Parameters: None
      *
     I*********************** Input Specifications *************************
     I              'SNDPGMMSG MSG(''Dumm-C         ERR
     I              'y'') '
     I* Break single parm from mixed list into component parts:
     IFRED        DS
     I                                    B   1   20#PARMS
     I                                        3  12 OUTQ
     I                                       13  14 A#COPY
     I                                       13  140#COPY
     C*********************** Calculations *********************************
     C*
     C           *ENTRY    PLIST
     C                     PARM           CHAR   14
     C*
     C                     MOVE CHAR      FRED
     C* Validate Number of Copies requested:
     C           #COPY     IFGT 25
     C           #COPY     ORLT 1
     C                     MOVE *BLANKS   ERR2   80
     C                     MOVELERR       ERR2
     C                     Z-ADD80        ERR3    20
     C                     CALL 'QCMDEXC'
     C                     PARM           ERR2
     C                     PARM           ERR3
     C                     END
     C*
     C                     SETON                       LR
