      *%METADATA                                                       *
      * %TEXT Standard Headers for 132 col. Printed Reports            *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*NAME      "TITLE"
     H*Purpose:
     H*
     H*Input:
     H*                                                                s
     H*Output: Printed report
     H*
     H*External Calls:
     H*Compilation Notes/Parameters: None
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     F* * * * * * * * * * * * File Specifications * * * * * * * * * * ******
     I* * * * * * * * * * * * Input Specifications  * * * * * * * * * ******
     I* Program Status Data Structure:    (Program Name)
     I           SDS
     I                                     *PROGRAM PGM
     I*
     I/COPY UPCRC0
     C* * * * * * * * * * * * Calculations  * * * * * * * * * * * * * *******
     C* * * * * * * * * * * * Subroutines * * * * * * * * * * * * * * *******
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C* INITALIZATION SUBROUTINE: EXECUTED ONCE AT BEGINNING OF JOB *
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*
     C*           -----    -----
     C           *INZSR    BEGSR
     C*           -----    -----
     C* Put all KLISTs, PLISTs, *LIKE definitions here.
     C*
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C* Call U4C2V1 to get Company Name:
     C                     Z-ADD001       X2LC             Location = 1
     C                     MOVE PGM       X2PGM
     C                     CALL 'U2C2V1'  C2LOC
     C*
     C                     ENDSR                           *INZSR
     C*                    -----
     O*********************** Output Specifications ************************
     OQPRINT  H  203   1P
     O       OR        OF
     O                         PGM       10
     O* Report name left justified in first 10 positions
     O                         X2LC  Z   14
     O                         X2CNAM    40
     O                                   63 'Report Title'
     O* Report Title can be up to 50 characters; center between 40 and 90
     O                                   95 'Date'
     O                         UDATE Y  104
     O                         TIME     116 '  :  :  '
     O                                  127 'Page'
     O                         PAGE  Z  132
