      *%METADATA                                                       *
      * %TEXT Standard Headers for  80 col. Printed Reports            *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*NAME      "TITLE"
     H*Purpose:
     H*
     H*Input:
     H*                                                                s
     H*Output: Printed report
     H*
     H*External Calls:
     H*Compilation Notes/Parameters: None
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     F* * * * * * * * * * * * File Specifications * * * * * * * * * * ******
     I* * * * * * * * * * * * Input Specifications  * * * * * * * * * ******
     I* Program Status Data Structure:    (Program Name)
     I           SDS
     I                                     *PROGRAM PGM
     I*
     I/COPY UPCRC0
     C* * * * * * * * * * * * Calculations  * * * * * * * * * * * * * *******
     C* * * * * * * * * * * * Subroutines * * * * * * * * * * * * * * *******
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C* INITALIZATION SUBROUTINE: EXECUTED ONCE AT BEGINNING OF JOB *
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*
     C*           -----    -----
     C           *INZSR    BEGSR
     C*           -----    -----
     C* Put all KLISTs, PLISTs, *LIKE definitions here.
     C*
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C* Call U4C2V1 to get Company Name:
     C                     Z-ADD001       X2LC             Location = 1
     C                     MOVE PGM       X2PGM
     C                     CALL 'U2C2V1'  C2LOC
     C*
     C                     ENDSR                           *INZSR
     C*                    -----
     O*********************** Output Specifications ************************
     OQPRINT  H  103   1P
     O       OR        OF
     O                         PGM       10
     O                         UPLC  Z   14
     O                         UPCNAM    40
     O                                   43 'Date'
     O                         UDATE Y   52
     O                         TIME      64 '  :  :  '
     O                                   75 'Page'
     O                         PAGE  Z   80
     O* Report Title:
     O        H  2     1P
     O       OR        OF
     O                                   50 'Title'
     O* Column Headings:
     O        H  2     1P
     O       OR        OF
     O                                    7 'Col 1'
