      *%METADATA                                                       *
      * %TEXT Will RPG/400 support Unicode?                            *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: P31142
     H*Title: Will RPG/400 support Unicode?
     H*Function:
     H*Input:
     H*Output:
     H*Called by:
     H*External Calls: None
     H*Compilation Notes/Parameters: None
     H* CRTRPGPGM PGM(P31143) CVTOPT(*VARCHAR *GRAPHIC) SRTSEQ(*JOB)
     H*
     H* Indicator Usage Summary:
     H* --------- ----- -------
     H*
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * *
     F*
     FCOMASTUCIP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     F*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     I* Program Status Data Structure:
     I           SDS
     I                                     *PROGRAM PGM
     I                                     *PARMS   #PARMS
     I                                     *STATUS  STATUS
     I* ID of last error message received:
     I                                       40  46 ERRMSG
     I* If status = 202, err on called pgm, WRKARA has the program name:
     I                                       51  80 WRKARA
     I* Message data for last error message:
     I                                       91 170 MSGDTA
     I                                      244 253 WSID
     I                                      254 263 URID
     I*
     C* * * * * * * * * *  Calculations  * * * * * * * * * * * * * * * * * * * *
     C*
     C* * * * * * * * * *  Subroutines  * * * * * * * * * * * * * * * * * * * *
     C*           -----    -----
     C           *INZSR    BEGSR
     C* Initial Subroutine; executed automatically when program starts:
     C*
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C*
     C                     ENDSR                           End *INZSR
     C*                    -----
     C*
     O* * * * * * * * * * *   Output Specifications   * * * * * * * * * * *
     OQPRINT  H  203   1P
     O       OR        OF
     O                         PGM       10
     O* Report name left justified in first 10 positions
     O                                    6 'P31143'
     O                                   63 'Print Unicode File'
     O                                   95 'Date'
     O                         UDATE Y  104
     O                         TIME     116 '  :  :  '
     O                                  127 'Page'
     O                         PAGE  Z  132
