      *%METADATA                                                       *
      * %TEXT Passing packed data to a float field in RPG ILE          *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: P55678OPM
     H*Title: Passing packed data to a float field in RPG ILE
     H*Function:
     H*Input:
     H*Output:
     H*Called by:
     H*External Calls: None
     H*Compilation Notes/Parameters: None
     H*
     C* * * * * * * * * *  Calculations  * * * * * * * * * * * * * * * * * * * *
     C*
     C                     Z-ADD123456789 PARM1   90
     C                     Z-ADD123456789 PARM2  110
     C                     CALL 'P55678'
     C                     PARM           PARM1
     C                     PARM           PARM2
     C*
     C           PARM1     DSPLY
     C*
     C                     MOVE *ON       *INLR
     C*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
