      *%METADATA                                                       *
      * %TEXT Test recursive calls of programs A, B & C                *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: PGMA
     H*Purpose:
     H*Function:
     H*Input:
     H*Output:
     H*Called by: PGMB, PGMC
     H*External Calls: PGMB, PGMC
     H*Compilation Notes/Parameters: None
     H*
     H* Indicator Usage Summary:
     H* --------- ----- -------
     H* 99 Recursive call
     H*
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * *
     F*
     FPGMA    CF  E                    WORKSTN      KINFDS DEVDS1
     F*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     I* Program Status Data Structure:
     I           SDS
     I                                     *PROGRAM PGM
     I                                     *PARMS   #PARMS
     I                                      244 253 WSID
     I                                      254 263 URID
     I*
     I* Workstation File Information Data Structure (INFDS)
     IDEVDS1      DS
     I                                     *STATUS  STATUS
     I                                      369 369 KEY
     I                                    B 370 3710CSRLOC
     I*
     C* * * * * * * * * * *   Calculations   * * * * * * * * * * * * * * * **
     C*
     C           TOP       TAG
     C*          ---       ---
     C                     EXFMTPGMAR
     C           *IN03     IFEQ *ON
     C           *IN12     OREQ *ON
     C* Update the stack pointer when this program ends.
     C           PGM2      IFEQ *BLANK
     C                     MOVE *BLANKS   PGM1
     C                     ELSE
     C                     MOVE *BLANKS   PGM2
     C                     ENDIF
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     ENDIF
     C* F10 = CALL PGMB
     C           *IN10     IFEQ *ON
     C                     SELEC
     C           PGM1      WHEQ *BLANK
     C* If this program is on top of the stack, it can call anything.
     C                     MOVE PGM       PGM1
     C*                    Register as first program in stack.
     C                     CALL 'PGMB'
     C                     PARM           PGM1
     C                     PARM           PGM2
     C           PGM1      WHEQ 'PGMB'
     C           PGM2      ANDEQ*BLANK
     C* This program is #2 in the stack, and the program the user wants to
     C* call is the program that called this one, so exit to return to it.
     C                     MOVE *BLANK    PGM1             Pop stack
     C                     MOVE *ON       *INLR
     C                     RETRN
     C           PGM2      WHEQ *BLANK
     C* This program is #2 in the stack and user wants the third program
     C* in this set, go call it:
     C                     MOVE PGM       PGM2             Push stack
     C                     CALL 'PGMB'
     C                     PARM           PGM1
     C                     PARM           PGM2
     C           PGM2      WHEQ 'PGMB'
     C* When this program is #3 in the stack, it can ONLY call the
     C* previous program. End program to go back.
     C                     MOVE *BLANK    PGM2             Pop stack
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     OTHER
     C* Otherwise, the call is recursive. Send a message to the user to
     C* explain that it's not allowed.
     C                     MOVE *ON       *IN99            Error
     C                     ENDSL                           End Select
     C                     ENDIF                           END IF *IN10
     C*
     C* F11 = CALL PGMC
     C           *IN11     IFEQ *ON
     C                     SELEC
     C           PGM1      WHEQ *BLANK
     C                     MOVE PGM       PGM1
     C                     CALL 'PGMC'
     C                     PARM           PGM1
     C                     PARM           PGM2
     C           PGM2      WHEQ *BLANK
     C           PGM1      ANDEQ'PGMC'
     C                     MOVE *BLANK    PGM1
     C                     MOVE *ON       *INLR
     C                     RETRN
     C           PGM2      WHEQ *BLANK
     C                     MOVE PGM       PGM2
     C                     CALL 'PGMC'
     C                     PARM           PGM1
     C                     PARM           PGM2
     C           PGM2      WHEQ 'PGMC'
     C                     MOVE *BLANK    PGM2
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     OTHER
     C                     MOVE *ON       *IN99
     C                     ENDSL
     C                     ENDIF                           END IF *IN11
     C*
     C                     GOTO TOP
     C*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*
     C* * * * * * * * * * *   Subroutines  * * * * * * * * * * * * * * * * **
     C*           -----    -----
     C           *INZSR    BEGSR
     C* Initial Subroutine; executed automatically when program starts:
     C*
     C           *ENTRY    PLIST
     C                     PARM           PGM1   10
     C                     PARM           PGM2   10
     C*
     C                     ENDSR                           End *INZSR
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
