      *%METADATA                                                       *
      * %TEXT Test recursive calls of programs A, B & C                *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: PGMB
     H*Purpose:
     H*Function:
     H*Input:
     H*Output:
     H*Called by: PGMA, PGMC
     H*External Calls: PGMA, PGMC
     H*Compilation Notes/Parameters: None
     H*
     H* Indicator Usage Summary:
     H* --------- ----- -------
     H* 99 Recursive call
     H*
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * *
     F*
     FPGMB    CF  E                    WORKSTN      KINFDS DEVDS1
     F*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     I* Program Status Data Structure:
     I           SDS
     I                                     *PROGRAM PGM
     I                                     *PARMS   #PARMS
     I                                      244 253 WSID
     I                                      254 263 URID
     I*
     I* Workstation File Information Data Structure (INFDS)
     IDEVDS1      DS
     I                                     *STATUS  STATUS
     I                                      369 369 KEY
     I                                    B 370 3710CSRLOC
     I*
     C* * * * * * * * * * *   Calculations   * * * * * * * * * * * * * * * **
     C*
     C           TOP       TAG
     C*          ---       ---
     C                     EXFMTPGMBR
     C           *IN03     IFEQ *ON
     C           *IN12     OREQ *ON
     C           PGM2      IFEQ *BLANK
     C                     MOVE *BLANKS   PGM1
     C                     ELSE
     C                     MOVE *BLANKS   PGM2
     C                     ENDIF
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     ENDIF
     C* F10 = CALL PGMA
     C           *IN10     IFEQ *ON
     C                     SELEC
     C           PGM1      WHEQ *BLANK
     C                     MOVE PGM       PGM1
     C                     CALL 'PGMA'
     C                     PARM           PGM1
     C                     PARM           PGM2
     C           PGM2      WHEQ *BLANK
     C           PGM1      ANDEQ'PGMA'
     C                     MOVE *BLANK    PGM1
     C                     MOVE *ON       *INLR
     C                     RETRN
     C           PGM2      WHEQ *BLANK
     C                     MOVE PGM       PGM2
     C                     CALL 'PGMA'
     C                     PARM           PGM1
     C                     PARM           PGM2
     C           PGM2      WHEQ 'PGMA'
     C                     MOVE *BLANK    PGM2
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     OTHER
     C                     MOVE *ON       *IN99
     C                     ENDSL
     C                     ENDIF                           END IF *IN10
     C*
     C* F11 = CALL PGMC
     C           *IN11     IFEQ *ON
     C                     SELEC
     C           PGM1      WHEQ *BLANK
     C                     MOVE PGM       PGM1
     C                     CALL 'PGMC'
     C                     PARM           PGM1
     C                     PARM           PGM2
     C           PGM2      WHEQ *BLANK
     C           PGM1      ANDEQ'PGMC'
     C                     MOVE *BLANK    PGM1
     C                     MOVE *ON       *INLR
     C                     RETRN
     C           PGM2      WHEQ *BLANK
     C                     MOVE PGM       PGM2
     C                     CALL 'PGMC'
     C                     PARM           PGM1
     C                     PARM           PGM2
     C           PGM2      WHEQ 'PGMC'
     C                     MOVE *BLANK    PGM2
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     OTHER
     C                     MOVE *ON       *IN99
     C                     ENDSL
     C                     ENDIF                           END IF *IN11
     C*
     C                     GOTO TOP
     C*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*
     C* * * * * * * * * * *   Subroutines  * * * * * * * * * * * * * * * * **
     C*           -----    -----
     C           *INZSR    BEGSR
     C* Initial Subroutine; executed automatically when program starts:
     C*
     C           *ENTRY    PLIST
     C                     PARM           PGM1   10
     C                     PARM           PGM2   10
     C*
     C                     ENDSR                           End *INZSR
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
