      *%METADATA                                                       *
      * %TEXT Sample Proem & common routines                           *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name:
     H*Title: (Limit this to 30 bytes if it will also be used for a command)
     H*Function:
     H*Input:
     H*Output:
     H*Called by:
     H*External Calls: None
     H*Compilation Notes/Parameters: None
     H*
     H* Indicator Usage Summary:
     H* --------- ----- -------
     H* 01
     H*
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * *
     F*
     FWRKSTN  CF  E                    WORKSTN      KINFDS DEVDS1
     FIN      IP  E           K        DISK
     FOUT     O   F     132     OF     PRINTER
     F*
     E* * * * * * * * * * *   Array Specifications  * * * * * * * * * * * *
     E*
     E*
     L* * * * * * * * *  Line Counter Specifications  * * * * * * * * * * *
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     I* Program Status Data Structure:
     I           SDS
     I                                     *PROGRAM PGM
     I                                     *PARMS   #PARMS
     I                                     *STATUS  STATUS
     I* ID of last error message received:
     I                                       40  46 ERRMSG
     I* If status = 202, err on called pgm, WRKARA has the program name:
     I                                       51  80 WRKARA
     I* Message data for last error message:
     I                                       91 170 MSGDTA
     I                                      244 253 WSID
     I                                      254 263 URID
     I*
     I* Named Constants; how to continue:
     I              'OVRPRTF -            C         OVRCMD
     I              'FILE(U5CHECKS) -
     I              'TOFILE(QPRINT)'
     I*
     I* Workstation File Information Data Structure (INFDS)
     IDEVDS1      DS
     I                                     *STATUS  STATUS
     I                                      369 369 KEY
     I                                    B 370 3710CSRLOC
     I*
     I* 2 DS used by Date Conversion Subroutines CVT628 and CVT826:
     I            DS
     I                                        1   80DATE8
     I                                        1   20C8
     I                                        3   40Y8
     I                                        5   80MD8
     I                                        5   60M8
     I                                        7   80D8
     I*
     I            DS
     I                                        1   60DATE6
     I                                        1   40MD6
     I                                        1   20M6
     I                                        3   40D6
     I                                        5   60Y6
     I*
     C* * * * * * * * * *  Calculations  * * * * * * * * * * * * * * * * * * * *
     C*
     C                     Z-ADDXXDATE    DATE8
     C                     EXSR CVT826
     C*
     C                     Z-ADDXXDATE    DATE6
     C                     EXSR CVT628
     C*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*
     C* * * * * * * * * *  Subroutines  * * * * * * * * * * * * * * * * * * * *
     C*           -----    -----
     C           *INZSR    BEGSR
     C* Initial Subroutine; executed automatically when program starts:
     C*
     C           *ENTRY    PLIST
     C                     PARM           PARM1
     C                     PARM           PARM2
     C*
     C* Key list for ------- file:
     C           XXKLST    KLIST
     C                     KFLD           XXFLD1
     C                     KFLD           XXFLD2
     C*
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C*
     C                     ENDSR                           End *INZSR
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           CVT826    BEGSR
     C* Convert 8-digit CCYYMMDD dates to 6-digit MMDDYY format:
     C                     Z-ADDMD8       MD6
     C                     Z-ADDY8        Y6
     C                     ENDSR                           End CVT826
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           CVT628    BEGSR
     C* Convert 6-digit MMDDYY dates to 8-digit CCYYMMDD format:
     C           Y6        IFGE 40
     C                     Z-ADD19        C8
     C                     ELSE
     C                     Z-ADD20        C8
     C                     END
     C                     Z-ADDY6        Y8
     C                     Z-ADDMD6       MD8
     C                     ENDSR                           End CVT628
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     O* * * * * * * * * * *   Output Specifications   * * * * * * * * * * *
