      *%METADATA                                                       *
      * %TEXT Save user input as default values for next run           *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: SAVUSRDFT
     H*Title: Save user input as default values for next run.
     H*Function:
     H*Input:
     H*Output:
     H*Called by: Command Line
     H*External Calls: None
     H*Compilation Notes/Parameters: None
     H*
     H* Indicator Usage Summary:
     H* --------- ----- -------
     H* 99 NRF on chain
     H*
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * *
     F*
     FOQFSEL2 CF  E                    WORKSTN      KINFDS DEVDS1
     FUSRDFT  UF  E           K        DISK                      A
     F*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     I* Program Status Data Structure:
     I           SDS
     I                                     *PROGRAM PGM
     I                                     *PARMS   #PARMS
     I                                      244 253 WSID
     I                                      254 263 USERID
     I*
     I* Workstation File Information Data Structure (INFDS)
     IDEVDS1      DS
     I                                     *STATUS  STATUS
     I                                      369 369 KEY
     I                                    B 370 3710CSRLOC
     I*
     I              X'33'                 C         EXIT
     I*
     C* * * * * * * * * *  Calculations  * * * * * * * * * * * * * * * * * * * *
     C*
     C                     EXFMTOQFS2REC
     C*
     C           KEY       IFEQ EXIT                       F3 = Exit
     C                     EXSR SAVDFT                     Save default values
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     ENDIF
     C*
     C* . . . PROCESSING STEPS . . .
     C                     EXSR SAVDFT                     Save default values
     C                     MOVE *ON       *INLR
     C*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*
     C* * * * * * * * * *  Subroutines  * * * * * * * * * * * * * * * * * * * *
     C*           -----    -----
     C           *INZSR    BEGSR
     C* Initial Subroutine; executed automatically when program starts:
     C*
     C* Screen defaults:
     C           USERID    CHAINUSRDFT               99    NRF
     C           *IN99     IFEQ *OFF
     C                     Z-ADDUDLOC     LOC              Last value used
     C                     Z-ADDUDLOC2    LOC2             Last value used
     C                     Z-ADDUDLOC3    LOC3             Last value used
     C                     Z-ADDUDLOC4    LOC4             Last value used
     C                     Z-ADDUDLOC5    LOC5             Last value used
     C                     MOVE UDCROP    CROP             Last value used
     C                     ELSE
     C                     Z-ADD1         LOC              Default
     C                     MOVE 'ZZ'      CROP             Default
     C                     ENDIF                           99 = OFF
     C*
     C                     ENDSR                           End *INZSR
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           SAVDFT    BEGSR
     C* Save last values used for use as default values next time this
     C* user calls the program.
     C*
     C                     MOVE USERID    UDUSER
     C           UDUSER    CHAINUSRDFT               99    NRF
     C                     Z-ADDLOC       UDLOC            Last value used
     C                     Z-ADDLOC2      UDLOC2           Last value used
     C                     Z-ADDLOC3      UDLOC3           Last value used
     C                     Z-ADDLOC4      UDLOC4           Last value used
     C                     Z-ADDLOC5      UDLOC5           Last value used
     C                     MOVE CROP      UDCROP           Last value used
     C           *IN99     IFEQ *OFF                       IF 99 = OFF
     C                     UPDATUDREC                      Change old values
     C                     ELSE
     C                     WRITEUDREC                      Add new record
     C                     ENDIF                           99 = OFF
     C*
     C                     ENDSR                           END SAVDFT
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
