      *%METADATA                                                       *
      * %TEXT Subfile: Display SFL & Select a record w/Msg SFL         *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: SFLSEL2
     H*Purpose: Example of a subfile selection program.
     H*Note: Shows control record with message if no records in subfile.
     H*Function:
     H*Notes:
     H*Called by: Menu or Command Line
     H*External Calls: None
     H*Compilation Notes/Parameters: None
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*  Indicator Usage Summary:
     H*  --------- ----- -------
     H* 01-24 = F1-F24
     H* 52 Error found
     H* 70 Display Subfile (SFLDSP)
     H* 71 Clear Subfile (SFLCLR)
     H* 73 Subfile Next Change (SFLNXTCHG) causes an error to keep appearing
     H*    on the READC operation until the user corrects it.
     H* 81 Invalid Option # selected (RI/PC on SFL record)
     H* 82 More than one Option # selected (RI/PC on SFL record)
     H* 99 Stop writing subfile: either EOF on input file, or subfile full.
     H*
     H*  Display Screens:
     H*  ------- -------
     H* 10 = Subfile Data Records (SFL) and input options.
     H* 20 = Subfile Control Record (SFLCTL) Title, Column Headings, Options
     H* 30 = Trailer Record. Lists all valid command keys.
     H*
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * *
     FSFLSEL2 CF  E                    WORKSTN      KINFDS WSDS
     F                                        RRN   KSFILE SFLSEL10
     FNAMEFILEIF  E           K        DISK
     F*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     IWSDS        DS
     I*               Identifies the key pressed
     I                                      369 369 FKEY
     I                                    B 372 3750DTALEN
     I                                    B 376 3770SFLRRN
     I                                    B 378 3790MINRRN
     I*
     I* Program Status Data Structure:
     I           SDS
     I                                     *PROGRAM PGM
     I*
     I* LDA:
     I           UDS
     I                                        1  25 OUTDTA
     I*
     I* Binary fields used by Message Handler APIs:
     I            DS
     I I            80                    B   1   40$MDLEN
     I I            0                     B   5   80$MSTK
     I*
     I* API Error message structure:
     I$APIER      DS
     I I            80                    B   1   40$ERSIZ
     I I            0                     B   5   80$ERLEN
     I                                        9  15 $ERMIC
     I                                       16  16 $ERRSV
     I                                       17  96 $ERTXT
     I*
     I* Error message structure for handling errors calling the API:
     I$QMHER      DS
     I I            16                    B   1   40$MHSIZ
     I I            0                     B   5   80$MHLEN
     I                                        9  15 $MHMIC
     I                                       16  16 $MHRSV
     I*
     C* * * * * * * * * * *   Calculations   * * * * * * * * * * * * * * * **
     C*
     C                     EXSR CLRSF                      Clear Subfile
     C                     EXSR BLDSF                      Build Subfile
     C*
     C           @ERROR    DOUEQ*OFF                       Off -> no errors
     C                     EXSR DSPSF                      Display Subfile
     C                     EXSR CMDKEY                     Process Cmd Keys
     C                     MOVE *OFF      @ERROR           Errors?
     C           RRN       IFGT *ZERO                      Any recs in SF?
     C                     EXSR PRCSF                      Process Selection
     C                     ENDIF                           End RRN > 0
     C                     ENDDO                           End DOWH @ERR=off
     C*
     C* Set on LR here to cause pgm to end if user presses ENTER with no
     C*  selection, otherwise program will execute until F3 pressed.
     C                     MOVE *ON       *INLR
     C*
     C* * * * * * * * * * *   Subroutines  * * * * * * * * * * * * * * * * **
     C*                    -----
     C           *INZSR    BEGSR
     C*
     C* Relative record # of 1st subfile record with an error:
     C                     Z-ADD1         ERREC#           SFL Rec# to dsply
     C*
     C                     MOVE *OFF      @ERROR  1        User input error?
     C*
     C* Parm List for QMHRMVPM (Remove program messages):
     C           $RPLST    PLIST
     C                     PARM           $MSGQ            Message Queue
     C                     PARM           $MSTK            Call Stack Countr
     C                     PARM           $MRK             Supplied by systm
     C                     PARM           $RMV   10        Messages to Remove
     C                     PARM           $APIER           API Err Data Str
     C*
     C* Initialize variables for QMHxxxPM API calls:
     C                     MOVEL'*'       $MSGQ     P      Call Message Queue
     C           'QUSERMSG'CAT  '*LIBL':2 $MSGF     P      Message File/Lib
     C                     MOVEL'*ALL'    $RMV             Remove all msgs
     C*
     C                     ENDSR                           END *INZSR
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*                    -----
     C           CLRSF     BEGSR
     C* Clear subfile:
     C                     MOVE *OFF      *IN70            SFLDSP
     C                     MOVE *ON       *IN71            SFLCLR
     C                     WRITESFLSEL20                   SFLCTL
     C                     MOVE *OFF      *IN71            SFLCLR
     C                     Z-ADD*ZERO     RRN     40
     C                     ENDSR                           CLRSF
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*                    -----
     C           BLDSF     BEGSR
     C* Build (Load) subfile:
     C* Priming read to see if there are any records to display:
     C           *LOVAL    SETLLNAMEFILE
     C                     READ NAMEFILE                 99
     C*
     C                     Z-ADD*ZERO     @SOPT            Initialize Option
     C*
     C           *IN99     DOWEQ*OFF                       DOW IN99 OFF
     C* Process record just read: move fields, increment RRN, write SFL rec.
     C*
     C                     ADD  1         RRN              Relative Record #
     C                     WRITESFLSEL10               99  Write Subfile Rec
     C*
     C                     READ NAMEFILE                 99
     C*
     C* If the 9999th record was written but there was more data in the
     C* file, notify user that the subfile is full and exit this loop:
     C           RRN       IFEQ 9999                       If RRN=9999
     C           *IN99     ANDEQ*OFF                       Unprocessed record
     C                     MOVE 'USR0021' $MSGID           Subfile full
     C                     EXSR SNDMSG                     Send message
     C                     MOVE *ON       *IN99            Exit loop
     C                     ENDIF                           End RRN=9999
     C*
     C                     ENDDO                           END DOW IN99 OFF
     C*
     C                     ENDSR                           BLDSF
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*                    -----
     C           DSPSF     BEGSR
     C* Display subfile if it has data, else show error message:
     C*
     C           RRN       IFGT *ZERO                      Data in SF?
     C           @ERROR    IFEQ *OFF                        If no errors
     C                     Z-ADD1         RRN                Show first record
     C                     ENDIF                            End @ERR=Off
     C                     MOVE *ON       *IN70             SFLDSP = On
     C                     ELSE                            Else
     C                     MOVE *OFF      *IN70             SFLDSP =Off
     C                     MOVE 'USR0006' $MSGID
     C                     EXSR SNDMSG                     Send message
     C                     ENDIF                           End RRN > 0
     C*
     C                     WRITEMSGCTL                     Msg Sfl Ctl rec
     C                     WRITESFLSEL30                   Valid Cmd Keys
     C                     EXFMTSFLSEL20                   SFLCTL Record
     C*
     C* Clear the Error Message Subfile:
     C                     MOVE *BLANKS   $MRK             MRK for screen
     C                     CALL 'QMHRMVPM'$RPLST           Remove Pgm Msg
     C*
     C                     ENDSR                           DSPSF
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*                    -----
     C           CMDKEY    BEGSR
     C* Process any Command Keys Pressed:
     C*
     C           *IN03     IFEQ *ON                        F3  = EXIT
     C           *IN12     OREQ *ON                        F12 = CANCEL
     C                     MOVE *ON       *INLR            EOJ
     C                     RETRN
     C                     ENDIF
     C*
     C           *IN05     IFEQ *ON                        F5  = REFRESH
     C                     ENDIF
     C*
     C                     ENDSR                           CMDKEY
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*                    -----
     C           PRCSF     BEGSR
     C*
     C                     MOVE *OFF      *IN81            Init
     C                     MOVE *OFF      *IN82            Init
     C                     MOVE *OFF      *IN91            Init
     C                     MOVE *OFF      *IN92            Init
     C*
     C* Initialize counter for number of subfile records selected:
     C                     Z-ADD*ZERO     #SEL    20       # of Selections
     C*
     C* Read changed records in subfile to check for selection(s):
     C                     READCSFLSEL10                 98Read Changed Recs
     C* Flag all changed records so they will be re-read next time:
     C                     MOVE *ON       *IN73            SFLNXTCHG
     C*
     C           *IN98     DOWEQ*OFF                       DoW IN98 = Off
     C*
     C* If user made selection, initialize output variable with selection:
     C                     SELEC
     C*                    -----
     C           @SOPT     WHEQ 0                          Usr blanked selec
     C*
     C           @SOPT     WHEQ 1                          1 = Select
     C                     ADD  1         #SEL             # of "1"s picked
     C           #SEL      IFGT 1                          IF #SEL > 1
     C                     MOVE *ON       *IN82            RI/PC for sfl rec
     C                     MOVE 'USR0004' $MSGID
     C                     EXSR SNDMSG                     Send message
     C           @ERROR    IFEQ *OFF                       First Error?
     C                     Z-ADDRRN       ERREC#           RRN of 1st Error
     C                     ENDIF                           End @ERROR = OFF
     C                     MOVE *ON       @ERROR           A record has errs
     C                     ELSE                            ELSE #SEL = 1
     C                     MOVELNAMEF     OUTDTA
     C                     ENDIF                           End #SEL > 1
     C*
     C                     OTHER                           ERROR
     C                     MOVE *ON       *IN81            RI/PC for sfl rec
     C                     MOVE 'USR0003' $MSGID
     C                     EXSR SNDMSG                     Send message
     C           @ERROR    IFEQ *OFF                       First Error?
     C                     Z-ADDRRN       ERREC#           RRN of 1st Error
     C                     ENDIF                           END @ERROR = OFF
     C                     MOVE *ON       @ERROR           A record has errs
     C                     ENDSL                           End SELECT
     C*                    -----
     C*
     C                     UPDATSFLSEL10                   Update SFL record
     C                     MOVE *OFF      *IN81            Field error indic
     C                     MOVE *OFF      *IN82            Field error indic
     C                     READCSFLSEL10                 98
     C                     ENDDO                           End DoW 98 = Off
     C*
     C                     ENDSR                           PRCSF
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           SNDMSG    BEGSR
     C* Send a program message using the QMHSNDPM API.
     C*
     C                     CALL 'QMHSNDPM'                 Send Program Msg
     C                     PARM           $MSGID  7        Message ID
     C                     PARM           $MSGF  20        Message File/Lib
     C                     PARM           $MDATA 80        Substitution data
     C                     PARM           $MDLEN           Length of $MDATA
     C                     PARM '*DIAG'   $MTYPE 10        Message Type
     C                     PARM '*'       $MSGQ  10        Call Message Queue
     C                     PARM 0         $MSTK            Call Stack Countr
     C                     PARM           $MRK    4        Msg Reference Key
     C                     PARM           $APIER           Error Data Struct
     C*
     C* If API failed, send Escape message and exit:
     C           $ERLEN    IFGT *ZERO
     C                     EXSR ESCMSG
     C                     ENDIF
     C*
     C                     ENDSR                           End SNDMSG
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           ESCMSG    BEGSR
     C* Send *ESCAPE message with cause of API error and exit.
     C*
     C                     MOVE *BLANKS   $MSGID
     C           'QCPFMSG' CAT  'QSYS':3  $MSGF     P      Message File/Lib
     C*
     C                     CALL 'QMHSNDPM'                 Send Program Msg
     C                     PARM           $ERMIC           Message ID
     C                     PARM           $MSGF            Message File/Lib
     C                     PARM           $ERTXT           Substitution data
     C                     PARM           $ERLEN           Length of $ERTXT
     C                     PARM '*ESCAPE' $MTYPE           Message Type
     C                     PARM '*'       $MSGQ            Call Message Queue
     C                     PARM 1         $MSTK            Call Stack Countr
     C                     PARM           $MRK             Msg Reference Key
     C                     PARM           $QMHER           Error Data Struct
     C*
     C                     MOVE *ON       *INLR
     C                     RETRN
     C*
     C                     ENDSR                           End ESCMSG
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
