      *%METADATA                                                       *
      * %TEXT Display Size of a Library                                *
      *%EMETADATA                                                      *
     H* SIZLIBR                       08FEB91                  
     H*
     H* Prints a list of objects in a library, with their types and
     H* sizes, as well as the total size, in order to estimate the
     H* media necessary for backing up.
     H*
     H* INPUT: Output of the DSPOBJD command (One file for library itself,
     H*        another for the contents.)
     H*
     H* OUTPUT: Report of objects & sizes.
     H*
     F*********************** File Specifications **************************
     FOBJDOUT1IF  F     452            DISK
     FOBJDOUT2IP  F     452            DISK
     FLIBSIZ  O   F      80     OF     PRINTER
     F*
     I*********************** Input Specifications *************************
     I* Library:
     IOBJDOUT1NS  01
     I                                       24  33 LNAME
     I                                       34  40 LTYPE
     I                                    P  53  580LSIZE
     I* Contents:
     IOBJDOUT2NS  02
     I                                       24  33 NAME
     I                                       34  40 TYPE
     I                                    P  53  580SIZE
     I* Local Data Area (*LDA) contains library name for 1P Header:
     I           UDS
     I                                        1  10 LIB
     C*********************** Calculations *********************************
     C* Read in the file containing size of library itself (once only):
     C           ONCE      DO   0         ONCE    10
     C                     READ OBJDOUT1                 98
     C  N98                ADD  SIZE      WTOTAL 130       TOTAL SIZE
     C                     END
     C*
     C* Accumulate total size of all objects in library:
     C   02                ADD  SIZE      WTOTAL           TOTAL SIZE     ,
     C*
     C* Determine quantity of various magnetic media needed to back up:
     CLR         WTOTAL    MULT .1        WOHEAD 120       ALLOW OVERHEAD
     CLR         WTOTAL    ADD  WOHEAD    WGTOT  130       GRAND TOTAL
     C*
     CLR         WGTOT     DIV  1200000   DKTS    71H      # 2D DISKETTES
     CLR         WGTOT     DIV  120000000 TCART   71H      # 1/4" CARTRIDG
     CLR         WGTOT     DIV  161000000 T6250   71H      # 6250BPI TAPES
     CLR         WGTOT     DIV  82000000  T3200   71H      # 3200BPI TAPES
     CLR         WGTOT     DIV  41000000  T1600   71H      # 1600BPI TAPES
     C*
     O*********************** Output Specifications ************************
     OLIBSIZ  H  2 3   1P
     O       OR        OF
     O                                    8 'SIZLIBR'
     O                                   29 'Members and size of'
     O                                   37 'Library'
     O                         LIB       48
     O                         UDATE Y   65
     O                                   75 'Page:'
     O                         PAGE  Z   80
     O        H  2     1P
     O       OR        OF
     O                                    4 'Name'
     O                                   15 'Type'
     O                                   46 'Size'
     O        D  1     01
     O                         LNAME     10
     O                         LTYPE     18
     O                         LSIZE K   47
     O        D  1     02
     O                         NAME      10
     O                         TYPE      18
     O                         SIZE  K   47
     O        T 21     LR
     O                                   46 '-------------'
     O        T  1     LR
     O                                   19 'Total Library Size:'
     O                         WTOTALK   47
     O        T  1     LR
     O                                   19 'Overhead Allowance:'
     O                         WOHEADK   47
     O        T  1     LR
     O                                   22 'Estimated Backup Size:'
     O                         WGTOT K   47
     O        T 21     LR
     O                                   19 'Number of Diskettes'
     O                         DKTS  K   47
     O        T  1     LR
     O                                   25 '1/4" Cartridges'
     O                         TCART K   47
     O        T  1     LR
     O                                   24 '6250 BPI Tapes'
     O                         T6250 K   47
     O        T  1     LR
     O                                   24 '3200 BPI Tapes'
     O                         T3200 K   47
     O        T  1     LR
     O                                   24 '1600 BPI Tapes'
     O                         T1600 K   47
     O        T 3      LR
     O                                   23 'Blank = Not Recommended'
     O                                   47 '(Less than 5% of media '
     O                                   56 'capacity)'
