      *%METADATA                                                       *
      * %TEXT Using QMHSNDPM API with no error handling                *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: SNDMSG2
     H*Purpose: Example of sending a program message using the QMHSNDPM API
     H* to a display file which receives it with a Message Subfile.
     H*   This program does NOT handle errors in the API call, it just
     H* abends. For example, if the *MSGF specified is not found,
     H* the SNDMSG program will end and display CPF2407 - Message File
     H* not found - on the bottom of the screen. This program will
     H* function check on the call, display a full-screen message and
     H* make the user look at the joblog or dump to find the CPF2407
     H* message.
     H*   Assuming that things will seldom go wrong with messages, this
     H* program shows a 'minimalist' approach to message handling.
     H*NOTE: Replacement text for numeric variables requires a different
     H*  definition of $MDAT and $MDLEN, specific to each error message.
     H*Input:
     H*Output:
     H*Called by: Command Line
     H*External Calls: QMHRMVPM - Remove Program Message
     H*                QMHSNDPM - Send Program Message
     H*Compilation Notes/Parameters: None
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * *
     F*
     FSFLMSG  CF  E                    WORKSTN
     F*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     I* Program Status Data Structure:
     I           SDS
     I                                     *PROGRAM PGM
     I                                     *PARMS   #PARMS
     I                                      244 253 WSID
     I                                      254 263 URID
     I*
     I* Binary fields used by Message Handler APIs:
     I            DS
     I I            80                    B   1   40$MDLEN
     I I            0                     B   5   80$MSTK
     I*
     I* API Error message structure:
     I$APIER      DS
     I I            0                     B   1   40$ERSIZ
     I* $ERSIZ = bytes provided for error data; controls error handling:
     I* 0 => API control; errors cause program to abend.
     I I            0                     B   5   80$ERLEN
     I                                        9  15 $ERMIC
     I                                       16  16 $ERRSV
     I*
     C* * * * * * * * * * *   Calculations   * * * * * * * * * * * * * * * **
     C*
     C*          ------    ---
     C           SCREEN    TAG
     C*          ------    ---
     C*
     C                     WRITEMSGCTL                     Msg Sfl Ctl rec
     C                     EXFMTDATAREC                    Display Format
     C*
     C* Check for Function Keys pressed:
     C           *IN03     IFEQ *ON                        F3 = Exit
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     ENDIF
     C*
     C* Clear the Error Message Subfile:
     C                     MOVE *BLANKS   $MRK             MRK for screen
     C                     CALL 'QMHRMVPM'$RPLST           Remove Pgm Msg
     C*
     C                     EXSR CHEK                       Check user entry
     C           *IN52     CABEQ*ON       SCREEN           Go back if error
     C*
     C                     MOVE *ON       *INLR
     C*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*
     C* * * * * * * * * * *   Subroutines  * * * * * * * * * * * * * * * * **
     C*           -----    -----
     C           *INZSR    BEGSR
     C* Initial Subroutine; executed automatically when program starts:
     C*
     C* Parm List for QMHRMVPM:
     C           $RPLST    PLIST
     C                     PARM           $MSGQ            Message Queue
     C                     PARM           $MSTK            Call Stack Countr
     C                     PARM           $MRK             Supplied by systm
     C* NOTE: Always blank out $MRK before calling QMHRMVPM.
     C                     PARM           $RMV   10        Messages to Remove
     C                     PARM           $APIER           API Err Data Str
     C*
     C* Initialize variables for QMHxxxPM API calls:
     C                     MOVEL'*'       $MSGQ     P      Call Message Queue
     C           'QUSERMSG'CAT  '*LIBL':2 $MSGF     P      Message File/Lib
     C                     MOVEL'*ALL'    $RMV             Remove all msgs
     C*
     C                     ENDSR                           End *INZSR
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ----      -----
     C           CHEK      BEGSR
     C* Validate user entries.
     C*
     C* Set Off all screen error indicators:
     C                     MOVE *OFF      *IN31            Error Indicator
     C                     MOVE *OFF      *IN32            Error Indicator
     C                     MOVE *OFF      *IN33            Error Indicator
     C                     MOVE *OFF      *IN52            Error Indicator
     C*
     C* Initialize variables for screen validation and message handling:
     C                     MOVE *BLANKS   $MRK             MRK for screen
     C*
     C* Validate fields on screen:
     C           FLD1      IFEQ *BLANK
     C           FLD1      OREQ 'ERR'
     C                     MOVE *ON       *IN31            Error Indicator
     C                     MOVE *ON       *IN52            Error Indicator
     C                     MOVE 'USR0032' $MSGID           Message ID
     C                     EXSR SNDMSG                     Send Program Msg
     C                     ENDIF
     C*
     C           FLD2      IFNE 'Y'
     C           FLD2      ANDNE'N'
     C                     MOVE *ON       *IN32            Error Indicator
     C                     MOVE *ON       *IN52            Error Indicator
     C                     MOVE FLD2      $MDATA           Replacement Data
     C                     MOVE 'USR0034' $MSGID           Message ID
     C                     EXSR SNDMSG                     Send Program Msg
     C                     ENDIF
     C*
     C           FLD3      IFLE 100
     C                     MOVE *ON       *IN33            Error Indicator
     C                     MOVE *ON       *IN52            Error Indicator
     C* Redefine parms for numeric replacement data:
     C                     Z-ADDFLD3      $MDATN  30
     C                     Z-ADD3         $MDLEN           Length of $MDATA
     C                     MOVE 'USR0005' $MSGID           Message ID
     C                     CALL 'QMHSNDPM'                 Send Program Msg
     C                     PARM           $MSGID           Message ID
     C                     PARM           $MSGF            Message File DS
     C                     PARM           $MDATN           Substitution data
     C                     PARM           $MDLEN           Length of $MDATA
     C                     PARM           $MTYPE           Message Type
     C                     PARM           $MSGQ            Call Message Queue
     C                     PARM           $MSTK            Call Stack Countr
     C                     PARM           $MRK             Supplied by systm
     C                     PARM           $APIER           Error Data Struct
     C                     ENDIF
     C*
     C                     ENDSR                           End CHEK
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           SNDMSG    BEGSR
     C* Send a program message using the QMHSNDPM API.
     C*
     C                     CALL 'QMHSNDPM'                 Send Program Msg
     C                     PARM           $MSGID  7        Message ID
     C                     PARM           $MSGF  20        Message File/Lib
     C                     PARM           $MDATA  1        Substitution data
     C* Note: $MDATA parm must be included in the call even if it
     C*       will not be used.
     C                     PARM 1         $MDLEN           Length of $MDATA
     C                     PARM '*DIAG'   $MTYPE 10        Message Type
     C                     PARM '*'       $MSGQ  10        Call Message Queue
     C                     PARM 0         $MSTK            Call Stack Countr
     C                     PARM           $MRK    4        Msg Reference Key
     C                     PARM           $APIER           Error Data Struct
     C*
     C                     ENDSR                           End SNDMSG
     C*                    -----
