      *%METADATA                                                       *
      * %TEXT Using QMHSNDPM API to send program messages              *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: SNDMSG
     H*Purpose: Example of sending a program message using the QMHSNDPM API
     H* to a display file which receives it with a Message Subfile.
     H*NOTE: Replacement text for numeric variables requires a different
     H*  definition of $MDAT and $MDLEN, specific to each error message.
     H*Called by: Command Line
     H*External Calls: QMHRMVPM - Remove Program Message
     H*                QMHSNDPM - Send Program Message
     H*Compilation Notes/Parameters: None
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * *
     F*
     FSFLMSG  CF  E                    WORKSTN
     F*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     I* Program Status Data Structure:
     I           SDS
     I                                     *PROGRAM PGM
     I                                     *PARMS   #PARMS
     I                                      244 253 WSID
     I                                      254 263 URID
     I*
     I* Binary fields used by Message Handler APIs:
     I            DS
     I I            80                    B   1   40$MDLEN
     I I            0                     B   5   80$MSTK
     I*
     I* API Error message structure:
     I$APIER      DS
     I I            80                    B   1   40$ERSIZ
     I* $ERSIZ = bytes provided for error data; controls error handling:
     I* 0 => API control; errors cause program to abend.
     I* 8 or more => this program will handle errors (like MONMSG).
     I I            0                     B   5   80$ERLEN
     I* $ERLEN = bytes of error data returned by the API.  If it is    :
     I* > 0, an error occurred.                                        :
     I                                        9  15 $ERMIC
     I* If $ERMIC is blank, the API completed successfully; if it fails
     I* the error message ID for the reason will be in $ERMIC.
     I                                       16  16 $ERRSV
     I* Bytes 17 through $ERSIZ contain the replacement text for $ERMIC.
     I                                       17  96 $ERTXT
     I*
     I* Error message structure for handling errors calling the API:
     I$QMHER      DS
     I I            16                    B   1   40$MHSIZ
     I I            0                     B   5   80$MHLEN
     I                                        9  15 $MHMIC
     I                                       16  16 $MHRSV
     I*
     C* * * * * * * * * * *   Calculations   * * * * * * * * * * * * * * * **
     C*
     C*          ------    ---
     C           SCREEN    TAG
     C*          ------    ---
     C*
     C                     WRITEMSGCTL                     Msg Sfl Ctl rec
     C                     EXFMTDATAREC                    Display Format
     C*
     C* Check for Function Keys pressed:
     C           *IN03     IFEQ *ON                        F3 = Exit
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     ENDIF
     C*
     C* Clear the Error Message Subfile:
     C                     MOVE *BLANKS   $MRK             MRK for screen
     C                     CALL 'QMHRMVPM'$RPLST           Remove Pgm Msg
     C*
     C                     EXSR CHEK                       Check user entry
     C           *IN52     CABEQ*ON       SCREEN           Go back if error
     C*
     C                     MOVE *ON       *INLR
     C*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*
     C* * * * * * * * * * *   Subroutines  * * * * * * * * * * * * * * * * **
     C*           -----    -----
     C           *INZSR    BEGSR
     C* Initial Subroutine; executed automatically when program starts:
     C*
     C* Parm List for QMHRMVPM:
     C           $RPLST    PLIST
     C                     PARM           $MSGQ            Message Queue
     C                     PARM           $MSTK            Call Stack Countr
     C                     PARM           $MRK             Supplied by systm
     C* NOTE: Always blank out $MRK before calling QMHRMVPM.
     C                     PARM           $RMV   10        Messages to Remove
     C                     PARM           $APIER           API Err Data Str
     C*
     C* Initialize variables for QMHxxxPM API calls:
     C                     MOVEL'*'       $MSGQ     P      Call Message Queue
     C           'QUSERMSG'CAT  '*LIBL':2 $MSGF     P      Message File/Lib
     C                     MOVEL'*ALL'    $RMV             Remove all msgs
     C*
     C                     ENDSR                           End *INZSR
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ----      -----
     C           CHEK      BEGSR
     C* Validate user entries.
     C*
     C* Set Off all screen error indicators:
     C                     MOVE *OFF      *IN31            Error Indicator
     C                     MOVE *OFF      *IN32            Error Indicator
     C                     MOVE *OFF      *IN33            Error Indicator
     C                     MOVE *OFF      *IN52            Error Indicator
     C*
     C* Initialize variables for screen validation and message handling:
     C                     MOVE *BLANKS   $MRK             MRK for screen
     C*
     C* Validate fields on screen:
     C           FLD1      IFEQ *BLANK
     C           FLD1      OREQ 'ERR'
     C                     MOVE *ON       *IN31            Error Indicator
     C                     MOVE *ON       *IN52            Error Indicator
     C                     MOVE 'USR0032' $MSGID           Message ID
     C                     EXSR SNDMSG                     Send Program Msg
     C                     ENDIF
     C*
     C           FLD2      IFNE 'Y'
     C           FLD2      ANDNE'N'
     C                     MOVE *ON       *IN32            Error Indicator
     C                     MOVE *ON       *IN52            Error Indicator
     C                     MOVELFLD2      $MDATA    P      Replacement Data
     C                     MOVE 'USR0034' $MSGID           Message ID
     C                     EXSR SNDMSG                     Send Program Msg
     C                     ENDIF
     C*
     C           FLD3      IFLE 100
     C                     MOVE *ON       *IN33            Error Indicator
     C                     MOVE *ON       *IN52            Error Indicator
     C* Redefine parms for numeric replacement data:
     C                     Z-ADDFLD3      $MDATN  30
     C                     Z-ADD3         $MDLEN           Length of $MDATA
     C                     MOVE 'USR0005' $MSGID           Message ID
     C                     CALL 'QMHSNDPM'                 Send Program Msg
     C                     PARM           $MSGID           Message ID
     C                     PARM           $MSGF            Message File DS
     C                     PARM           $MDATN           Substitution data
     C                     PARM           $MDLEN           Length of $MDATA
     C                     PARM           $MTYPE           Message Type
     C                     PARM           $MSGQ            Call Message Queue
     C                     PARM           $MSTK            Call Stack Countr
     C                     PARM           $MRK             Supplied by systm
     C                     PARM           $APIER           Error Data Struct
     C                     ENDIF
     C*
     C                     ENDSR                           End CHEK
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           SNDMSG    BEGSR
     C* Send a program message using the QMHSNDPM API.
     C*
     C                     CALL 'QMHSNDPM'                 Send Program Msg
     C                     PARM           $MSGID  7        Message ID
     C                     PARM           $MSGF  20        Message File/Lib
     C                     PARM           $MDATA 80        Substitution data
     C                     PARM 80        $MDLEN           Length of $MDATA
     C                     PARM '*DIAG'   $MTYPE 10        Message Type
     C                     PARM '*'       $MSGQ  10        Call Message Queue
     C                     PARM 0         $MSTK            Call Stack Countr
     C                     PARM           $MRK    4        Msg Reference Key
     C                     PARM           $APIER           Error Data Struct
     C*
     C* If API failed, send Escape message and exit:
     C           $ERLEN    IFGT *ZERO
     C                     EXSR ESCMSG
     C                     ENDIF
     C*
     C                     ENDSR                           End SNDMSG
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           ESCMSG    BEGSR
     C* Send *ESCAPE message with cause of API error and exit.
     C*
     C                     MOVE *BLANKS   $MSGID
     C           'QCPFMSG' CAT  'QSYS':3  $MSGF     P      Message File/Lib
     C*
     C                     CALL 'QMHSNDPM'                 Send Program Msg
     C                     PARM           $ERMIC           Message ID
     C                     PARM           $MSGF            Message File/Lib
     C                     PARM           $ERTXT           Substitution data
     C                     PARM           $ERLEN           Length of $ERTXT
     C                     PARM '*ESCAPE' $MTYPE           Message Type
     C                     PARM '*'       $MSGQ            Call Message Queue
     C                     PARM 1         $MSTK            Call Stack Countr
     C                     PARM           $MRK             Msg Reference Key
     C                     PARM           $QMHER           Error Data Struct
     C*
     C                     MOVE *ON       *INLR
     C                     RETRN
     C*
     C                     ENDSR                           End ESCMSG
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
