      *%METADATA                                                       *
      * %TEXT Skeleton File Maintenance Program w/ERRMSGID             *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: U9XXM1
     H*Purpose: Skeleton File Maintenance Program W/ERRMSGID
     H*Drawbacks: Need a dummy field for general messages.
     H* - Can't position cursor on field prompted from with CSRLOC
     H*
     H* To Use:
     H* 1. Scan/Replace 'U9XXM' with 1st 5 characters of screen name
     H* 2. Replace 'U9XXFIL' with the name of the master file
     H* 3. Replace 'U9XXREC' with the master file record format name
     H* 4. Replace 'XXKLST' with the name of the master file key or KLIST
     H* 5. Update the *INZSR
     H* 6. Update the FLDPMT subroutine
     H* 7. Change the CHKKEY subroutine to validate key fields
     H* 8. Change the CKSC20 subroutine to validate the fields in the file
     H*
     H*Called By: Menu option or command line
     H*Compilation Notes/Parameters: None
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H* Indicator Usage Summary:
     H* --------- ----- -------
     H* 16 Protect fields on Inquiry
     H* 21 Invalid Customer Number (USR0600)
     H* 22 Invalid Crop (USR0500)
     H* 24 Description field cannot be blank (USR6011)
     H* 26 Invalid Location (USR0520)
     H* 27 Invalid Date (USR0530)
     H* 28 Invalid Amount (USR6011)
     H* 31 Cursor not in valid field for F4=Prompt (USR1415)
     H* 32 Roll to the Beginning of File reached (USR1122)
     H* 33 Roll to the End of File reached (USR1123)
     H* 35 Add: key already exists (USR0020)
     H* 36 Can't roll in Add mode (USR0090)
     H* 37 Chg/Inq/Del: key not found in master file (USR0030)
     H* 52 Set on if any other error on screen 010 or 020
     H* 53 Enable CSRLOC - Cursor Locate - keyword on screen 20 DDS
     H* 66 NRF on chain
     H* 91 Invalid Function Code (USR0007)
     H*
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * *
     FU9XXM1SCCF  E                    WORKSTN      KINFDS DATA
     FU9XXFIL UF  E           K        DISK                      A
     F*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     IDATA        DS
     I                                     *STATUS  STATUS
     I                                      369 369 KEY
     I*
     I* Program Status Data Structure:
     I           SDS
     I                                     *PROGRAM PGM
     I                                     *PARMS   #PARMS
     I                                      244 253 WSID
     I                                      254 263 URID
     I*
     I* Date in packed format for call to validation program UPDTV2CL:
     I            DS
     I                                    P   1   40DATE6P
     I*
     I* Parms for calling UPDTV0 to verify delete:
     IUPDLDS    E DSUPDLDS
     I*
     I* Parms to get company name and prompt/validate locations:
     IU5C5DS    E DSU5C5DS
     I*
     I* Parms to prompt/validate Customer Number:
     IU4CSDS    E DSU4CSDS
     I*
     I* Parms to prompt/validate Crop Code:
     IU5CRDS    E DSU5CRDS
     I*
     I* 2 DS used by Date Conversion Subroutines CVT628 and CVT826:
     I            DS
     I                                        1   80DATE8
     I                                        1   20C8
     I                                        3   40Y8
     I                                        5   80MD8
     I                                        5   60M8
     I                                        7   80D8
     I*
     I            DS
     I                                        1   60DATE6
     I                                        1   40MD6
     I                                        1   20M6
     I                                        3   40D6
     I                                        5   60Y6
     I*
     I* Function Key Definitions:
     I/COPY UPKEYC0
     I*
     I/COPY UPCRC0
     I*
     C* * * * * * * * * * *   Calculations   * * * * * * * * * * * * * * * **
     C*
     C                     MOVE *ON       *IN91            1st time cursor
     C*
     C*          -----     ---
     C           SCR10     TAG
     C*          -----     ---
     C*
     C                     EXFMTU9XXM110                   Key fields screen
     C*
     C* Check for Function Keys pressed:
     C           KEY       IFEQ EXIT                       F3 = Exit
     C                     MOVE *ON       *INLR
     C                     RETRN
     C                     ENDIF
     C*
     C           KEY       IFEQ PROMPT                     F4 = Prompt
     C                     EXSR FLDPMT                      Field Prompts
     C                     GOTO SCR10
     C                     ENDIF
     C*
     C           KEY       IFEQ ROLLUP                     Page/Roll Keys
     C           KEY       OREQ ROLLDN
     C           @SFUNC    IFEQ *BLANK
     C           @SFUNC    OREQ 'A'
     C                     MOVE 'I'       @SFUNC
     C                     ENDIF
     C                     EXSR ROLLNG                     Process roll key
     C           *IN32     CABEQ*ON       SCR10
     C           *IN33     CABEQ*ON       SCR10
     C                     ENDIF
     C*
     C                     MOVE *OFF      *IN91
     C*
     C* Process function codes:
     C           @SFUNC    CASEQ'A'       ADDREC
     C           @SFUNC    CASEQ'C'       CHGREC
     C           @SFUNC    CASEQ'I'       INQDEL
     C           @SFUNC    CASEQ'D'       INQDEL
     C                     CAS            ERACID
     C                     END
     C*
     C                     MOVE *OFF      *IN16            Unprotect Fields
     C*
     C                     GOTO SCR10
     C*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*
     C* * * * * * * * * * *   Subroutines  * * * * * * * * * * * * * * * * **
     C*
     C*           -----    -----
     C           *INZSR    BEGSR
     C*
     C* Key List for U9XXFIL:
     C           XXKLST    KLIST
     C                     KFLD           XXCNO
     C                     KFLD           XXCROP
     C*
     C* Parms for Crop Code:
     C           CRPLST    PLIST
     C                     PARM           U5CRDS
     C                     MOVE PGM       XRPGM            Calling program
     C*
     C* Parms for Customer Number:
     C           CSPLST    PLIST
     C                     PARM           U4CSDS
     C                     MOVE PGM       XCPGM            Calling program
     C*
     C* Parms for verifying delete:
     C           DLPLST    PLIST
     C                     PARM           UPDLDS
     C                     MOVE PGM       XLPGM            Calling program
     C*
     C* Parms to get company name:
     C           C5PLST    PLIST
     C                     PARM           U5C5DS
     C                     MOVE PGM       X5PGM            Calling program
     C*
     C* Get company name for location 001:
     C                     Z-ADD001       X5LOC            Location
     C                     MOVE *BLANKS   X5LVAL
     C                     CALL 'U5C5V0'  C5PLST
     C                     MOVELX5LNAM    @SCNAM           Company name
     C*
     C                     ENDSR                           End *INZSR
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           ADDREC    BEGSR
     C*
     C* 1. Make sure a record with this key does not already exist:
     C                     MOVE *OFF      *IN52            Error Indicator
     C           XXKLST    CHAINU9XXFIL              66    NRF
     C           *IN66     IFEQ *OFF                       key already used
     C                     MOVE *ON       *IN35            errmsg USR0020
     C                     MOVE *ON       *IN52            Error Indicator
     C                     GOTO EADD                       Back to Screen 10
     C                     ENDIF
     C*
     C* 2. Validate key fields and get descriptions. Exit if error found.
     C                     EXSR CHKKEY                     Check Key Fields
     C           *IN52     CABEQ*ON       EADD             Back to Screen 10
     C*
     C* 3. Clear input fields and set any default values:
     C                     MOVE *BLANKS   XXDESC
     C                     Z-ADD*ZERO     XXLOC
     C                     MOVE *BLANKS   @SLNAM
     C                     Z-ADDUDATE     @SDATE
     C                     Z-ADD*ZERO     XXAMT
     C*
     C* 4. Display detail screen and get input:
     C*          ------    ---
     C           SCR20A    TAG
     C*          ------    ---
     C                     EXFMTU9XXM120                   Write/Read Screen
     C*
     C* 5. Check for any Function keys or roll keys:
     C           KEY       CABEQCANCEL    EADD             F12 = Cancel
     C*
     C           KEY       IFEQ PROMPT                     F4 = Prompt
     C                     EXSR FLDPMT                      Field prompts
     C                     GOTO SCR20A                      Redisplay
     C                     ENDIF                           End key = F4
     C*
     C           KEY       IFEQ ROLLUP
     C           KEY       OREQ ROLLDN
     C*                    Can't roll in Add mode. . .
     C                     MOVE *ON       *IN36            ERRMSGID
     C                     GOTO SCR20A                     Redisplay
     C                     ENDIF
     C*
     C* 6. Validate user input. If errors, re-display screen with message:
     C                     MOVE *OFF      *IN52            Error Indicator
     C                     EXSR CKSC20                     Chk Scrn20 fields
     C           *IN52     CABEQ*ON       SCR20A           Field(s) in error
     C*
     C* 7. No errors; write output record.
     C                     WRITEU9XXREC                    Add the record
     C*
     C           EADD      ENDSR                           End ADDREC
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           CHGREC    BEGSR
     C*
     C* 1. Make sure a record with this key exists:
     C                     MOVE *OFF      *IN52            Error Indicator
     C           XXKLST    CHAINU9XXFIL              66    NRF
     C           *IN66     IFEQ *ON                        Can't find key
     C                     MOVE *ON       *IN37            errmsg USR0030
     C                     MOVE *ON       *IN52            Error Indicator
     C                     ENDIF
     C*
     C* 2. Validate key fields and get descriptions. Exit if error found.
     C                     EXSR CHKKEY                     Check Key Fields
     C           *IN52     CABEQ*ON       ECHG             Back to screen 10
     C*
     C* 3. Convert any fields from file format to display format:
     C                     EXSR CVTFLD                     Convert Fields
     C*
     C* 4. Get descriptions of data fields:
     C                     EXSR CKSC20                     Chk Scrn20 fields
     C*
     C* 5. Display detail screen and get input:
     C*          ------    ---
     C           SCR20C    TAG
     C*          ------    ---
     C                     EXFMTU9XXM120                   Write/Read Screen
     C*
     C* 6. Check for any Function keys or roll keys:
     C           KEY       IFEQ CANCEL                     IF KEY = F12
     C                     UNLCKU9XXFIL                    Release record
     C                     GOTO ECHG                       Back to screen 10
     C                     ENDIF                           END KEY = F12
     C*
     C           KEY       IFEQ PROMPT                     F4 = Prompt
     C                     EXSR FLDPMT                     Field prompts
     C                     GOTO SCR20C                     Redisplay screen
     C                     ENDIF
     C*
     C           KEY       IFEQ ROLLUP
     C           KEY       OREQ ROLLDN
     C*                    Validate/update record on screen before rolling:
     C                     EXSR CKSC20                     Chk Scrn20 fields
     C           *IN52     CABEQ*ON       SCR20C           Error - redisplay
     C                     UPDATU9XXREC                    OK-update record
     C           XXKLST    CHAINU9XXFIL              66    Reposition file
     C*                    Get next record and display it:
     C                     EXSR ROLLNG                     Process roll key
     C                     EXSR CHKKEY                     Get key descript.
     C                     EXSR CVTFLD                     Convert fields
     C                     EXSR CKSC20                     Get SC20 descript
     C                     GOTO SCR20C                     Show new record
     C                     ENDIF                           IF KEY = ROLL
     C*
     C* 6. Validate user input. If errors, re-display screen with message:
     C                     MOVE *OFF      *IN52            Error Indicator
     C                     EXSR CKSC20                     Validate Fields
     C           *IN52     CABEQ*ON       SCR20C           Field(s) in error
     C*
     C* 7. No errors; update the record:
     C                     UPDATU9XXREC
     C*
     C           ECHG      ENDSR                           End CHGREC
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           INQDEL    BEGSR
     C*
     C* 1. Make sure a record with this key exists:
     C                     MOVE *OFF      *IN52            Error Indicator
     C           XXKLST    CHAINU9XXFIL              66    NRF
     C           *IN66     IFEQ *ON
     C                     MOVE *ON       *IN37            Errmsg USR0030
     C                     MOVE *ON       *IN52            Error Indicator
TEST C*                    GOTO EDEL                       Back to Screen 10
     C                     ENDIF
     C*
     C* 2. Validate key fields and get descriptions. Exit if error found.
     C                     EXSR CHKKEY                     Check Key Fields
     C           *IN52     CABEQ*ON       EDEL             Error found
     C*
     C* 3. Convert any fields from file format to display format:
     C                     EXSR CVTFLD                     Convert Fields
     C*
     C* 4. Get descriptions of data fields:
     C                     EXSR CKSC20                     Chk Scrn20 fields
     C*
     C* 5. Display detail screen:
     C*          ------    ---
     C           SCR20D    TAG                             Show detail scrn
     C*          ------    ---
     C*
     C           @SFUNC    IFEQ 'I'                        IF @SFUNC = I
     C                     MOVE *ON       *IN16            Protect fields
     C                     UNLCKU9XXFIL                    Release record
     C                     EXFMTU9XXM120                   Write/Read Screen
     C*
     C* 6. Check for any Function keys or roll keys:
     C           KEY       CABEQCANCEL    EDEL             F12 = Cancel
     C*
     C           KEY       IFEQ ROLLUP                     IF KEY = ROLL
     C           KEY       OREQ ROLLDN
     C                     EXSR ROLLNG                     Process roll key
     C                     EXSR CHKKEY                     KEY FLD DESCRIPT.
     C                     EXSR CVTFLD                     CONVERT DATES
     C                     EXSR CKSC20                     DTA FLD DESCRIPT.
     C                     GOTO SCR20D
     C                     ENDIF                           END KEY = ROLL
     C*
     C                     ELSE                            ELSE @SFUNC = D
     C*
     C                     WRITEU9XXM120                   Show record
     C                     MOVE *BLANKS   XLRVAL           User response
     C                     CALL 'UPDLV0'  DLPLST           Verify delete
     C*
     C           XLRVAL    IFEQ 'CANC'                     IF XLRVAL = CANC
     C                     UNLCKU9XXFIL                    Release record
     C                     GOTO EDEL                       Back to screen 10
     C                     ELSE                            ELSE XLRVAL<>CANC
     C                     DELETU9XXREC                    Delete record
     C                     GOTO EDEL
     C                     ENDIF                           END XLRVAL = CANC
     C*
     C                     ENDIF                           END @SFUNC = I
     C*
     C           EDEL      ENDSR                           End INQDEL
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           ROLLNG    BEGSR
     C* Process Page Up/Down (Roll) keys
     C*
     C                     MOVE *OFF      *IN32             EOF
     C                     MOVE *OFF      *IN33             TOF
     C*
     C           KEY       IFEQ ROLLUP                     PgDn/Roll Up
     C                     READ U9XXFIL                  32EOF
     C           *IN32     IFEQ *ON
     C           XXKLST    SETLLU9XXFIL
     C                     READ U9XXFIL                  66Re-read prev. Record
     C                     ENDIF
     C*
     C                     ELSE                            PgUp/Roll Down
     C*
     C                     READPU9XXFIL                  33TOF
     C           *IN33     IFEQ *ON
     C           XXKLST    SETLLU9XXFIL
     C                     READ U9XXFIL                  66Re-read prev. Record
     C                     ENDIF
     C*
     C                     ENDIF                           END KEY = ROLLUP
     C*
     C                     ENDSR                           End ROLLNG
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           CKSC20    BEGSR
     C* Validate fields entered on Screen 20 and get descriptions.
     C*
     C* DESCRIPTION:
     C           XXDESC    IFEQ *BLANK
     C                     MOVE *ON       *IN24
     C                     MOVE *ON       *IN52
     C                     ENDIF
     C*
     C* LOCATION CODE:
     C                     Z-ADDXXLOC     X5LOC
     C                     MOVE *BLANKS   X5LVAL
     C                     CALL 'U5C5V0'  C5PLST
     C           X5LVAL    IFEQ 'BAD'
     C                     MOVE *ON       *IN26
     C                     MOVE *ON       *IN52             Error Indicator
     C                     ENDIF
     C                     MOVELX5LNAM    @SLNAM           Company name
     C*
     C* DATE:
     C                     Z-ADD@SDATE    DATE6P           Screen to packed  */
     C                     MOVE *BLANK    RVAL
     C                     CALL 'UPDTV2CL'                 Validate/convert  */
     C                     PARM           DATE6P           Date from screen  */
     C                     PARM           RVAL    8        Return Value      */
     C           RVAL      IFEQ 'BAD     '                 IF RVAL = BAD     */
     C                     MOVE *ON       *IN27             ERRMSGID USR0520 */
     C                     MOVE *ON       *IN52             ERROR INDICATOR  */
     C                     ELSE                            ELSE RVAL = DATE  */
     C                     MOVE RVAL      XXDATE            8-byte Date      */
     C                     ENDIF                           END RVAL = BAD    */
     C*                                                                      */
     C* AMOUNT:
     C*
     C           XXAMT     IFEQ *ZEROS
     C                     SETON                     2852
     C                     END
     C*
     C                     ENDSR                           End CKSC20
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           CHKKEY    BEGSR
     C* Check the individual parts of a compound key for validity and get
     C*  field descriptions.
     C*
     C* Customer:
     C                     Z-ADDXXCNO     XCCNO
     C                     MOVE *BLANKS   XCLVAL
     C                     CALL 'U4CSV0'  CSPLST
     C           XCLVAL    IFEQ 'GOOD'                     IF XCLVAL = GOOD
     C                     MOVELXCNAME    @SCNM             Description
     C                     ELSE                            ELSE XCLVAL<>GOOD
     C                     MOVE *ON       *IN21             Error message
     C                     MOVE *ON       *IN52             Error Indicator
     C                     MOVE *BLANKS   @SCNM             Description
     C                     ENDIF                           END XCLVAL = GOOD
     C*
     C* Crop:
     C                     MOVE XXCROP    XRCROP
     C                     MOVE *BLANKS   XRLVAL
     C                     CALL 'U5CRV0'  CRPLST
     C           XRLVAL    IFEQ 'GOOD'                     IF XCLVAL = GOOD
     C           XRLCDE    IFNE *BLANK                     IF XRLCDE <> ' '
     C                     MOVELXRLCDE    @SCRDE    P      Long Description
     C                     ELSE                            ELSE XRLCDE = ' '
     C                     MOVELXRCRDE    @SCRDE    P      Short Description
     C                     ENDIF                           END XRLCDE <> ' '
     C                     ELSE                            ELSE XRLVAL<>GOOD
     C                     MOVE *BLANKS   @SCRDE
     C                     MOVE *ON       *IN22             Error message
     C                     MOVE *ON       *IN52             Error Indicator
     C                     ENDIF                           END XCLVAL = GOOD
     C*
     C                     ENDSR                           End CHKKEY
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           ERACID    BEGSR
     C*
     C                     MOVE *ON       *IN91            Position cursor
     C*
     C                     ENDSR                           End ERACID
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           FLDPMT    BEGSR
     C* If F4 was pressed in a field, prompt for values or send errmsg.
     C*
     C                     MOVE 'NO '     VLDPMT  3
     C*
     C* Prompt for Customer Number:
     C           CURFLD    IFEQ 'XXCNO'
     C                     MOVE 'YES'     VLDPMT
     C                     MOVE *BLANKS   XCLVAL
     C                     CALL 'U4CSI0'  CSPLST
     C           XCLVAL    IFEQ 'GOOD'
     C                     MOVE XCCNO     XXCNO
     C                     MOVE XCNAME    @SCNM            Customer Name
     C                     ENDIF
     C                     GOTO ENDPMT
     C                     ENDIF
     C*
     C* Prompt for Crop:
     C           CURFLD    IFEQ 'XXCROP'                   IF CURFLD=DECROP
     C                     MOVE 'YES'     VLDPMT
     C                     MOVE *BLANKS   XRLVAL
     C                     CALL 'U5CRI0'  CRPLST
     C           XRLVAL    IFEQ 'GOOD'                     IF XRLVAL = GOOD
     C                     MOVE XRCROP    XXCROP
     C           XRLCDE    IFNE *BLANK                     IF XRLCDE <> ' '
     C                     MOVELXRLCDE    @SCRDE    P      Long Description
     C                     ELSE                            ELSE XRLCDE = ' '
     C                     MOVELXRCRDE    @SCRDE    P      Short Description
     C                     ENDIF                           END XRLCDE <> ' '
     C                     ELSE                            ELSE XRLVAL<>GOOD
     C                     MOVE *BLANKS   @SCRDE
     C                     ENDIF                           END XRLVAL = GOOD
     C                     GOTO ENDPMT
     C                     ENDIF                           END CURFLD=DECROP
     C*
     C* Prompt for Location:
     C           CURFLD    IFEQ 'XXLOC'
     C                     MOVE 'YES'     VLDPMT
     C                     MOVE *BLANKS   X5LVAL
     C                     CALL 'U5C5I0'  C5PLST
     C           X5LVAL    IFEQ 'GOOD'
     C                     MOVE X5LOC     XXLOC
     C                     MOVELX5LNAM    @SLNAM    P      Description
     C                     ENDIF
     C                     GOTO ENDPMT
     C                     ENDIF
     C*
     C           ENDPMT    TAG
     C*
     C           VLDPMT    IFEQ 'NO '
     C                     MOVE *ON       *IN31            ERRMSG USR1415
     C                     ENDIF
     C*
     C                     ENDSR                           End FLDPMT
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           CVTFLD    BEGSR
     C* Convert fields from the format in the file to a value for the screen
     C*
     C                     Z-ADDXXDATE    DATE8
     C                     EXSR CVT826
     C                     Z-ADDDATE6     @SDATE
     C*
     C                     ENDSR                           End CVTFLD
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*          ------    -----
     C           CVT826    BEGSR
     C* Convert 8-digit CCYYMMDD dates to 6-digit MMDDYY format:
     C                     Z-ADDMD8       MD6
     C                     Z-ADDY8        Y6
     C                     ENDSR                           End CVT826
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
