      *%METADATA                                                       *
      * %TEXT File maintenance program                                 *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: UIM3
     H*Title: UIM 'Work With' File Maintenance Program
     H*Function: Maintains a file from a UIM "Work With" panel
     H*Notes: UIM application must be opened with Interface level 1
     H*Input Parameters: UIM Action List parms for Interface level 1
     H*  EPCTYP - Type of call
     H*  HANDLE - Application Handle supplied by UIM
     H*  EPPNLN - Panel Name
     H*  EPLIST - List Name
     H*  EPLEH  - List entry handle
     H*  EPOPT# - Option number
     H*  EPQUAL - Function qualifier
     H*Input:
     H*Output:
     H*Called by: UIM4
     H*External Calls: QUIGETLE Get List Entry
     H*                QUIUPDLE Update List Entry
     H*                QUIRMVLE Remove List Entry
     H*                QMHSNDPM Send program message
     H*Compilation Notes/Parameters: None
     H*
     H* Indicator Usage Summary:
     H* --------- ----- -------
     H* 30 Protect I/O Fields on Display (For Display or Delete).
     H* 31 Error: Zone = blank.
     H* 32 Delete screen; shows "F23=Delete".
     H* 33 Cannot copy; record already exists with these keys.
     H* 79 Error found on one or more user input fields.
     H* 90 NRF on chains
     F*****************************************************************
     FUIM5    CF  E                    WORKSTN
     F                                              KINFDS WRKSTN
     FOAS310P UF  E           K        DISK                      A
     I************* FUNCTION KEY CONSTANTS ****************************
     I              X'31'                 C         F01                   F1
     I              X'32'                 C         F02                   F2
     I              X'33'                 C         F03                   F3
     I              X'34'                 C         F04                   F4
     I              X'35'                 C         F05                   F5
     I              X'36'                 C         F06                   F6
     I              X'37'                 C         F07                   F7
     I              X'38'                 C         F08                   F8
     I              X'39'                 C         F09                   F9
     I              X'3A'                 C         F10                   F10
     I              X'3B'                 C         F11                   F11
     I              X'3C'                 C         F12                   F12
     I              X'B1'                 C         F13                   F13
     I              X'B2'                 C         F14                   F14
     I              X'B3'                 C         F15                   F15
     I              X'B4'                 C         F16                   F16
     I              X'B5'                 C         F17                   F17
     I              X'B6'                 C         F18                   F18
     I              X'B7'                 C         F19                   F19
     I              X'B8'                 C         F20                   F20
     I              X'B9'                 C         F21                   F21
     I              X'BA'                 C         F22                   F22
     I              X'BB'                 C         F23                   F23
     I              X'BC'                 C         F24                   F24
     I              X'BD'                 C         FCLEAR                CLEAR
     I              X'F1'                 C         FENTER                ENTER
     I              X'F3'                 C         FHELP                 HELP
     I              X'F4'                 C         FROLLD                ROL DN
     I              X'F5'                 C         FROLLU                ROL UP
     I              X'F6'                 C         FPRINT                PRINT
     I              X'F8'                 C         FRCDBK                RCBKSP
     I*                                             (RECORD BACKSPACE)
     I              X'3F'                 C         FAUTEN                AUTOEN
     I*                                             (AUTO ENTER - FOR
     I*                                              SELECTOR LIGHT PEN)
     I*
     IWRKSTN      DS
     I                                      369 369 CFKEY
     I*
     I           SDS
     I                                        1  10 PGM
     I                                      254 263 USERID
     I*
     I* Literal Constants: (Specify program names, panel names, etc. here)
     I              'QCPFMSG   QSYS      'C         QCPFMS
     I              'QUSERMSG  *LIBL     'C         USRMSG
     I*
     I* Error Data Structures:
     IAPIERR      DS
     I I            256                   B   1   40ERRSIZ
     I I            0                     B   5   80ERRLEN
     I                                        9  15 ERRMSG
     I                                       16  16 ERRNBM
     I                                       17 272 ERRDTA
     I*
     IQMHERR      DS
     I I            16                    B   1   40ER2SIZ
     I I            0                     B   5   80ER2LEN
     I                                        9  15 ER2MIC
     I                                       16  16 ER2NBM
     I*
     ISELCRI      DS
     I                                        1  10 SELOPR
     I                                       11  20 SELVAR
     I*
     I* Binary Variables used in APIs: (aka BIN(31) & BIN(4))
     I            DS
     I I            0                     B   1   40OPTION
     I I            0                     B   5   80GLELEN
     I I            256                   B   9  120QMHLEN
     I I            1                     B  13  160QMHSTK
     I                                    B  17  200UPDLEN
     I I            1                     B  21  240MSGSTK
     I I            1                     B  25  280MSGLEN
     I                                    B  29  320PUTLEN
     I                                    B  33  360LSTLEN
     I*
     I* CHANGEME! Data Fields to Appear on the List Panel:
     I* Program Variable Buffer LIST (VARRCD = DSPDTL1 in UIM):
     ILIST        DS
     I                                        1   5 ZZCARR
     I                                        6  10 ZZORIG
     I                                       11  13 ZZZIPP
     I                                       14  15 ZZZONE
     I*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C* Get the List Entry to maintain based on the entry parameters:
     C                     MOVELLIST      GLEBUF 15        List Buffer
     C                     Z-ADD15        GLELEN           Length of GLEBUF
     C                     MOVEL'DSPDTL1' GLEREC    P      List Record Name
     C                     MOVELEPLIST    GLELST    P      List Name
     C                     MOVE 'HNDL'    GLEPOS           Position by LEH
     C                     MOVE *BLANKS   GLESEL           Select Criteria
     C                     MOVE EPLEH     GLEHDL           List Entry Handle
     C                     EXSR GETLE                      Get Flds frm List
     C                     MOVE GLEBUF    LIST
     C*
     C* Don't allow blank keys:
     C           ZZCARR    IFEQ *BLANK
     C           ZZORIG    OREQ *BLANK
     C           ZZZIPP    OREQ *BLANK
     C* ENDCHG!
     C*
     C                     MOVE 'USR0032' MSGID            NO BLANK KEYS
     C                     EXSR SNDMSG                     Send Message
     C                     GOTO EOJ                        Return to UIM pnl
     C                     ENDIF                           If any key=blank
     C*
     C           *IN79     DOUEQ*OFF                       No Input Errors
     C           CFKEY     OREQ F03                         or Exit (F3)
     C           CFKEY     OREQ F12                         or Cancel (F12)
     C*
     C                     SELEC
     C           OPTION    WHEQ 1                          Add
     C                     EXSR CHKREC                     90 = no rec found
     C           *IN90     IFEQ *ON                        Valid keys
     C                     MOVE *OFF      *IN30            Allow change
     C                     MOVE 'Add'     FUNC             Function
     C                     EXFMTDSPDTL1                    Data Entry Screen
     C                     MOVE *OFF      *IN79            Error Indicator
     C                     EXSR CHEKIT                     Validate Input
     C  N79                WRITERF$ZIP                     Write new record
     C                     ELSE                            ELSE *IN90 = OFF
     C                     MOVE 'USR0035' MSGID            Record not found
     C                     EXSR SNDMSG                     Send Message
     C                     ENDIF                           *IN90 = ON
     C*
     C           OPTION    WHEQ 2                          Change
     C                     EXSR CHKREC                     90 = no rec found
     C           *IN90     IFEQ *OFF                       Found Record
     C                     MOVE *OFF      *IN30            Allow change
     C                     MOVE 'Maint'   FUNC             Function
     C                     EXFMTDSPDTL1                    Data Entry Screen
     C                     MOVE *OFF      *IN79            Error Indicator
     C                     EXSR CHEKIT                     Validate Input
     C           *IN79     IFEQ *OFF                       No validation err
     C                     UPDATRF$ZIP                     Update old record
     C                     MOVELLIST      UPDBUF 15        Update Buffer
     C                     Z-ADD15        UPDLEN           Data Length
     C                     MOVEL'DSPDTL1' UPDREC           Record Name
     C                     MOVE 'SAME'    UPDOPT           Options
     C                     MOVELEPLIST    UPDLST           List Name
     C                     EXSR UPDLE                      Update List
     C                     ENDIF                           IF *IN79 = OFF
     C                     ELSE                            Else *IN90 = ON
     C                     MOVE 'USR0036' MSGID            Record not found
     C                     EXSR SNDMSG                     Send Message
     C                     ENDIF                           IF *IN90 = OFF
     C*
     C           OPTION    WHEQ 3                          Copy
     C                     EXSR CHKREC                     90 = no rec found
     C           *IN90     IFEQ *OFF                       Record Found
     C                     MOVE *OFF      *IN30            Allow change
     C                     MOVE 'Copy'    FUNC             Function
     C                     EXFMTDSPDTL2                    "Copy" Screen
     C                     MOVE *OFF      *IN79            Error Indicator
     C                     EXSR CHKREC                     90 = no rec found
     C           *IN90     IFEQ *OFF                       Found Record
     C                     MOVE *ON       *IN33            Rec already there
     C                     MOVE *ON       *IN79            Error
     C                     ELSE                            Else NRF
     C                     EXSR CHEKIT                     Validate Input
     C           *IN79     IFEQ *OFF                       No errors
     C                     WRITERF$ZIP                     Write new record
     C                     ENDIF                           IF *IN79 = OFF
     C                     ENDIF                           IF *IN90 = OFF
     C                     ELSE                            *IN90 = ON
     C                     MOVE 'USR0036' MSGID            Record not found
     C                     EXSR SNDMSG                     Send Message
     C                     ENDIF                           IF *IN90 = OFF
     C*
     C           OPTION    WHEQ 4                          Delete
     C                     EXSR CHKREC                     90 = no rec found
     C           *IN90     IFEQ *OFF                       Record Found
     C                     MOVE *ON       *IN30            Protect Data
     C                     MOVE *ON       *IN32            Add F23 descript.
     C                     MOVE 'Delete'  FUNC             Function
     C                     EXFMTDSPDTL1                    Data Entry Screen
     C           CFKEY     IFEQ F23                        Confirm Delete
     C                     DELETRF$ZIP                     Delete old record
     C                     MOVE EPLIST    RMVLST           List Name
     C                     MOVE 'Y'       RMVEXT           Remove = Yes
     C                     MOVE EPLEH     RMVLEH           List Entry Handle
     C                     EXSR RMVLE                      Remove List Entry
     C                     MOVE *OFF      *IN32            Remove F23 entry
     C                     ENDIF                           F23 = ON
     C                     ELSE                            *IN90 = ON
     C                     MOVE 'USR0036' MSGID            Record not found
     C                     EXSR SNDMSG                     Send Message
     C                     ENDIF                           *IN90 = OFF
     C*
     C           OPTION    WHEQ 5                          Inquire
     C                     EXSR CHKREC                     90 = no rec found
     C           *IN90     IFEQ *OFF                       Record Found
     C                     MOVE *ON       *IN30            Protect Data
     C                     MOVE 'Inq'     FUNC             Function
     C                     EXFMTDSPDTL1                    Data Entry Screen
     C                     ELSE                            *IN90 = On
     C                     MOVE 'USR0036' MSGID            Record not found
     C                     EXSR SNDMSG                     Send Message
     C                     ENDIF                           IF *IN90 = Off
     C*
     C                     ENDSL                           End Select Option
     C*
     C                     ENDDO                           DOU F3/F12/No Err
     C*
     C           EOJ       TAG
     C                     MOVE *ON       *INLR            EOJ
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C           *INZSR    BEGSR
     C*
     C           *ENTRY    PLIST
     C                     PARM           EPCTYP  4
     C                     PARM           HANDLE  8
     C                     PARM           EPPNLN 10
     C                     PARM           EPLIST 10
     C                     PARM           EPLEH   4
     C                     PARM           EPOPT#  4
     C                     PARM           EPQUAL  4
     C*
     C                     MOVE EPOPT#    OPTION
     C*
     C* CHANGEME!
     C* Key definition:
     C           ZZKEY     KLIST
     C                     KFLD           ZZCARR
     C                     KFLD           ZZORIG
     C                     KFLD           ZZZIPP
     C* ENDCHG!
     C*
     C* Init Parms to send msg to screen:
     C                     MOVE USRMSG    MSGF
     C                     MOVEL'*INFO'   MSGTYP    P
     C                     MOVEL'*'       MSGQ      P
     C*
     C                     MOVEL'LIST'    LSTNAM 10 P      List Name
     C*
     C                     ENDSR                           *INZSR
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C           CHKREC    BEGSR
     C           ZZKEY     CHAINRF$ZIP               90    NRF
     C                     ENDSR                           CHKREC
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C           CHEKIT    BEGSR
     C* This subroutine validates all the user input fields.
     C* It must be modified for each file to be maintained.
     C* Use indicators 30-78 for individual field validation, but reserve
     C*   79 to indicate that ANY one or more fields had an error.
     C*
     C* CHANGEME!
     C           ZZZONE    IFEQ '0 '
     C           ZZZONE    OREQ ' 0'
     C                     MOVE '00'      ZZZONE
     C                     ENDIF
     C           ZZZONE    IFEQ '1 '
     C           ZZZONE    OREQ ' 1'
     C                     MOVE '01'      ZZZONE
     C                     ENDIF
     C           ZZZONE    IFEQ '2 '
     C           ZZZONE    OREQ ' 2'
     C                     MOVE '02'      ZZZONE
     C                     ENDIF
     C           ZZZONE    IFEQ '3 '
     C           ZZZONE    OREQ ' 3'
     C                     MOVE '03'      ZZZONE
     C                     ENDIF
     C           ZZZONE    IFEQ '4 '
     C           ZZZONE    OREQ ' 4'
     C                     MOVE '04'      ZZZONE
     C                     ENDIF
     C           ZZZONE    IFEQ '5 '
     C           ZZZONE    OREQ ' 5'
     C                     MOVE '05'      ZZZONE
     C                     ENDIF
     C           ZZZONE    IFEQ '6 '
     C           ZZZONE    OREQ ' 6'
     C                     MOVE '06'      ZZZONE
     C                     ENDIF
     C           ZZZONE    IFEQ '7 '
     C           ZZZONE    OREQ ' 7'
     C                     MOVE '07'      ZZZONE
     C                     ENDIF
     C           ZZZONE    IFEQ '8 '
     C           ZZZONE    OREQ ' 8'
     C                     MOVE '08'      ZZZONE
     C                     ENDIF
     C           ZZZONE    IFEQ '9 '
     C           ZZZONE    OREQ ' 9'
     C                     MOVE '09'      ZZZONE
     C                     ENDIF
     C*
     C           ZZZONE    IFEQ *BLANK
     C                     SETON                     31  79
     C                     ENDIF
     C* ENDCHG!
     C*
     C                     ENDSR                           CHEKIT
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C           GETLE     BEGSR
     C* Get List Entry corresponding to List Entry Handle:
     C*
     C                     CALL 'QUIGETLE'                 Get List Entry
     C                     PARM           HANDLE           Supplied by UIM
     C                     PARM           GLEBUF           Pgm Variable Buff
     C                     PARM           GLELEN           Length of VARBUF
     C                     PARM           GLEREC 10        UIM Var Rec Name
     C                     PARM           GLELST 10        List Name
     C                     PARM           GLEPOS  4        Find by Selection
     C                     PARM 'Y'       GLECPY  1        Copy Option
     C                     PARM           GLESEL 20        Selection Critera
     C                     PARM           GLEHDL  4        Selection Handle
     C                     PARM 'Y'       GLEEXT  1        Extend Option
     C                     PARM           GLELEH  4        List Entry Handle
     C                     PARM           APIERR           Error DS
     C           ERRMSG    IFNE *BLANK                     If API Failed,
     C                     EXSR ESCMSG                      send Escape Msg.
     C                     ENDIF
     C*
     C*
     C                     ENDSR                           GETLE
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C           UPDLE     BEGSR
     C* Update the current list entry:
     C*
     C                     CALL 'QUIUPDLE'                 Update List Entry
     C                     PARM           HANDLE           Supplied by UIM
     C                     PARM           UPDBUF           Pgm Variable Buff
     C                     PARM           UPDLEN           Length of VARBUF
     C                     PARM           UPDREC 10        UIM Var Rec Name
     C                     PARM           UPDLST 10        List Name
     C                     PARM           UPDOPT  4        Upd Current Entry
     C                     PARM           UPDLEH  4        List Entry Handle
     C                     PARM           APIERR           Error DS
     C           ERRMSG    IFNE *BLANK                     If API Failed,
     C                     EXSR ESCMSG                      send Escape Msg.
     C                     ENDIF
     C*
     C                     ENDSR                           UPDLE
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C           RMVLE     BEGSR
     C* Remove a List Entry:
     C*
     C                     CALL 'QUIRMVLE'
     C                     PARM           HANDLE           Supplied by UIM
     C                     PARM           RMVLST 10        List Name
     C                     PARM           RMVEXT  1        Remove Entry?
     C                     PARM           RMVLEH  4        List Entry Handle
     C                     PARM           APIERR           Error DS
     C           ERRMSG    IFNE *BLANK                     If API Failed,
     C                     EXSR ESCMSG                      send Escape Msg.
     C                     ENDIF
     C*
     C                     ENDSR                           RMVLE
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C           SNDMSG    BEGSR
     C* Send a Program Message:
     C*
     C* MSGDTA = Substitution Data (or text, for an immediate message.)
     C* MSGTYP = *INFO   - Full screen message display.
     C*          *STATUS - Appears on bottom of screen. Requires MSGID.
     C*          *DIAG   - Screen + Job Log.
     C*          *COMP   - Botton of screen.
     C*          *ESCAPE - Ends current task. Ends previous task if not
     C*                  monitored for in that task.
     C* MSGQ   = *    - Message queue of current program
     C*          *EXT - External message queue
     C*          name - Name of a specific message queue
     C* MSGSTK = 0 - Send to the message queue named by MSGQ.
     C*          1 - Send to the caller of this program.
     C*
     C* Useful Combinations:
     C* MSGTYP MSGQ   MSGSTK Result
     C* -----  ----   ------ ------------------------------------------
     C* INFO   *      1      Message appears on bottom of screen
     C* INFO   *EXT   1      Full-screen "Display Messages" shown
     C* DIAG   *             Message appears on bottom of screen & in joblog
     C* DIAG   *EXT          Message appears in joblog only
     C* ESCAPE *             Screen & joblog.  Ends program.
     C* * Note: *STATUS messages do not seem to work the same way when
     C* using the API as when using SNDPGMMSG. They flash on the screen
     C* momentarily, but then disappear.
     C*
     C                     MOVE *BLANKS   QMHKEY
     C                     CALL 'QMHSNDPM'
     C                     PARM           MSGID   7        Message ID
     C                     PARM           MSGF   20        Qualified msg fil
     C                     PARM           MSGDTA  1        Substitution data
     C                     PARM           MSGLEN           Length of MSGDTA
     C                     PARM           MSGTYP 10        Message Type
     C                     PARM           MSGQ   10        Message Queue
     C                     PARM           MSGSTK           Call Stack Countr
     C                     PARM           MSGKEY  4        Supplied by systm
     C                     PARM           APIERR           Error DS
     C           ERRMSG    IFNE *BLANK                     If API Failed,
     C                     EXSR ESCMSG                      send Escape Msg.
     C                     ENDIF
     C*
     C                     ENDSR                           SNDMSG
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C           ESCMSG    BEGSR
     C* Close Application and send Escape Message if an API ends in error:
     C*
     C                     MOVE *BLANKS   QMHKEY
     C                     CALL 'QMHSNDPM'
     C                     PARM           ERRMSG
     C                     PARM QCPFMS    QMHFIL 20
     C                     PARM           ERRDTA
     C                     PARM           QMHLEN
     C                     PARM '*ESCAPE' QMHTYP 10
     C                     PARM '*'       QMHPGQ 10
     C                     PARM           QMHSTK
     C                     PARM           QMHKEY  4
     C                     PARM           QMHERR
     C*
     C                     ENDSR                           ESCMSG
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
