      *%METADATA                                                       *
      * %TEXT Update the LDA from a called program                     *
      *%EMETADATA                                                      *
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H*Program Name: UPDTLDA
     H*Purpose: Update the LDA from a called program
     H*Called by: WRITELDA
     H*External Calls: None
     H*Compilation Notes/Parameters: None
     H
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I* Program Status Data Structure:
     I           SDS
     I                                     *PROGRAM PGM
     I                                      244 253 WSID
     I                                      254 263 URID
     I*
     I* LDA:
     I           UDS
     I                                        1   40NUMBER
     I                                        5   9 NAME
     I                                       10  150TIME
     I*
     C* * * * * * * * * * *   Calculations   * * * * * * * * * * * * * * * **
     C*
     C                     Z-ADD4567      NUMBER
     C                     MOVE 'Diane'   NAME
     C*
     C                     MOVE *ON       *INLR
     C*
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C*
     C* * * * * * * * * * *   Subroutines  * * * * * * * * * * * * * * * * **
     C*           -----    -----
     C           *INZSR    BEGSR
     C* Initial Subroutine; executed automatically when program starts:
     C*
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C*
     C                     ENDSR                           END *INZSR
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
