      *%METADATA                                                       *
      * %TEXT List XMP1PF in start date order                          *
      *%EMETADATA                                                      *
     H*Program Name: XMP1R1
     H* Sample Report using a Logical File to sort a YYYYMMDD date by
     H* month.
     H*
     F* * * * * * * * * * * * File Specifications * * * * * * * * * * ******
     FXMP1L1  IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I* * * * * * * * * * * * Input Specifications  * * * * * * * * * ******
     I*
     I* Program Status Data Structure:    (Program Name)
     I           SDS
     I                                     *PROGRAM PGM
     I*
     C* * * * * * * * * * * * Subroutines * * * * * * * * * * * * * * *******
     C           *INZSR    BEGSR
     C*           -----    -----
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C                     ENDSR                           *INZSR
     C*                    -----
     O*********************** Output Specifications ************************
     OQPRINT  H  203   1P
     O       OR        OFN1P
     O                         PGM       10
     O                                   63 'Report'
     O                                   95 'Date'
     O                         UDATE Y  104
     O                         TIME     116 '  :  :  '
     O                                  127 'Page'
     O                         PAGE  Z  132
     O        H  3     1P
     O       OR        OFN1P
     O                                    4 'MNTH'
     O                                   14 'START'
     O        D  2
     O                         MONTH      3
     O                         STRDAT    15 '    /  /  '
     O                         DIFF  K   25
     O                         YEAR      30
     O                         DAY       33
