      *%METADATA                                                       *
      * %TEXT Handling date data-type fields in RPG/400                *
      *%EMETADATA                                                      *
     H*Program Name: XMP4R
     H*Title: Handling date data-type fields in RPG/400.
     H*
     H*   RPG/400 does not support date data-type fields. To be processed
     H* they must be converted to 6, 8 or 10-byte character fields by the
     H* CVTOPT(*DATETIME) parameter of the CRTRPGPGM command. (see below)
     H* If this is not done, the compiler ignores any date fields in the
     H* externally described file(s) and issues the following message:
     H* *7151 IGNORED DATE/TIME/TIMESTAMP FIELDS IN RECORD x OF FILE y.
     H*  Alternatively, a Logical file can be created to redefine the dates
     H* as zoned fields. See file XMP4L2 and program XMP4RA for details.
     H*
     H*   Before writing to a database field of date data-type, move the
     H* data into a 6, 8 or 10-byte character field with EXACTLY the same
     H* format and separators specified in the physical file as determined
     H* by the DATFMT and DATSEP keywords. The default is *ISO if neither
     H* is coded. ISO uses a 10-byte representation with dashes for
     H* separators, YYYY-MM-DD, and this program uses the conCATenation
     H* op code to assemble the date in this format.
     H*Input/Output: Display file XMP4D
     H*Output: Physical file XMP4PF
     H*Called by: command line
     H*External Calls: QWCCVTDT API
     H* Note: When converting 2-digit years to 4 digits, QWCCVTDT requires
     H* that the 1-byte "century" indicator be supplied. This program uses
     H* the convention that 2-digit years from 40-99 represent the years
     H* 1940-1999 (century indicator = 0) and 2-digit years from 00-39
     H* represent the years from 2000-2039 (century indicator = 1).
     H*Compilation Notes/Parameters: CRTRPGPGM PGM(XMP4R) CVTOPT(*DATETIME)
     H* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H* Indicator Usage Summary:
     H* --------- ----- -------
     H* 50 Invalid start date
     H* 51 Invalid end date
     H*
     F* * * * * * * * * * *   File Specifications   * * * * * * * * * * * * * *
     FXMP4D   CF  E                    WORKSTN      KINFDS WSDS
     FXMP4PF  O   E                    DISK                      A
     F*
     I* * * * * * * * * * *   Input Specifications  * * * * * * * * * * * *
     I*
     I* Workstation File Information Data Structure (INFDS)
     IWSDS        DS
     I                                     *STATUS  STATUS
     I                                      369 369 FKEY
     I* Function Keys:
     I              X'33'                 C         F3
     I              X'39'                 C         F9
     I              X'3C'                 C         F12
     I*
     I* Data Structures used by QWCCVTDT API for date conversion:
     I*
     I* Input date format:
     I            DS
     I                                        1  10 $INFMT
     I*
     I* Input date - use a 16-byte structure when *JOB, *SYSVAL, *YMD, *MDY,
     I* *DMY or *JUL is specified for the input date format:
     I$INDAT      DS
     I                                        1   1 $ICENT
     I                                        2   7 $IDATE
     I                                        6   7 $IYEAR
     I                                        8  13 $ITIME
     I I            0                        14  160$IMSEC
     I*
     I* Input date - use a 17-byte structure when *YYMD, *MDYY, *DMYY or
     I* *LONGJUL is specified for the input date format:
     I$INDT8      DS
     I                                        1   8 $IDAT8
     I                                        1   4 $IJCEN
     I                                        5   7 $IJDAY
     I                                        8   8 $BLANK
     I                                        9  14 $ITIM8
     I I            0                        15  170$IMS8
     I*
     I* Output date format:
     I            DS
     I                                        1  10 $OUFMT
     I*
     I* Output date - use a 16-byte structure when *JOB, *SYSVAL, *YMD,
     I* *MDY, *DMY or *JUL is specified for the input date format:
     I$OUDAT      DS
     I                                        1   1 $OCENT
     I                                        2   7 $ODATE
     I                                        8  13 $OTIME
     I I            0                        14  160$OMSEC
     I*
     I* Output date - use a 17-byte structure when *YYMD, *MDYY, *DMYY or
     I* *LONGJUL is specified for the input date format:
     I$OUDT8      DS
     I                                        1   8 $ODAT8
     I                                        1   4 $O8CEN
     I                                        5   6 $O8MON
     I                                        7   8 $O8DAY
     I                                        5   7 $OJDAY
     I                                        9  14 $OTIM8
     I I            0                        15  170$OMS8
     I*
     I* API Error message structure:
     I$APIER      DS
     I I            80                    B   1   40$ERSIZ
     I I            0                     B   5   80$ERLEN
     I                                        9  15 $ERMIC
     I                                       16  16 $ERRSV
     I                                       17  96 $ERTXT
     I*
     C* * * * * * * * * * *   Calculations   * * * * * * * * * * * * * * * * * *
     C*
     C                     MOVE 'N'       EXIT    1
     C*
     C* Show screen & process input as long as user does not request an exit:
     C           EXIT      DOWEQ'N'
     C                     EXFMTXMP4D100
     C*
     C* Process user actions:
     C                     SELEC
     C*
     C           FKEY      WHEQ F3                         F3=Exit
     C           FKEY      OREQ F12                        F12=Cancel
     C                     MOVE 'Y'       EXIT
     C*
     C           FKEY      WHEQ F9                         F9=Calculate
     C                     EXSR VALIDT                     Validate dates
     C           UPDATE    IFEQ 'Y'                        OK to update?
     C                     EXSR CALCDT                     Calc new dates
     C                     ENDIF
     C*
     C                     OTHER                           Else enter key
     C                     EXSR VALIDT                     Validate dates
     C           UPDATE    IFEQ 'Y'                        OK to update?
     C                     EXSR CALCDT                     Calc new dates
     C                     WRITEXMP4R                      Write data record
     C                     CLEARXMP4D100                   Clear input scrn
     C                     ENDIF
     C*
     C                     ENDSL                           END SELEC
     C*
     C                     ENDDO                           END DOW EXIT = N
     C*
     C                     MOVE *ON       *INLR            EOJ
     C*
     C* * * * * * * * * * *   Subroutines   * * * * * * * * * * * * * * * * * *
     C*           -----    -----
     C           *INZSR    BEGSR
     C* Initial Subroutine; executed automatically when program starts:
     C*
     C                     Z-ADD*ZERO     STRCEN  40
     C                     Z-ADD*ZERO     STRDAY  30
     C                     Z-ADD*ZERO     ENDCEN  40
     C                     Z-ADD*ZERO     ENDDAY  30
     C*
     C                     ENDSR                           End *INZSR
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C* Validate start/end dates keyed in by user. Convert from the MMDDYY
     C* format used on the screen to ISO format for storing in the file.
     C*          ------    -----
     C           VALIDT    BEGSR
     C*
     C                     MOVE 'Y'       UPDATE  1        OK to update?
     C                     MOVE *OFF      *IN50            Error Indicator
     C                     MOVE *OFF      *IN51            Error Indicator
     C*
     C* Validate start date and convert to YYYYMMDD format:
     C                     MOVEL'*MDY'    $INFMT    P      Input date fmt
     C                     MOVE XXSDAT    $IDATE           Date to convert
     C           $IYEAR    IFGT '40'                       = 1940-1999
     C                     MOVE '0'       $ICENT           Century indicator
     C                     ELSE                            = 2000-2039
     C                     MOVE '1'       $ICENT           Century indicator
     C                     ENDIF
     C                     MOVEL'*YYMD'   $OUFMT    P      Output date fmt
     C                     CALL 'QWCCVTDT'                 Convert date API
     C                     PARM           $INFMT
     C                     PARM           $INDAT
     C                     PARM           $OUFMT
     C                     PARM           $OUDT8
     C                     PARM           $APIER
     C           $ERLEN    IFEQ *ZERO                      Input date OK
     C* Convert date to *ISO format for writing to file:
     C           $O8CEN    CAT  '-':0     STRDAT    P       4-digit century
     C                     CAT  $O8MON:0  STRDAT            month
     C                     CAT  '-':0     STRDAT            ISO separator
     C                     CAT  $O8DAY:0  STRDAT            day
     C                     ELSE                            Invalid date
     C                     MOVE 'N'       UPDATE            Error: no update
     C                     MOVE *ON       *IN50             RI/PC, Errmsg
     C                     ENDIF                           End if erlen = 0
     C*
     C* Validate end date and convert to YYYYMMDD format:
     C                     MOVEL'*MDY'    $INFMT    P      Input date format
     C                     MOVE XXEDAT    $IDATE           Date to convert
     C           $IYEAR    IFGT '40'                       = 1940-1999
     C                     MOVE '0'       $ICENT           Century indicator
     C                     ELSE                            = 2000-2039
     C                     MOVE '1'       $ICENT           Century indicator
     C                     ENDIF
     C                     MOVEL'*YYMD'   $OUFMT    P      Output date fmt
     C                     CALL 'QWCCVTDT'                 Convert date API
     C                     PARM           $INFMT
     C                     PARM           $INDAT
     C                     PARM           $OUFMT
     C                     PARM           $OUDT8
     C                     PARM           $APIER
     C           $ERLEN    IFEQ *ZERO                      Input date OK
     C* Convert date to *ISO format for writing to file:
     C           $O8CEN    CAT  '-'       ENDDAT    P       4-digit century
     C                     CAT  $O8MON:0  ENDDAT            month
     C                     CAT  '-':0     ENDDAT            ISO separator
     C                     CAT  $O8DAY:0  ENDDAT            day
     C                     ELSE                            Invalid date
     C                     MOVE 'N'       UPDATE            Error: no update
     C                     MOVE *ON       *IN51             RI/PC, Errmsg
     C                     ENDIF                           End if erlen = 0
     C*
     C                     ENDSR                           End SR VALIDT
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C* Convert the dates to Julian format to calculate durations and future
     C* dates.
     C*          ------    -----
     C           CALCDT    BEGSR
     C*
     C* 1. Get the difference between the two dates.
     C*    A. Convert start date to Julian format:
     C                     MOVEL'*MDY'    $INFMT    P      Input date fmt
     C                     MOVE XXSDAT    $IDATE           Date to convert
     C           $IYEAR    IFGT '40'                       = 1940-1999
     C                     MOVE '0'       $ICENT           Century indicator
     C                     ELSE                            = 2000-2039
     C                     MOVE '1'       $ICENT           Century indicator
     C                     ENDIF
     C                     MOVEL'*LONGJUL'$OUFMT    P      Output date fmt
     C                     CALL 'QWCCVTDT'                 Convert date API
     C                     PARM           $INFMT
     C                     PARM           $INDAT
     C                     PARM           $OUFMT
     C                     PARM           $OUDT8
     C                     PARM           $APIER
     C                     MOVE $O8CEN    STRCEN           4-digit century
     C                     MOVE $OJDAY    STRDAY           no. of days
     C*
     C*    B. Convert end date to Julian format:
     C                     MOVEL'*MDY'    $INFMT    P      Input date fmt
     C                     MOVE XXEDAT    $IDATE           Date to convert
     C           $IYEAR    IFGT '40'                       = 1940-1999
     C                     MOVE '0'       $ICENT           Century indicator
     C                     ELSE                            = 2000-2039
     C                     MOVE '1'       $ICENT           Century indicator
     C                     ENDIF
     C                     MOVEL'*LONGJUL'$OUFMT    P      Output date fmt
     C                     CALL 'QWCCVTDT'                 Convert date API
     C                     PARM           $INFMT
     C                     PARM           $INDAT
     C                     PARM           $OUFMT
     C                     PARM           $OUDT8
     C                     PARM           $APIER
     C                     MOVE $O8CEN    ENDCEN           4-digit century
     C                     MOVE $OJDAY    ENDDAY           no. of days
     C*
     C*    C. Subtract century and year portions separately:
     C           ENDCEN    SUB  STRCEN    CENDIF  40       no. of centuries
     C*          Convert years to days (approximately):
     C           CENDIF    MULT 365.25    DAYDIF  50       days in CENDIF
     C           ENDDAY    SUB  STRDAY    DIFF             days difference
     C                     ADD  DAYDIF    DIFF             days + centuries
     C*
     C* 2. Display the end date as it will be stored in the file:
     C                     MOVE ENDDAT    CNVEDT
     C*
     C* 3. Find the "Terms Date" - 10 days after the end date:
     C*    A. Add 10 days to end Julian day:
     C                     ADD  10        ENDDAY           Julian days
     C           ENDDAY    IFGT 365                        past EOY?
     C                     SUB  365       ENDDAY           subtract 1 year..
     C                     ADD  1         ENDCEN           and add 1 year
     C                     ENDIF
     C*    B. Convert new end date from Julian format to YYYYMMDD format:
     C                     MOVEL'*LONGJUL'$INFMT    P      Input date fmt
     C                     MOVE ENDCEN    $IJCEN           Year to convert
     C                     MOVE ENDDAY    $IJDAY           Date to convert
     C                     MOVE *BLANK    $BLANK           Left-justify JUL
     C                     MOVEL'*YYMD'   $OUFMT    P      Output date fmt
     C                     CALL 'QWCCVTDT'                 Convert date API
     C                     PARM           $INFMT
     C                     PARM           $INDT8
     C                     PARM           $OUFMT
     C                     PARM           $OUDT8
     C                     PARM           $APIER
     C*    C. Convert date to *ISO format for writing to screen and file:
     C           $O8CEN    CAT  '-'       XXPL10    P
     C                     CAT  $O8MON:0  XXPL10
     C                     CAT  '-':0     XXPL10
     C                     CAT  $O8DAY:0  XXPL10           Screen
     C                     MOVE XXPL10    TERMDT    P      File
     C*
     C* Display current century:
     C                     Z-ADD*YEAR     CURCEN           Century + Year
     C*
     C                     ENDSR                           End SR CALCDT
     C*                    -----
     C* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
