      *%METADATA                                                       *
      * %TEXT List XMP4PF2 (*MDY) file using CVTOPT(*DATETIME)         *
      *%EMETADATA                                                      *
     H*Program Name: XMP4R4
     H*Title: Handling *MDY date data-type fields in RPG/400.
     H*
     H*   RPG/400 does not support date data-type fields. To be processed
     H* they must be converted to 6, 8 or 10-byte character fields by the
     H* CVTOPT(*DATETIME) parameter of the CRTRPGPGM command. (see below)
     H* If this is not done, the compiler ignores any date fields in the
     H* externally described file(s) and issues the following message:
     H* *7151 IGNORED DATE/TIME/TIMESTAMP FIELDS IN RECORD x OF FILE y.
     H*   As long as no date manipulation needs to occur, the dates can
     H* simply be printed. Allow 8 bytes for the output field, as it
     H* will already contain separators.
     H*   Alternatively, a Logical file can be created to redefine the dates
     H* as zoned fields. See file XMP4L2 and program XMP4RA for details.
     H*
     H*Input: Physical file XMP4PF2
     H*Output: Printed report.
     H*Called by: command line
     H*External Calls: None.
     H*Compilation Notes/Parameters: CRTRPGPGM PGM(XMP4R4) CVTOPT(*DATETIME)
     F* * * * * * * * * * * * File Specifications * * * * * * * * * * ******
     FXMP4PF2 IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     I* * * * * * * * * * * * Input Specifications  * * * * * * * * * ******
     I*
     I* Program Status Data Structure:    (Program Name)
     I           SDS
     I                                     *PROGRAM PGM
     I*
     C* * * * * * * * * * * * Subroutines * * * * * * * * * * * * * * *******
     C           *INZSR    BEGSR
     C*           -----    -----
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C                     ENDSR                           *INZSR
     C*                    -----
     O*********************** Output Specifications ************************
     OQPRINT  H  203   1P
     O       OR        OFN1P
     O                         PGM       10
     O                                   63 'Report'
     O                                   95 'Date'
     O                         UDATE Y  104
     O                         TIME     116 '  :  :  '
     O                                  127 'Page'
     O                         PAGE  Z  132
     O        H  3     1P
     O       OR        OFN1P
     O                                    8 'START'
     O                                   18 'END'
     O                                   28 'TERMS'
     O        D  1
     O                         STRDAT     8
     O                         ENDDAT    18
     O                         TERMDT    28
