      *%METADATA                                                       *
      * %TEXT List XMP8PF in start date order using a LF               *
      *%EMETADATA                                                      *
     H*Program Name: XMP8R1
     H*Title: Using a Logical File to print MMDDYY dates in YYMMDD order.
     H*Input: Logical file XMP8L1
     H*Output: Printed report
     H*Called by: command line
     F* * * * * * * * * * * * File Specifications * * * * * * * * * * ******
     FXMP8L1  IP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     C* * * * * * * * * * * * Subroutines * * * * * * * * * * * * * * *******
     C           *INZSR    BEGSR
     C*           -----    -----
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C                     ENDSR                           *INZSR
     C*                    -----
     O*********************** Output Specifications ************************
     OQPRINT  H  203   1P
     O       OR        OFN1P
     O                                   10 'XMP8R1'
     O                                   63 'Report'
     O                                   95 'Date'
     O                         UDATE Y  104
     O                         TIME     116 '  :  :  '
     O                                  127 'Page'
     O                         PAGE  Z  132
     O        H  3     1P
     O       OR        OFN1P
     O                                   10 'Start Date'
     O                                   27 'Difference'
     O        D  2    N1P
     O                         STRDATY   10
     O                         DIFF  K   27
