      *%METADATA                                                       *
      * %TEXT List XMP4PF2L: Date data-types redefined as Zoned        *
      *%EMETADATA                                                      *
     H*Program Name: XMP8R2
     H*Title: Using a Logical File to convert *MDY Date data-type (L)
     H*  date fields to Zoned for processing in an RPG/400 program.
     H*Input: Logical file XMP4PF2L (sorted by start date.)
     H*Output: Printed report
     H*Called by: Command line
     H*Compilation Notes: None
     F* * * * * * * * * * * * File Specifications * * * * * * * * * * ******
     FXMP4PF2LIP  E           K        DISK
     FQPRINT  O   F     132     OF     PRINTER
     C* * * * * * * * * * * * Subroutines * * * * * * * * * * * * * * *******
     C           *INZSR    BEGSR
     C*           -----    -----
     C* Get current time for 1P Header:
     C                     TIME           TIME    60
     C                     ENDSR                           *INZSR
     C*                    -----
     O*********************** Output Specifications ************************
     OQPRINT  H  203   1P
     O       OR        OFN1P
     O                                   10 'XMP8R2'
     O                                   63 'Report'
     O                                   95 'Date'
     O                         UDATE Y  104
     O                         TIME     116 '  :  :  '
     O                                  127 'Page'
     O                         PAGE  Z  132
     O        H  3     1P
     O       OR        OFN1P
     O                                   10 'Start Date'
     O                                   20 'End Date'
     O                                   31 'Terms Date'
     O        D  2    N1P
     O                         STRDATY   10
     O                         ENDDATY   20
     O                         TERMDTY   31
