0002 F* Program name - AMZCOO0R                                         * AMZCOO  P04972
0003 F* Description  - Change object ownership for specified objects    * AMZCOO  P04972
0004 F*                                                                 * AMZCOO  P04972
0005 F* Function:                                                       * AMZCOO  P04972
0006 F*   . Reads records in QADSPOBJ file created by AMZCOO0C          * AMZCOO  P04972
0007 F*   . Records are selected by ownership not equal to AMAPICS      * AMZCOO  P04972
0008 F*   . Changes object ownership to AMAPICS                         * AMZCOO  P04972
0009 F*                                                                 * AMZCOO  P04972
0010 F* Expected parameters:                                            * AMZCOO  P04972
0011 F*   &LIBNM - Library name containing the objects                  * AMZCOO  P04972
0012 F*   &OBJCT - Name of object(s) to be changed                      * AMZCOO  P04972
0013 F*   &OBJTY - Type of object to be changed                         * AMZCOO  P04972
0014 F*   &RTNCD - Return code to caller                                * AMZCOO  P04972
0015 F*            0 = successful run                                   * AMZCOO  P04972
0016 F*            1 = unexpected error occurred                        * AMZCOO  P04972
0017 F*                                                                 * AMZCOO  P04972
0018 F* Programs that call this program:                                * AMZCOO  P04972
0019 F*   AMZCOO0C - Change object ownership processor                  * AMZCOO  P04972
0020 F*                                                                 * AMZCOO  P04972
0021 F* Programs called by this program:                                * AMZCOO  P04972
0022 F*   QCMDEXC                                                       * AMZCOO  P04972
0023 F*                                                                 * AMZCOO  P04972
0024 F* Indicator usage summary                                         * AMZCOO  P04972
0025 F*                                                                 * AMZCOO  P04972
0026 F*  10     First cycle completed                                   * AMZCOO  P04972
0027 F*  20     No record returned on QADSPOBJ read - exit program      * AMZCOO  P04972
0028 F*                                                                 * AMZCOO  P04972
0029 F******************************************************************* AMZCOO  P04972
0030 E******************************************************************* AMZCOO  P04972
0031 E*                                                                 * AMZCOO  P04972
0032 E*  Array usage summary                                            * AMZCOO  P04972
0033 E*                                                                 * AMZCOO  P04972
0034 E*  CHG   - Change object ownership command passed to QCMDEXC      * AMZCOO  P04972
0035 E*  LIB   - Library name string used to move name to command       * AMZCOO  P04972
0036 E*                                                                 * AMZCOO  P04972
0037 E                    CHG    80  80  1                                AMZCOO  P04972
0038 E                    LIB        10  1                                AMZCOO  P04972
0039 E*                                                                 * AMZCOO  P04972
0040 E******************************************************************* AMZCOO  P04972
0041 I******************************************************************* AMZCOO  P04972
0042 I*                                                                 * AMZCOO  P04972
0043 I            DS                                                      AMZCOO  P04972
0044 I                                        1  10 LIB                   AMZCOO  P04972
0045 I                                        1  10 LIBNAM                AMZCOO  P04972
0046 I*                                                                 * AMZCOO  P04972
0047 I            DS                                                      AMZCOO  P04972
0048 I                                        1  10 BLNK10                AMZCOO  P04972
0049 I                                        1   8 BLNK08                AMZCOO  P04972
0050 I*                                                                 * AMZCOO  P04972
0051 I******************************************************************* AMZCOO  P04972
0052 C******************************************************************* AMZCOO  P04972
0053 C*                                                                 * AMZCOO  P04972
0054 C*          --------  Mainline processing  --------                * AMZCOO  P04972
0055 C*                                                                 * AMZCOO  P04972
0056 C*  Initialize variables                                           * AMZCOO  P04972
0057 C*                                                                 * AMZCOO  P04972
0058 C           *IN10     CASEQ*OFF      DEFIN                           AMZCOO  P04972
0059 C                     ENDCS                                          AMZCOO  P04972
0060 C*                                                                 * AMZCOO  P04972
0061 C*  Declare the file cursor for the QADSPOBJ file                  * AMZCOO  P04972
0062 C*                                                                 * AMZCOO  P04972
0063 C/EXEC SQL                                                           AMZCOO  P04972
0064 C+    declare objcur cursor for                                      AMZCOO  P04972
0065 C+      select odlbnm, odobnm, odobtp, odobow                        AMZCOO  P04972
0066 C+      from QADSPOBJ                                                AMZCOO  P04972
0067 C+      where odobow <> 'AMAPICS   '                                 AMZCOO  P04972
0068 C/END-EXEC                                                           AMZCOO  P04972
0069 C*                                                                 * AMZCOO  P04972
0070 C*  Fetch records from the file and change the ownership of the    * AMZCOO  P04972
0071 C*  objects for any records retrieved                              * AMZCOO  P04972
0072 C*                                                                 * AMZCOO  P04972
0073 C/EXEC SQL                                                           AMZCOO  P04972
0074 C+    open objcur                                                    AMZCOO  P04972
0075 C/END-EXEC                                                           AMZCOO  P04972
0076 C*                                                                 * AMZCOO  P04972
0077 C*      Loop until out of records                                  * AMZCOO  P04972
0078 C*                                                                 * AMZCOO  P04972
0079 C                     MOVE *OFF      *IN20                           AMZCOO  P04972
0080 C           *IN20     DOWEQ*OFF                                      AMZCOO  P04972
0081 C*                                                                 * AMZCOO  P04972
0082 C*      Fetch a record from QADSPOBJ                               * AMZCOO  P04972
0083 C*                                                                 * AMZCOO  P04972
0084 C/EXEC SQL                                                           AMZCOO  P04972
0085 C+    fetch objcur into :LIBNAM, :OBJECT, :OBJTYP, :OBJOWN           AMZCOO  P04972
0086 C/END-EXEC                                                           AMZCOO  P04972
0087 C*                                                                 * AMZCOO  P04972
0088 C*      If a record was returned, process it                       * AMZCOO  P04972
0089 C*      Otherwise, set up to exit the loop                         * AMZCOO  P04972
0090 C*                                                                 * AMZCOO  P04972
0091 C           SQLCOD    IFEQ *ZEROS                                    AMZCOO  P04972
0092 C*                                                                 * AMZCOO  P04972
0093 C                     EXSR CHGOO                                     AMZCOO  P04972
0094 C*                                                                 * AMZCOO  P04972
0095 C                     ELSE                                           AMZCOO  P04972
0096 C                     MOVE *ON       *IN20                           AMZCOO  P04972
0097 C                     ENDIF                                          AMZCOO  P04972
0098 C*                                                                 * AMZCOO  P04972
0099 C                     ENDDO                                          AMZCOO  P04972
0100 C*                                                                 * AMZCOO  P04972
0101 C*  Close the file cursor and exit the program                     * AMZCOO  P04972
0102 C*                                                                 * AMZCOO  P04972
0103 C/EXEC SQL                                                           AMZCOO  P04972
0104 C+    close objcur                                                   AMZCOO  P04972
0105 C/END-EXEC                                                           AMZCOO  P04972
0106 C*                                                                 * AMZCOO  P04972
0107 C                     MOVE *ON       *INLR                           AMZCOO  P04972
0108 C*                                                                 * AMZCOO  P04972
0109 C******************************************************************* AMZCOO  P04972
0110 C*                                                                 * AMZCOO  P04972
0111 C*  Subroutine usage                                               * AMZCOO  P04972
0112 C*                                                                 * AMZCOO  P04972
0113 C*  CHGOO - Change the ownership of the retrieved object name      * AMZCOO  P04972
0114 C*  DEFIN - Define work fields and parameter lists, etc.           * AMZCOO  P04972
0115 C*                                                                 * AMZCOO  P04972
0116 C******************************************************************* AMZCOO  P04972
0117 C*  CHGOO - Change the ownership of the retrieved object name      * AMZCOO  P04972
0118 C******************************************************************* AMZCOO  P04972
0119 C*                                                                 * AMZCOO  P04972
0120 C           CHGOO     BEGSR                                          AMZCOO  P04972
0121 C*                                                                 * AMZCOO  P04972
0122 C*  Move input fields to the CHG command string                    * AMZCOO  P04972
0123 C*                                                                 * AMZCOO  P04972
0124 C                     MOVEAOBJECT    CHG,27                          AMZCOO  P04972
0125 C                     MOVEAOBJTYP    CHG,47                          AMZCOO  P04972
0126 C*                                                                 * AMZCOO  P04972
0127 C*  Get the length of the library name string                      * AMZCOO  P04972
0128 C*  LIBNAM has been 'moved' to LIB via input spec data structure   * AMZCOO  P04972
0129 C*                                                                 * AMZCOO  P04972
0130 C           ' '       CHEKRLIBNAM    X              30               AMZCOO  P04972
0131 C*                                                                 * AMZCOO  P04972
0132 C*  Get the start position in CHG for the library name             * AMZCOO  P04972
0133 C*                                                                 * AMZCOO  P04972
0134 C           26        SUB  X         S                               AMZCOO  P04972
0135 C*                                                                 * AMZCOO  P04972
0136 C*  Put the library name in the command string                     * AMZCOO  P04972
0137 C*                                                                 * AMZCOO  P04972
0138 C           1         DO   X         Y                               AMZCOO  P04972
0139 C                     MOVE LIB,Y     CHG,S                           AMZCOO  P04972
0140 C                     ADD  1         S                               AMZCOO  P04972
0141 C                     ENDDO                                          AMZCOO  P04972
0142 C*                                                                 * AMZCOO  P04972
0143 C*  Call QCMDEXC to change the ownership                           * AMZCOO  P04972
0144 C*                                                                 * AMZCOO  P04972
0145 C                     MOVEACHG       CHGDS                           AMZCOO  P04972
0146 C                     CALL 'QCMDEXC' QCPLST       3030               AMZCOO  P04972
0147 C*                                                                 * AMZCOO  P04972
0148 C*  If an error occurred on the call - set up RTNCD                * AMZCOO  P04972
0149 C*                                                                 * AMZCOO  P04972
0150 C           *IN30     IFEQ *ON                                       AMZCOO  P04972
0151 C                     MOVE '1'       RTNCD                           AMZCOO  P04972
0152 C                     ENDIF                                          AMZCOO  P04972
0153 C*                                                                 * AMZCOO  P04972
0154 C*  Clear the CHG array fields for the next record content         * AMZCOO  P04972
0155 C*                                                                 * AMZCOO  P04972
0156 C                     MOVEABLNK10    CHG,16                          AMZCOO  P04972
0157 C                     MOVEABLNK10    CHG,27                          AMZCOO  P04972
0158 C                     MOVEABLNK08    CHG,47                          AMZCOO  P04972
0159 C*                                                                 * AMZCOO  P04972
0160 C                     ENDSR                                          AMZCOO  P04972
0161 C*                                                                 * AMZCOO  P04972
0162 C******************************************************************* AMZCOO  P04972
0163 C*  DEFIN - Define work fields and parameter lists, etc.           * AMZCOO  P04972
0164 C******************************************************************* AMZCOO  P04972
0165 C*                                                                 * AMZCOO  P04972
0166 C           DEFIN     BEGSR                                          AMZCOO  P04972
0167 C*                                                                 * AMZCOO  P04972
0168 C           *ENTRY    PLIST                                          AMZCOO  P04972
0169 C                     PARM           LIBNM  10                       AMZCOO  P04972
0170 C                     PARM           OBJCT  10                       AMZCOO  P04972
0171 C                     PARM           OBJTY   8                       AMZCOO  P04972
0172 C                     PARM           RTNCD   1                       AMZCOO  P04972
0173 C*                                                                 * AMZCOO  P04972
0174 C*  Set up the QCMDEXC parameter list                              * AMZCOO  P04972
0175 C*                                                                 * AMZCOO  P04972
0176 C           QCPLST    PLIST                                          AMZCOO  P04972
0177 C                     PARM           CHGDS                           AMZCOO  P04972
0178 C                     PARM           CHGLN  155                      AMZCOO  P04972
0179 C                     Z-ADD80        CHGLN                           AMZCOO  P04972
0180 C*                                                                 * AMZCOO  P04972
0181 C*  Define the fields used when fetching a record from QADSPOBJ    * AMZCOO  P04972
0182 C*                                                                 * AMZCOO  P04972
0183 C           *LIKE     DEFN OBJCT     OBJECT                          AMZCOO  P04972
0184 C                     MOVE *BLANK    OBJTYP  8                       AMZCOO  P04972
0185 C                     MOVE *BLANK    OBJOWN 10                       AMZCOO  P04972
0186 C                     MOVE *BLANK    CHGDS  80                       AMZCOO  P04972
0187 C                     MOVE *BLANK    BLNK10                          AMZCOO  P04972
0188 C                     Z-ADD*ZERO     X       20                      AMZCOO  P04972
0189 C           *LIKE     DEFN X         S                               AMZCOO  P04972
0190 C           *LIKE     DEFN X         Y                               AMZCOO  P04972
0191 C*                                                                 * AMZCOO  P04972
0192 C                     MOVE *ON       *IN10                           AMZCOO  P04972
0193 C*                                                                 * AMZCOO  P04972
0194 C                     ENDSR                                          AMZCOO  P04972
0195 C*                                                                 * AMZCOO  P04972
0196 C******************************************************************* AMZCOO  P04972
** CHG - Command string for CHGOBJOWN                                             P04972
CHGOBJOWN  OBJ(          /          ) OBJTYPE(        ) NEWOWN(AMAPICS)           P04972