     F********************************************************************USRMTI0R
     F*                                                                   USRMTI0R
     F* Module name: USRMTI0R                                             USRMTI0R
     F* Description: Maintain tool master file trigger program            USRMTI0R
     F*                                                                   USRMTI0R
     F*              This is an example program of how a user might       USRMTI0R
     F*              build a trigger program to work properly with        USRMTI0R
     F*              MAPICS XA client products.                           USRMTI0R
     F*                                                                   USRMTI0R
     F*                                                                   USRMTI0R
     F* Maintenance History:                                              USRMTI0R
     F*   Date      Pgmr  DCR/PTF  Summary of Change                      USRMTI0R
     F*   --------  ----  -------  ---------------------------------------USRMTI0R
     F*   09/01/98  USR   X000000  Program creation                       USRMTI0R
     F*   11/11/98  WJB   Rel06    Enhanced standards of program          USRMTI0R
     F*   04/30/02  WJB   Rel07    Added default example                  USRMTI0R
     F*                                                                   USRMTI0R
     F* Parameter Summary:                                                USRMTI0R
     F*   Parameter   Description                        Usage  Size  TypeUSRMTI0R
     F*   ---------   ---------------------------------  -----  ----  ----USRMTI0R
     F*   P#TRBF      Trigger buffer                       I            A USRMTI0R
     F*   P#TBLN      Trigger buffer length                I       4    B USRMTI0R
     F*               Communication data area: (ZTRIGCOMM)              B USRMTI0R
     F*   P#CLID      Caller ID  (position 1 - 8)          I       8    B USRMTI0R
     F*   Client processing parameters:                                 B USRMTI0R
     F*   P#TSTK      Task token (position 9 - 18)         I      10    B USRMTI0R
     F*                                                                   USRMTI0R
     F* Parameter Usage:                                                  USRMTI0R
     F*                                                                   USRMTI0R
     F* Indicator summary:                                                USRMTI0R
     F*  LR   Last record - End of job                                    USRMTI0R
     F*                                                                   USRMTI0R
     F*  90   Work indicator                                              USRMTI0R
     F*                                                                   USRMTI0R
     F******************************************************************* USRMTI0R
     F/EJECT                                                              USRMTI0R
     F******************************************************************* USRMTI0R
     FTRNSTSL1IF  E           K        DISK                           UC  USRMTI0R
     F******************************************************************* USRMTI0R
     F/SPACE 3                                                            USRMTI0R
     E******************************************************************* USRMTI0R
     E                    #SQ    80  80  1               SQL statement    USRMTI0R
     E                    #RD      2560  1               Buffer data      USRMTI0R
     E******************************************************************* USRMTI0R
     E/EJECT                                                              USRMTI0R
     I******************************************************************* USRMTI0R
     I*                                                                   USRMTI0R
     I* SQL related structures.                                           USRMTI0R
     I*                                                                   USRMTI0R
     IW1SLCL      DS                           3000                       USRMTI0R
     I*                                                                   USRMTI0R
     I* Messaging data structures.                                        USRMTI0R
     I*                                                                   USRMTI0R
     I* For retrieving messages - PSXRTM1C                                USRMTI0R
     IRTMSG       DS                            512                       USRMTI0R
     IRTSCLV      DS                           3000                       USRMTI0R
     I*                                                                   USRMTI0R
     I* Program status.                                                   USRMTI0R
     I*                                                                   USRMTI0R
     IPGMSTS    ESDSPGMSTS                                                USRMTI0R
     I*++TAGB0001                                                         USRMTI0R
     I*                                                                   USRMTI0R
     I* Record format (before and after images)                           USRMTI0R
     I*                                                                   USRMTI0R
     IW#RCDT    E DSTOLMSTL0                  2                           USRMTI0R
     I*                                                                   USRMTI0R
     I* Record format for before/after comparison.                        USRMTI0R
     I*                                                                   USRMTI0R
     IW1RCDT    E DSTOLMST                                                USRMTI0R
     I*++TAGE0001                                                         USRMTI0R
     I*                                                                   USRMTI0R
     I* Trigger program input parameters.                                 USRMTI0R
     I*                                                                   USRMTI0R
     IW#TGDT      DS                           2560                       USRMTI0R
     I                                        12560 #RD                   USRMTI0R
     I*                                                                   USRMTI0R
     I* Trigger program input parameters.                                 USRMTI0R
     I*                                                                   USRMTI0R
     IP#TRBF      DS                           2560                       USRMTI0R
     I                                        1  10 P#FLNM                USRMTI0R
     I                                       11  20 P#LBNM                USRMTI0R
     I                                       21  30 P#MBNM                USRMTI0R
     I                                       31  31 P#TGEV                USRMTI0R
     I                                       32  32 P#TGTM                USRMTI0R
     I                                       33  33 P#CMLK                USRMTI0R
     I                                    B  37  400P#CCID                USRMTI0R
     I                                    B  49  520P#OROF                USRMTI0R
     I                                    B  53  560P#ORLN                USRMTI0R
     I                                    B  57  600P#ONOF                USRMTI0R
     I                                    B  61  640P#ONLN                USRMTI0R
     I                                    B  65  680P#NROF                USRMTI0R
     I                                    B  69  720P#NRLN                USRMTI0R
     I                                    B  73  760P#NNOF                USRMTI0R
     I                                    B  77  800P#NNLN                USRMTI0R
     IP#TBLN      DS                                                      USRMTI0R
     I                                    B   1   40P1TBLN                USRMTI0R
     I*                                                                   USRMTI0R
     I* Communication data area from caller.                              USRMTI0R
     I*                                                                   USRMTI0R
     IP#CMDA      DS                           1024                       USRMTI0R
     I                                        1  10 P#CLID                USRMTI0R
     I                                       11  20 P#TSTK                USRMTI0R
     I******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* Mainline.                                                       * USRMTI0R
     C******************************************************************* USRMTI0R
     C           *ENTRY    PLIST                                          USRMTI0R
     C                     PARM           P#TRBF                          USRMTI0R
     C                     PARM           P#TBLN                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Perform program open considerations.                              USRMTI0R
     C*                                                                   USRMTI0R
     C           W#PGOP    IFNE *ON                                       USRMTI0R
     C                     EXSR PGMOPN                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Perform program initialization.                                   USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR PGMINZ                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* Perform the process.                                              USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR PGMPRC                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* If after operation, perform program close considerations.         USRMTI0R
     C*                                                                   USRMTI0R
     C           P#TGTM    IFEQ '1'                                       USRMTI0R
     C***                  EXSR PGMCLS                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Return to caller.                                                 USRMTI0R
     C*                                                                   USRMTI0R
     C                     RETRN                                          USRMTI0R
     C*                                                                   USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* Subroutine usage summary.                                       * USRMTI0R
     C******************************************************************* USRMTI0R
     C*                                                                 * USRMTI0R
     C* AAADCL - Program declarations.                                  * USRMTI0R
     C* CHGAFT - Change after processing requirements.                  * USRMTI0R
     C* CHGBFR - Change before processing requirements.                 * USRMTI0R
     C* CHGBLD - Change string build process.                           * USRMTI0R
     C* CHGSTG - Change string generation.                              * USRMTI0R
     C* CLOFIL - Close open files.                                      * USRMTI0R
     C* CLOPGM - Close open programs.                                   * USRMTI0R
     C* CLSxxn - Close open files subroutines.                          * USRMTI0R
     C* CLSTS1 - Close the TRNSTSL1 file.                               * USRMTI0R
     C* CLTPRC - Client maintenance processing.                         * USRMTI0R
     C* CRTAFT - Create after processing requirements.                  * USRMTI0R
     C* CRTBFR - Create before processing requirements.                 * USRMTI0R
     C* CRTSTG - Create string generation.                              * USRMTI0R
     C* DLTAFT - Delete after processing requirements.                  * USRMTI0R
     C* DLTBFR - Delete before processing requirements.                 * USRMTI0R
     C* DLTSTG - Delete string generation.                              * USRMTI0R
     C* E#nnnn - Edit subroutines.                                      * USRMTI0R
     C* GENHST - Generate history data, if requested.                   * USRMTI0R
     C* GENSTG - Generate history string.                               * USRMTI0R
     C* LODRFM - Load parameter data to record formats.                 * USRMTI0R
     C* OPNxxn - Open files subroutines.                                * USRMTI0R
     C* OPNTS1 - Open the TRNSTSL1 file.                                * USRMTI0R
     C* PGMABT - Program abort logic.                                   * USRMTI0R
     C* PGMCLS - Program close considerations.                          * USRMTI0R
     C* PGMERR - Send error message to current programs message queue   * USRMTI0R
     C* PGMINZ - Program initialization.                                * USRMTI0R
     C* PGMOPN - Program open considerations.                           * USRMTI0R
     C* PGMPRC - Program processing logic.                              * USRMTI0R
     C* RLYMSG - Relay program messages                                 * USRMTI0R
     C* RTVTS1 - Retrieve unique TRNSTSL1 file record.                  * USRMTI0R
     C* SNDESC - Send escape message to caller.                         * USRMTI0R
     C* Safffn - Shut down open programs.                               * USRMTI0R
     C* SVMHG0 - Shutdown program - PSVMHG0R                            * USRMTI0R
     C* SVRMH0 - Shutdown program - PSVRMH0R                            * USRMTI0R
     C* SXEMP1 - Shutdown program - PSXEMP1R                            * USRMTI0R
     C* SXMSG0 - Shutdown program - PSXMSG0R                            * USRMTI0R
     C* Xafffn - Execute programs.                                      * USRMTI0R
     C* XVMHG0 - Execute program - PSVMHG0R                             * USRMTI0R
     C* XVRMH0 - Execute program - PSVRMH0C                             * USRMTI0R
     C* XXEMP1 - Execute program - PSXEMP1R                             * USRMTI0R
     C* XXMSG0 - Execute program - PSXMSG0R                             * USRMTI0R
     C*                                                                 * USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* AAADCL - Program declarations.                                  * USRMTI0R
     C******************************************************************* USRMTI0R
     C           AAADCL    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*    Work context.                                                  USRMTI0R
     C*                                                                   USRMTI0R
     C                     Z-ADD*ZEROS    #X      50                      USRMTI0R
     C                     MOVEL*OFF      W#ERED  1                       USRMTI0R
     C                     MOVELW#ITNO    W#ITNO 15                       USRMTI0R
     C                     MOVELW#OPSQ    W#OPSQ  4                       USRMTI0R
     C                     MOVEL*BLANKS   W#SBTG 10                       USRMTI0R
     C                     MOVEL*BLANKS   W#TLID  6                       USRMTI0R
     C                     MOVEL*BLANKS   W#WA10 10                       USRMTI0R
     C                     MOVEL*OFF      W#WNED  1                       USRMTI0R
     C           *NAMVAR   DEFN ZTRIGCOMM P#CMDA                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* CHGAFT - Change after processing requirements.                  * USRMTI0R
     C******************************************************************* USRMTI0R
     C           CHGAFT    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'CHGAFT01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Set data structure to new record image.                           USRMTI0R
     C*                                                                   USRMTI0R
     C           2         OCUR W#RCDT                                    USRMTI0R
     C*++TAGB0002                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C* Perform any after change processing that might be needed.         USRMTI0R
     C*                                                                   USRMTI0R
     C*++TAGE0002                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C           ZCHAFT    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* CHGBFR - Change before processing requirements.                 * USRMTI0R
     C******************************************************************* USRMTI0R
     C           CHGBFR    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'CHGBFR01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Set data structure to new record image.                           USRMTI0R
     C*                                                                   USRMTI0R
     C           2         OCUR W#RCDT                                    USRMTI0R
     C*++TAGB0003                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C* Perform change edits.                                             USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR E#0001                                    USRMTI0R
     C                     EXSR E#0002                                    USRMTI0R
     C                     EXSR E#0003                                    USRMTI0R
     C*++TAGE0003                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C* If any error edits were encountered send escape message           USRMTI0R
     C*  to cause record action operation to be cancelled.                USRMTI0R
     C*                                                                   USRMTI0R
     C           W#ERED    IFEQ *ON                                       USRMTI0R
     C                     EXSR SNDESC                                    USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C           ZCHBFR    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* CHGBLD - Change string build process.                           * USRMTI0R
     C******************************************************************* USRMTI0R
     C           CHGBLD    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'CHGBLD01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Set parameters for assign/original generation.                    USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*YES    'W#PFPR           Process?       USRMTI0R
     C                     MOVEL'*NO     'W#SHDN           Shutdown?      USRMTI0R
     C                     MOVEL'*PROCESS'W#BLRQ           Request type   USRMTI0R
     C                     MOVELW#KYGN    W#KYGN           Keyword        USRMTI0R
     C*++TAGB0004                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C* Create field original/assign for fields that have changed.        USRMTI0R
     C*                                                                   USRMTI0R
     C*  Note the difference on how alpha and numeric fields are          USRMTI0R
     C*   setup differently.                                              USRMTI0R
     C*  For alpha fields, the field is moved to W#FDST and the           USRMTI0R
     C*   data type field W#FDDT is set to 'S' (string data).             USRMTI0R
     C*  For numeric fields, the field is zeroed and added to W#FDNU      USRMTI0R
     C*   and the data type field W#FDDT is set to 'N' (numeric data).    USRMTI0R
     C*                                                                   USRMTI0R
     C*   Tool Id.                                                        USRMTI0R
     C*                                                                   USRMTI0R
     C           TITLID    IFNE TLID                                      USRMTI0R
     C                     MOVEL'TITLID'  W#FDNM           Field name     USRMTI0R
     C                     MOVELTITLID    W#FDST           Field value    USRMTI0R
     C                     MOVEL'S'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Description.                                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           TIDS40    IFNE DS40                                      USRMTI0R
     C                     MOVEL'TIDS40'  W#FDNM           Field name     USRMTI0R
     C                     MOVELTIDS40    W#FDST           Field value    USRMTI0R
     C                     MOVEL'S'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Type code.                                                      USRMTI0R
     C*                                                                   USRMTI0R
     C           TITYCD    IFNE TYCD                                      USRMTI0R
     C                     MOVEL'TITYCD'  W#FDNM           Field name     USRMTI0R
     C                     MOVELTITYCD    W#FDST           Field value    USRMTI0R
     C                     MOVEL'S'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Inspection date.                                                USRMTI0R
     C*                                                                   USRMTI0R
     C           TIINDT    IFNE INDT                                      USRMTI0R
     C                     MOVEL'TIINDT'  W#FDNM           Field name     USRMTI0R
     C                     Z-ADDTIINDT    W#FDNU           Field value    USRMTI0R
     C                     MOVEL'N'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Schedule maintenance ID.                                        USRMTI0R
     C*                                                                   USRMTI0R
     C           TISCID    IFNE SCID                                      USRMTI0R
     C                     MOVEL'TISCID'  W#FDNM           Field name     USRMTI0R
     C                     MOVELTISCID    W#FDST           Field value    USRMTI0R
     C                     MOVEL'S'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*++TAGE0004                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C           ZCHSTB    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* CHGSTG - Change string generation.                              * USRMTI0R
     C******************************************************************* USRMTI0R
     C           CHGSTG    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'CHGSTG01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Load save data with new record image.                             USRMTI0R
     C*                                                                   USRMTI0R
     C           2         OCUR W#RCDT                                    USRMTI0R
     C                     MOVELW#RCDT    W1RCDT                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Set data structure to original record image.                      USRMTI0R
     C*                                                                   USRMTI0R
     C           1         OCUR W#RCDT                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* Build original string.                                            USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*FLDORG 'W#KYGN                          USRMTI0R
     C                     EXSR CHGBLD                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* Load save data with original record image.                        USRMTI0R
     C*                                                                   USRMTI0R
     C           1         OCUR W#RCDT                                    USRMTI0R
     C                     MOVELW#RCDT    W1RCDT                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Set data structure to new record image.                           USRMTI0R
     C*                                                                   USRMTI0R
     C           2         OCUR W#RCDT                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* Build assign string.                                              USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*FLDASN 'W#KYGN                          USRMTI0R
     C                     EXSR CHGBLD                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           ZCHSTG    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* CLOFIL - Close open files.                                      * USRMTI0R
     C******************************************************************* USRMTI0R
     C           CLOFIL    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'CLOFIL01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR CLSTS1                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           ZCLFIL    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* CLOPGM - Close open programs.                                   * USRMTI0R
     C******************************************************************* USRMTI0R
     C           CLOPGM    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'CLOPGM01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR SXMSG0                                    USRMTI0R
     C                     EXSR SVMHG0                                    USRMTI0R
     C                     EXSR SVRMH0                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* It is INTENTIONAL that program PSXEMP1R (SXEMP1) is not           USRMTI0R
     C*  closed.                                                          USRMTI0R
     C*                                                                   USRMTI0R
     C           ZCLPGM    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* CLSTS1 - Close the TRNSTSL1 file.                               * USRMTI0R
     C******************************************************************* USRMTI0R
     C           CLSTS1    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C* If the file is open, close it.                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           W#OTS1    IFEQ *ON                                       USRMTI0R
     C                     MOVEL*OFF      W#OTS1                          USRMTI0R
     C                     CLOSETRNSTSL1                                  USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C           ZCLTS1    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* CLTPRC - Client maintenance processing.                         * USRMTI0R
     C******************************************************************* USRMTI0R
     C           CLTPRC    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'CLTPRC01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Initialize work variables.                                        USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL*OFF      W#ERED                          USRMTI0R
     C                     MOVEL*OFF      W#WNED                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Based on trigger time and event, execute record action.           USRMTI0R
     C*                                                                   USRMTI0R
     C                     SELEC                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Before processing.                                              USRMTI0R
     C*                                                                   USRMTI0R
     C           P#TGTM    WHEQ '2'                                       USRMTI0R
     C*                                                                   USRMTI0R
     C*     Create, delete and change.                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           P#TGEV    CASEQ'1'       CRTBFR                          USRMTI0R
     C           P#TGEV    CASEQ'2'       DLTBFR                          USRMTI0R
     C           P#TGEV    CASEQ'3'       CHGBFR                          USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C*   After processing.                                               USRMTI0R
     C*                                                                   USRMTI0R
     C           P#TGTM    WHEQ '1'                                       USRMTI0R
     C*                                                                   USRMTI0R
     C*     Perform history considerations.                               USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR GENHST                                    USRMTI0R
     C*                                                                   USRMTI0R
     C*     Create, delete and change.                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           P#TGEV    CASEQ'1'       CRTAFT                          USRMTI0R
     C           P#TGEV    CASEQ'2'       DLTAFT                          USRMTI0R
     C           P#TGEV    CASEQ'3'       CHGAFT                          USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C                     ENDSL                                          USRMTI0R
     C*                                                                   USRMTI0R
     C           ZCLPRC    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* CRTAFT - Create after processing requirements.                  * USRMTI0R
     C******************************************************************* USRMTI0R
     C           CRTAFT    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'CRTAFT01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Set data structure to new record image.                           USRMTI0R
     C*                                                                   USRMTI0R
     C           2         OCUR W#RCDT                                    USRMTI0R
     C*++TAGB0005                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C* Perform any after create processing that might be needed.         USRMTI0R
     C*                                                                   USRMTI0R
     C*++TAGE0005                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C           ZCRAFT    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* CRTBFR - Create before processing requirements.                 * USRMTI0R
     C******************************************************************* USRMTI0R
     C           CRTBFR    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'CRTBFR01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Set data structure to new record image.                           USRMTI0R
     C*                                                                   USRMTI0R
     C           2         OCUR W#RCDT                                    USRMTI0R
     C*++TAGB0006                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C* Perform create edits.                                             USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR E#0001                                    USRMTI0R
     C                     EXSR E#0002                                    USRMTI0R
     C                     EXSR E#0003                                    USRMTI0R
     C*++TAGE0006                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C* If any error edits were encountered send escape message           USRMTI0R
     C*  to cause record action operation to be cancelled.                USRMTI0R
     C*                                                                   USRMTI0R
     C           W#ERED    IFEQ *ON                                       USRMTI0R
     C                     EXSR SNDESC                                    USRMTI0R
     C                     END                                            USRMTI0R
     C*++TAGB0011                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C* If no errors, set user quantity default to 1.
     C*  This requires the trigger to be created with
     C*   allow repeated change set to *yes.
     C*    ADDPFTRG - ALWREPCHG = *Yes.
     C*                                                                   USRMTI0R
     C           TIUU11    IFEQ *ZEROS                                    USRMTI0R
     C                     Z-ADD1         TIUU11
     C                     END
     C*
     C* Update trigger buffer area.
     C*
     C           P#NROF    ADD  1         #X
     C                     MOVEAW#RCDT    #RD,#X
     C           P1TBLN    SUBSTW#TGDT:1  P#TRBF                          USRMTI0R
     C*++TAGE0011                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C           ZCRBFR    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* CRTSTG - Create string generation.                              * USRMTI0R
     C******************************************************************* USRMTI0R
     C           CRTSTG    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'CRTSTG01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Set data structure to new record image.                           USRMTI0R
     C*                                                                   USRMTI0R
     C           2         OCUR W#RCDT                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* Create field assign for ALL data fields that are not              USRMTI0R
     C*  blank (character fields) and not zero (numeric fields).          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*YES    'W#PFPR           Process?       USRMTI0R
     C                     MOVEL'*NO     'W#SHDN           Shutdown?      USRMTI0R
     C                     MOVEL'*PROCESS'W#BLRQ           Request type   USRMTI0R
     C                     MOVEL'*FLDASN 'W#KYGN           Keyword        USRMTI0R
     C*++TAGB0007                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C*   Tool Id.                                                        USRMTI0R
     C*                                                                   USRMTI0R
     C           TITLID    IFNE *BLANKS                                   USRMTI0R
     C                     MOVEL'TITLID'  W#FDNM           Field name     USRMTI0R
     C                     MOVELTITLID    W#FDST           Field value    USRMTI0R
     C                     MOVEL'S'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Description.                                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           TIDS40    IFNE *BLANKS                                   USRMTI0R
     C                     MOVEL'TIDS40'  W#FDNM           Field name     USRMTI0R
     C                     MOVELTIDS40    W#FDST           Field value    USRMTI0R
     C                     MOVEL'S'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Type code.                                                      USRMTI0R
     C*                                                                   USRMTI0R
     C           TITYCD    IFNE *BLANKS                                   USRMTI0R
     C                     MOVEL'TITYCD'  W#FDNM           Field name     USRMTI0R
     C                     MOVELTITYCD    W#FDST           Field value    USRMTI0R
     C                     MOVEL'S'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Inspection date.                                                USRMTI0R
     C*                                                                   USRMTI0R
     C           TIINDT    IFNE *ZEROS                                    USRMTI0R
     C                     MOVEL'TIINDT'  W#FDNM           Field name     USRMTI0R
     C                     Z-ADDTIINDT    W#FDNU           Field value    USRMTI0R
     C                     MOVEL'N'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Schedule maintenance ID.                                        USRMTI0R
     C*                                                                   USRMTI0R
     C           TISCID    IFNE *BLANKS                                   USRMTI0R
     C                     MOVEL'TISCID'  W#FDNM           Field name     USRMTI0R
     C                     MOVELTISCID    W#FDST           Field value    USRMTI0R
     C                     MOVEL'S'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*++TAGE0007                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C           ZCRSTG    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* DLTAFT - Delete after processing requirements.                  * USRMTI0R
     C******************************************************************* USRMTI0R
     C           DLTAFT    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'DLTAFT01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Set data structure to original record image.                      USRMTI0R
     C*                                                                   USRMTI0R
     C           1         OCUR W#RCDT                                    USRMTI0R
     C*++TAGB0008                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C* Perform any after delete processing that might be needed.         USRMTI0R
     C*                                                                   USRMTI0R
     C*++TAGE0008                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C           ZDLAFT    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* DLTBFR - Delete before processing requirements.                 * USRMTI0R
     C******************************************************************* USRMTI0R
     C           DLTBFR    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'DLTBFR01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Set data structure to original record image.                      USRMTI0R
     C*                                                                   USRMTI0R
     C           1         OCUR W#RCDT                                    USRMTI0R
     C*++TAGB0009                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C* Perform delete edits.                                             USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR E#0004                                    USRMTI0R
     C*++TAGE0009                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C* If any error edits were encountered send escape message           USRMTI0R
     C*  to cause record action operation to be cancelled.                USRMTI0R
     C*                                                                   USRMTI0R
     C           W#ERED    IFEQ *ON                                       USRMTI0R
     C                     EXSR SNDESC                                    USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C           ZDLBFR    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* DLTSTG - Delete string generation.                              * USRMTI0R
     C******************************************************************* USRMTI0R
     C           DLTSTG    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'DLTSTG01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Set data structure to original record image.                      USRMTI0R
     C*                                                                   USRMTI0R
     C           1         OCUR W#RCDT                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* Create field original for ALL data fields that are not            USRMTI0R
     C*  blank (character fields) and not zero (numeric fields).          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*YES    'W#PFPR           Process?       USRMTI0R
     C                     MOVEL'*NO     'W#SHDN           Shutdown?      USRMTI0R
     C                     MOVEL'*PROCESS'W#BLRQ           Request type   USRMTI0R
     C                     MOVEL'*FLDORG 'W#KYGN           Keyword        USRMTI0R
     C*++TAGB0010                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C*   Tool Id.                                                        USRMTI0R
     C*                                                                   USRMTI0R
     C           TITLID    IFNE *BLANKS                                   USRMTI0R
     C                     MOVEL'TITLID'  W#FDNM           Field name     USRMTI0R
     C                     MOVELTITLID    W#FDST           Field value    USRMTI0R
     C                     MOVEL'S'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Description.                                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           TIDS40    IFNE *BLANKS                                   USRMTI0R
     C                     MOVEL'TIDS40'  W#FDNM           Field name     USRMTI0R
     C                     MOVELTIDS40    W#FDST           Field value    USRMTI0R
     C                     MOVEL'S'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Type code.                                                      USRMTI0R
     C*                                                                   USRMTI0R
     C           TITYCD    IFNE *BLANKS                                   USRMTI0R
     C                     MOVEL'TITYCD'  W#FDNM           Field name     USRMTI0R
     C                     MOVELTITYCD    W#FDST           Field value    USRMTI0R
     C                     MOVEL'S'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Inspection date.                                                USRMTI0R
     C*                                                                   USRMTI0R
     C           TIINDT    IFNE *ZEROS                                    USRMTI0R
     C                     MOVEL'TIINDT'  W#FDNM           Field name     USRMTI0R
     C                     Z-ADDTIINDT    W#FDNU           Field value    USRMTI0R
     C                     MOVEL'N'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C*   Schedule maintenance ID.                                        USRMTI0R
     C*                                                                   USRMTI0R
     C           TISCID    IFNE *BLANKS                                   USRMTI0R
     C                     MOVEL'TISCID'  W#FDNM           Field name     USRMTI0R
     C                     MOVELTISCID    W#FDST           Field value    USRMTI0R
     C                     MOVEL'S'       W#FDDT           Data type      USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*++TAGE0010                                                         USRMTI0R
     C*                                                                   USRMTI0R
     C           ZDLSTG    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* E#0001 - Tool type code is not valid.                           * USRMTI0R
     C******************************************************************* USRMTI0R
     C           E#0001    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'E#000101'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Tool type code must be a valid value.                             USRMTI0R
     C*                                                                   USRMTI0R
     C           TITYCD    IFNE 'M'                                       USRMTI0R
     C           TITYCD    ANDNE'R'                                       USRMTI0R
     C           TITYCD    ANDNE'S'                                       USRMTI0R
     C                     MOVEL'*YES    'W#PFPR           Process?       USRMTI0R
     C                     MOVEL'*NO     'W#SHDN           Shutdown?      USRMTI0R
     C                     MOVELP#TSTK    W#TSTK           Task token     USRMTI0R
     C                     MOVEL'USR0001' W1MSID           Mess ID        USRMTI0R
     C                     CLEARW#MSDT                     Mess data      USRMTI0R
     C                     MOVEL'USRMSGF 'W#MSFN           Mess file      USRMTI0R
     C                     MOVEL'*ERROR  'W#MSCL           Mess class     USRMTI0R
     C                     CLEARW#MSFL                     Field list     USRMTI0R
     C           W#MSFL    CAT  'TITYCD':0W#MSFL                          USRMTI0R
     C                     EXSR XXEMP1                                    USRMTI0R
     C                     MOVEL*ON       W#ERED                          USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C           ZE#001    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* E#0002 - Tool description is blank (warning).                   * USRMTI0R
     C******************************************************************* USRMTI0R
     C           E#0002    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'E#000201'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Warn user that tool description was left blank.                   USRMTI0R
     C*  This warning will not prevent the record action from             USRMTI0R
     C*   being applied.  It will only allow the user to view             USRMTI0R
     C*   the warning message.                                            USRMTI0R
     C*                                                                   USRMTI0R
     C           TIDS40    IFEQ *BLANKS                                   USRMTI0R
     C                     MOVEL'*YES    'W#PFPR           Process?       USRMTI0R
     C                     MOVEL'*NO     'W#SHDN           Shutdown?      USRMTI0R
     C                     MOVELP#TSTK    W#TSTK           Task token     USRMTI0R
     C                     MOVEL'USR0002' W1MSID           Mess ID        USRMTI0R
     C                     CLEARW#MSDT                     Mess data      USRMTI0R
     C                     MOVEL'USRMSGF 'W#MSFN           Mess file      USRMTI0R
     C                     MOVEL'*WARNING'W#MSCL           Mess class     USRMTI0R
     C                     CLEARW#MSFL                     Field list     USRMTI0R
     C           W#MSFL    CAT  'TIDS40':0W#MSFL                          USRMTI0R
     C                     EXSR XXEMP1                                    USRMTI0R
     C                     MOVEL*ON       W#WNED                          USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C           ZE#002    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* E#0003 - Tool type "S" requires a maintenance schedule.         * USRMTI0R
     C******************************************************************* USRMTI0R
     C           E#0003    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'E#000301'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Tool type code "S" requires a user to enter an associated         USRMTI0R
     C*  maintenance schedule.                                            USRMTI0R
     C*                                                                   USRMTI0R
     C           TITYCD    IFEQ 'S'                                       USRMTI0R
     C           TISCID    ANDEQ*BLANKS                                   USRMTI0R
     C                     MOVEL'*YES    'W#PFPR           Process?       USRMTI0R
     C                     MOVEL'*NO     'W#SHDN           Shutdown?      USRMTI0R
     C                     MOVELP#TSTK    W#TSTK           Task token     USRMTI0R
     C                     MOVEL'USR0003' W1MSID           Mess ID        USRMTI0R
     C                     CLEARW#MSDT                     Mess data      USRMTI0R
     C           TITYCD    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C                     MOVEL'USRMSGF 'W#MSFN           Mess file      USRMTI0R
     C                     MOVEL'*ERROR  'W#MSCL           Mess class     USRMTI0R
     C                     CLEARW#MSFL                                    USRMTI0R
     C           W#MSFL    CAT  'TITYCD':0W#MSFL           Field list     USRMTI0R
     C           W#MSFL    CAT  ',':0     W#MSFL                          USRMTI0R
     C           W#MSFL    CAT  'TISCID':0W#MSFL                          USRMTI0R
     C                     EXSR XXEMP1                                    USRMTI0R
     C                     MOVEL*ON       W#ERED                          USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C           ZE#003    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* E#0004 - Tool used be operation &1 for item &2.                 * USRMTI0R
     C******************************************************************* USRMTI0R
     C           E#0004    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'E#000401'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Prepare SQL statement and open cursor.                            USRMTI0R
     C*                                                                   USRMTI0R
     C                     CLEARW1SLCL                                    USRMTI0R
     C                     MOVEA#SQ       W1SLCL                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Set tool ID to be queried.  The tool ID in the tool master        USRMTI0R
     C*  is ten characters while the routing file is only six.            USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVELTITLID    W#TLID                          USRMTI0R
     C                     MOVEAW#TLID    #SQ,48                          USRMTI0R
     C*                                                                   USRMTI0R
     C/EXEC SQL WHENEVER SQLERROR GOTO ZE#004                             USRMTI0R
     C/END-EXEC                                                           USRMTI0R
     C/EXEC SQL PREPARE W#SLCL FROM :W1SLCL                               USRMTI0R
     C/END-EXEC                                                           USRMTI0R
     C/EXEC SQL DECLARE W#CR01 CURSOR FOR W#SLCL                          USRMTI0R
     C/END-EXEC                                                           USRMTI0R
     C/EXEC SQL OPEN W#CR01                                               USRMTI0R
     C/END-EXEC                                                           USRMTI0R
     C*                                                                   USRMTI0R
     C* Get initial row.                                                  USRMTI0R
     C*                                                                   USRMTI0R
     C/EXEC SQL FETCH W#CR01 INTO :W#ITNO, :W#OPSQ                        USRMTI0R
     C/END-EXEC                                                           USRMTI0R
     C*                                                                   USRMTI0R
     C* Process all rows.                                                 USRMTI0R
     C*                                                                   USRMTI0R
     C           SQLCOD    DOWEQ*ZEROS                                    USRMTI0R
     C*                                                                   USRMTI0R
     C*   Tool used be operation &1 for item number &2 therefore it       USRMTI0R
     C*    can not be deleted.                                            USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*YES    'W#PFPR           Process?       USRMTI0R
     C                     MOVEL'*NO     'W#SHDN           Shutdown?      USRMTI0R
     C                     MOVELP#TSTK    W#TSTK           Task token     USRMTI0R
     C                     MOVEL'USR0004' W1MSID           Mess ID        USRMTI0R
     C                     CLEARW#MSDT                     Mess data      USRMTI0R
     C           W#ITNO    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C           W#OPSQ    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C                     MOVEL'USRMSGF 'W#MSFN           Mess file      USRMTI0R
     C                     MOVEL'*ERROR  'W#MSCL           Mess class     USRMTI0R
     C                     CLEARW#MSFL                     Field list     USRMTI0R
     C           W#MSFL    CAT  'TITLID':0W#MSFL                          USRMTI0R
     C                     EXSR XXEMP1                                    USRMTI0R
     C                     MOVEL*ON       W#ERED                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Get next row.                                                     USRMTI0R
     C*                                                                   USRMTI0R
     C/EXEC SQL FETCH W#CR01 INTO :W#ITNO, :W#OPSQ                        USRMTI0R
     C/END-EXEC                                                           USRMTI0R
     C*                                                                   USRMTI0R
     C                     ENDDO                                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Close SQL cursor.                                                 USRMTI0R
     C*                                                                   USRMTI0R
     C/EXEC SQL CLOSE W#CR01                                              USRMTI0R
     C/END-EXEC                                                           USRMTI0R
     C*                                                                   USRMTI0R
     C           ZE#004    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* GENHST - Generate history data, if requested.                   * USRMTI0R
     C******************************************************************* USRMTI0R
     C           GENHST    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'GENHST01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Retrieve the status record.                                       USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR OPNTS1                                    USRMTI0R
     C                     MOVEL'*INPUT  'W#TYAC                          USRMTI0R
     C                     MOVEL'*YES    'W#MDRD                          USRMTI0R
     C                     MOVELP#TSTK    K#TSTK                          USRMTI0R
     C                     EXSR RTVTS1                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* If record was found.                                              USRMTI0R
     C*                                                                   USRMTI0R
     C           W#RCFD    IFEQ '*YES    '                                USRMTI0R
     C*                                                                   USRMTI0R
     C*   Determine if transaction is set for history tracking.           USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*YES    'W#PFPR                          USRMTI0R
     C                     MOVEL'*NO     'W#SHDN                          USRMTI0R
     C                     MOVELTSTRID    W#TRID                          USRMTI0R
     C                     EXSR XVRMH0                                    USRMTI0R
     C*                                                                   USRMTI0R
     C*   If transaction is set for history reporting.                    USRMTI0R
     C*                                                                   USRMTI0R
     C           P$MTHS    IFEQ '*YES    '                                USRMTI0R
     C*                                                                   USRMTI0R
     C*   Generate history string.                                        USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR GENSTG                                    USRMTI0R
     C*                                                                   USRMTI0R
     C*   Call program to generate maintenance history records.           USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*YES    'W#PFPR                          USRMTI0R
     C                     MOVEL'*NO     'W#SHDN                          USRMTI0R
     C                     MOVELP#TSTK    W#TSTK                          USRMTI0R
     C                     EXSR XVMHG0                                    USRMTI0R
     C*                                                                   USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C           ZGEHST    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* GENSTG - Generate history string.                               * USRMTI0R
     C******************************************************************* USRMTI0R
     C           GENSTG    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'GENSTG01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Notify string generator that we will start requesting             USRMTI0R
     C*  a new string to be generated.                                    USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*YES    'W#PFPR                          USRMTI0R
     C                     MOVEL'*NO     'W#SHDN                          USRMTI0R
     C                     MOVEL'*START  'W#BLRQ                          USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* Based on transaction ID execute string generation process.        USRMTI0R
     C*                                                                   USRMTI0R
     C           P#TGEV    CASEQ'1'       CRTSTG                          USRMTI0R
     C           P#TGEV    CASEQ'2'       DLTSTG                          USRMTI0R
     C           P#TGEV    CASEQ'3'       CHGSTG                          USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C* Notify string generator that we are finished.                     USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*YES    'W#PFPR                          USRMTI0R
     C                     MOVEL'*NO     'W#SHDN                          USRMTI0R
     C                     MOVEL'*STORE  'W#BLRQ                          USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           ZGESTG    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* LODRFM - Load parameter data to record formats.                 * USRMTI0R
     C******************************************************************* USRMTI0R
     C           LODRFM    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'LODRFM01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Clear record data structures.                                     USRMTI0R
     C*                                                                   USRMTI0R
     C           1         OCUR W#RCDT                                    USRMTI0R
     C                     CLEARW#RCDT                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           2         OCUR W#RCDT                                    USRMTI0R
     C                     CLEARW#RCDT                                    USRMTI0R
     C*                                                                   USRMTI0R
     C                     CLEARW1RCDT                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* Load buffer data to work array.                                   USRMTI0R
     C*                                                                   USRMTI0R
     C           P1TBLN    SUBSTP#TRBF:1  W#TGDT                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Load original record buffer data to original record               USRMTI0R
     C*  format.                                                          USRMTI0R
     C*                                                                   USRMTI0R
     C           P#OROF    ADD  1         #X                              USRMTI0R
     C           1         OCUR W#RCDT                                    USRMTI0R
     C                     MOVEA#RD,#X    W#RCDT                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Load new record buffer data to new record format.                 USRMTI0R
     C*                                                                   USRMTI0R
     C           P#NROF    ADD  1         #X                              USRMTI0R
     C           2         OCUR W#RCDT                                    USRMTI0R
     C                     MOVEA#RD,#X    W#RCDT                          USRMTI0R
     C*                                                                   USRMTI0R
     C           ZLORFM    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* OPNTS1 - Open the TRNSTSL1 file.                                * USRMTI0R
     C******************************************************************* USRMTI0R
     C           OPNTS1    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C* If the file is not already open, then open it.                    USRMTI0R
     C*                                                                   USRMTI0R
     C           W#OTS1    IFNE *ON                                       USRMTI0R
     C                     MOVEL*ON       W#OTS1  1                       USRMTI0R
     C                     OPEN TRNSTSL1                                  USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Define key list(s).                                               USRMTI0R
     C*                                                                   USRMTI0R
     C           K$1TS1    KLIST                                          USRMTI0R
     C                     KFLD           K#TSTK                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Define key fields.                                                USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL*BLANKS   K#TSTK 10                       USRMTI0R
     C*                                                                   USRMTI0R
     C           ZOPTS1    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* PGMABT - Program abort logic.                                   * USRMTI0R
     C******************************************************************* USRMTI0R
     C           PGMABT    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C* If message needs to be sent, send it.                             USRMTI0R
     C*                                                                   USRMTI0R
     C           W#MSID    IFGT *BLANKS                                   USRMTI0R
     C                     MOVELW#MSID    W#MSID                          USRMTI0R
     C                     MOVELW#MSDT    W#MSDT                          USRMTI0R
     C                     EXSR PGMERR                                    USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C* Relay messages to caller.                                         USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR RLYMSG                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* Send escape message to caller thereby preventing any              USRMTI0R
     C*  record action.                                                   USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR SNDESC                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           ZPGABT    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* PGMCLS - Program close.                                         * USRMTI0R
     C******************************************************************* USRMTI0R
     C           PGMCLS    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'PGMCLS01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Close files.                                                      USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR CLOFIL                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* Close program.                                                    USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR CLOPGM                                    USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL*ON       *INLR                           USRMTI0R
     C*                                                                   USRMTI0R
     C           ZPGCLS    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C*  PGMERR - Send error message to current programs message queue  * USRMTI0R
     C******************************************************************* USRMTI0R
     C           PGMERR    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Input:                                                            USRMTI0R
     C* ------                                                            USRMTI0R
     C* W#MSID - Message ID to be sent.                                   USRMTI0R
     C* W#MSDT - Message data.                                            USRMTI0R
     C*                                                                   USRMTI0R
     C*-----------------------------------------------------------------* USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVELW#MSID    W#MSID  7                       USRMTI0R
     C                     MOVELW#MSDT    W#MSDT256                       USRMTI0R
     C*                                                                   USRMTI0R
     C                     CALL 'PSXSPM1C'                 Send message   USRMTI0R
     C                     PARM W#MSID    SMMSID  7        Message ID     USRMTI0R
     C                     PARM *BLANKS   SMMFNM 10        Message file   USRMTI0R
     C                     PARM W#MSDT    SMMSDT256        Message data   USRMTI0R
     C                     PARM *BLANKS   SMPQRL  5        PGMQ relation  USRMTI0R
     C                     PARM *BLANKS   SMPQNM 10        PGMQ name      USRMTI0R
     C*                                                                   USRMTI0R
     C           ZPGERR    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* PGMINZ - Program initialization.                                * USRMTI0R
     C******************************************************************* USRMTI0R
     C           PGMINZ    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'PGMINZ01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL*OFF      *INLR                           USRMTI0R
     C*                                                                   USRMTI0R
     C           ZPGINZ    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* PGMOPN - Program open considerations.                           * USRMTI0R
     C******************************************************************* USRMTI0R
     C           PGMOPN    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'PGMOPN01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL*ON       W#PGOP  1                       USRMTI0R
     C*                                                                   USRMTI0R
     C           ZPGOPN    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* PGMPRC - Program processing logic.                              * USRMTI0R
     C******************************************************************* USRMTI0R
     C           PGMPRC    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'PGMPRC01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Get communication data area from calling process.                 USRMTI0R
     C*                                                                   USRMTI0R
     C                     IN   P#CMDA                 90                 USRMTI0R
     C*                                                                   USRMTI0R
     C*   If communication area does not exist set for common             USRMTI0R
     C*    processing.                                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           *IN90     IFEQ *ON                                       USRMTI0R
     C                     MOVEL'*COMMON 'P#CLID                          USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C*   Place parameter data base data into record formats.             USRMTI0R
     C*                                                                   USRMTI0R
     C                     EXSR LODRFM                                    USRMTI0R
     C*                                                                   USRMTI0R
     C*   Select appropriate caller process.                              USRMTI0R
     C*                                                                   USRMTI0R
     C***        P#CLID    CASEQ'*COMMON 'CMNPRC                          USRMTI0R
     C           P#CLID    CASEQ'*CLTPRC 'CLTPRC                          USRMTI0R
     C*++TAGB0011                                                         USRMTI0R
     C***        P#CLID    CASEQ'*USRPRC 'USRPRC                          USRMTI0R
     C*++TAGE0011                                                         USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C           ZPGPRC    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C*  RLYMSG - Relay program messages                                * USRMTI0R
     C******************************************************************* USRMTI0R
     C           RLYMSG    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Dependencies:                                                     USRMTI0R
     C* -------------                                                     USRMTI0R
     C* Requires program name out of the program status data structure.   USRMTI0R
     C*   PGMSTS    ESDSPGMSTS                                            USRMTI0R
     C*                                                                   USRMTI0R
     C* Requires data structures to define length of 1st and 2nd level    USRMTI0R
     C* message text.                                                     USRMTI0R
     C*   RTMSG       DS                            512                   USRMTI0R
     C*   RTSCLV      DS                           3000                   USRMTI0R
     C*                                                                   USRMTI0R
     C*-----------------------------------------------------------------* USRMTI0R
     C*                                                                   USRMTI0R
     C*  Assemble command string - RLYRPGMSG PGMQ()                       USRMTI0R
     C*                                                                   USRMTI0R
     C                     CALL 'PSXRTM1C'             90  Retrieve msg   USRMTI0R
     C                     PARM 'CMD0002' RTMSID  7        Message ID     USRMTI0R
     C                     PARM 'PSIMSGF' RTMFNM 10        Message file   USRMTI0R
     C                     PARM *BLANKS   RTMFLB 10        Msg file lib   USRMTI0R
     C                     PARM $PPGNM    RTMSDT256        Message data   USRMTI0R
     C                     PARM *BLANKS   RTMSG            DS 1st level   USRMTI0R
     C                     PARM *BLANKS   RTSCLV           DS 2nd level   USRMTI0R
     C*                                                                   USRMTI0R
     C*  Execute command                                                  USRMTI0R
     C*                                                                   USRMTI0R
     C                     CALL 'QCMDEXC'              90                 USRMTI0R
     C                     PARM           RTSCLV                          USRMTI0R
     C                     PARM 512       QCLENG 155                      USRMTI0R
     C*                                                                   USRMTI0R
     C           ZRLYMS    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* RTVTS1 - Retrieve unique TRNSTSL1 file record.                  * USRMTI0R
     C******************************************************************* USRMTI0R
     C           RTVTS1    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVELW#TYAC    W#TYAC  8                       USRMTI0R
     C                     MOVELW#MDRD    W#MDRD  8                       USRMTI0R
     C*                                                                   USRMTI0R
     C* Retrieve the record in either input or update mode.               USRMTI0R
     C*                                                                   USRMTI0R
     C           W#TYAC    IFEQ '*INPUT  '                                USRMTI0R
     C           K$1TS1    CHAINTRNSTSL1            N90                   USRMTI0R
     C                     ELSE                                           USRMTI0R
     C           K$1TS1    CHAINTRNSTSL1             9091                 USRMTI0R
     C           *IN91     DOWEQ*ON                                       USRMTI0R
     C           K$1TS1    CHAINTRNSTSL1             9091                 USRMTI0R
     C                     END                                            USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C* Set the status flag.                                              USRMTI0R
     C*                                                                   USRMTI0R
     C           *IN90     IFEQ *OFF                                      USRMTI0R
     C                     MOVE '*YES    'W#RCFD  8                       USRMTI0R
     C                     ELSE                                           USRMTI0R
     C                     MOVE '*NO     'W#RCFD                          USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C* If the record is not found, and it is a mandatory record          USRMTI0R
     C*  report the error and end the program.                            USRMTI0R
     C*                                                                   USRMTI0R
     C           W#RCFD    IFEQ '*NO     '                                USRMTI0R
     C           W#MDRD    ANDEQ'*YES    '                                USRMTI0R
     C                     MOVEL'PSX0003' W#MSID                          USRMTI0R
     C                     MOVE *BLANKS   W#MSDT                          USRMTI0R
     C                     MOVEL'TRNSTSL1'W#WA10 10                       USRMTI0R
     C           K#TSTK    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C           W#WA10    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C           $PPGNM    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C           W#SBTG    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C                     EXSR PGMABT                                    USRMTI0R
     C                     ENDIF                                          USRMTI0R
     C*                                                                   USRMTI0R
     C           ZRTTS1    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* SNDESC - Send escape message to caller.                         * USRMTI0R
     C******************************************************************* USRMTI0R
     C           SNDESC    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'SNDESC01'W#SBTG                          USRMTI0R
     C*                                                                   USRMTI0R
     C* Perform program close considerations.                             USRMTI0R
     C*                                                                   USRMTI0R
     C***                  EXSR PGMCLS                                    USRMTI0R
     C*                                                                   USRMTI0R
     C* This message is strictly to notify the calling program            USRMTI0R
     C*  that the record operation encountered an error.                  USRMTI0R
     C*                                                                   USRMTI0R
     C                     CALL 'PSXSPM4C'             90                 USRMTI0R
     C                     PARM 'CPF9898' P$MSID  7        Message ID     USRMTI0R
     C                     PARM 'QCPFMSG' P$MSFN 10        Message file   USRMTI0R
     C                     PARM '*ESCAPE' P$MSTY  7        Message type   USRMTI0R
     C                     PARM *BLANKS   P$MSDT256        Message date   USRMTI0R
     C                     PARM '*PRV '   P$PGRL  5        Relationship   USRMTI0R
     C                     PARM $PPGNM    P$PGQM 10        Prog queue     USRMTI0R
     C*                                                                   USRMTI0R
     C           ZSNESC    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* SVMHG0 - Shutdown program - PSVMHG0R                            * USRMTI0R
     C******************************************************************* USRMTI0R
     C           SVMHG0    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*NO     'W#PFPR                          USRMTI0R
     C                     MOVEL'*YES    'W#SHDN                          USRMTI0R
     C                     EXSR XVMHG0                                    USRMTI0R
     C*                                                                   USRMTI0R
     C                     ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* SVRMH0 - Shutdown program - PSVRMH0R                            * USRMTI0R
     C******************************************************************* USRMTI0R
     C           SVRMH0    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*NO     'W#PFPR                          USRMTI0R
     C                     MOVEL'*YES    'W#SHDN                          USRMTI0R
     C                     EXSR XVRMH0                                    USRMTI0R
     C*                                                                   USRMTI0R
     C                     ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* SXEMP1 - Shutdown program - PSXEMP1R                            * USRMTI0R
     C******************************************************************* USRMTI0R
     C           SXEMP1    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*NO     'W#PFPR                          USRMTI0R
     C                     MOVEL'*YES    'W#SHDN                          USRMTI0R
     C                     EXSR XXEMP1                                    USRMTI0R
     C*                                                                   USRMTI0R
     C                     ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* SXMSG0 - Shutdown program - PSXMSG0R                            * USRMTI0R
     C******************************************************************* USRMTI0R
     C           SXMSG0    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVEL'*NO     'W#PFPR                          USRMTI0R
     C                     MOVEL'*YES    'W#SHDN                          USRMTI0R
     C                     EXSR XXMSG0                                    USRMTI0R
     C*                                                                   USRMTI0R
     C                     ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* XVMHG0 - Execute program - PSVMHG0R                             * USRMTI0R
     C******************************************************************* USRMTI0R
     C           XVMHG0    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVELW#PFPR    W#PFPR  8                       USRMTI0R
     C                     MOVELW#SHDN    W#SHDN  8                       USRMTI0R
     C                     MOVELW#TSTK    W#TSTK 10                       USRMTI0R
     C*                                                                   USRMTI0R
     C                     CALL 'PSVMHG0R'             90                 USRMTI0R
     C                     PARM W#PFPR    P$PFPR  8                       USRMTI0R
     C                     PARM W#SHDN    P$SHDN  8                       USRMTI0R
     C                     PARM W#TSTK    P$TSTK 10                       USRMTI0R
     C                     PARM *BLANKS   P$MSID  7                       USRMTI0R
     C*                                                                   USRMTI0R
     C* If there is an error on the call to this program,                 USRMTI0R
     C*  report it.                                                       USRMTI0R
     C*                                                                   USRMTI0R
     C           *IN90     IFEQ *ON                                       USRMTI0R
     C           P$MSID    ORNE *BLANKS                                   USRMTI0R
     C                     MOVEL'PSX0001' W#MSID                          USRMTI0R
     C                     MOVE *BLANKS   W#MSDT                          USRMTI0R
     C                     MOVEL'PSVMHG0R'W#WA10 10                       USRMTI0R
     C           W#SBTG    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C           $PPGNM    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C           W#WA10    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C                     EXSR PGMABT                                    USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C           ZVMHG0    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* XVRMH0 - Execute program - PSVRMH0C                             * USRMTI0R
     C******************************************************************* USRMTI0R
     C           XVRMH0    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVELW#PFPR    W#PFPR  8                       USRMTI0R
     C                     MOVELW#SHDN    W#SHDN  8                       USRMTI0R
     C                     MOVELW#TRID    W#TRID 10                       USRMTI0R
     C*                                                                   USRMTI0R
     C                     CALL 'PSVRMH0R'             90                 USRMTI0R
     C                     PARM W#PFPR    P$PFPR  8                       USRMTI0R
     C                     PARM W#SHDN    P$SHDN  8                       USRMTI0R
     C                     PARM W#TRID    P$TRID 10                       USRMTI0R
     C                     PARM           P$MTHS  8                       USRMTI0R
     C                     PARM *BLANKS   P$MSID  7                       USRMTI0R
     C*                                                                   USRMTI0R
     C* If there is an error on the call to this program,                 USRMTI0R
     C*  report it.                                                       USRMTI0R
     C*                                                                   USRMTI0R
     C           *IN90     IFEQ *ON                                       USRMTI0R
     C           W#PFPR    ANDEQ'*YES    '                                USRMTI0R
     C           P$MSID    ORNE *BLANKS                                   USRMTI0R
     C           W#PFPR    ANDEQ'*YES    '                                USRMTI0R
     C                     MOVEL'PSX0001' W#MSID                          USRMTI0R
     C                     MOVE *BLANKS   W#MSDT                          USRMTI0R
     C                     MOVEL'PSVRMH0R'W#WA10 10                       USRMTI0R
     C           W#SBTG    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C           $PPGNM    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C           W#WA10    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C                     EXSR PGMABT                                    USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C           ZVRMH0    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* XXEMP1 - Execute program - PSXEMP1R                             * USRMTI0R
     C******************************************************************* USRMTI0R
     C           XXEMP1    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVELW#PFPR    W#PFPR  8                       USRMTI0R
     C                     MOVELW#SHDN    W#SHDN  8                       USRMTI0R
     C                     MOVELW#TSTK    W#TSTK 10                       USRMTI0R
     C                     MOVELW1MSID    W1MSID  7                       USRMTI0R
     C                     MOVELW#MSDT    W#MSDT256                       USRMTI0R
     C                     MOVELW#MSFN    W#MSFN 10                       USRMTI0R
     C                     MOVELW#MSCL    W#MSCL  8                       USRMTI0R
     C                     MOVELW#MSFL    W#MSFL 65                       USRMTI0R
     C*                                                                   USRMTI0R
     C                     CALL 'PSXEMP1R'             90                 USRMTI0R
     C                     PARM W#PFPR    P$PFPR  8                       USRMTI0R
     C                     PARM W#SHDN    P$SHDN  8                       USRMTI0R
     C                     PARM W#TSTK    P$TSTK 10                       USRMTI0R
     C                     PARM W1MSID    P1MSID  7                       USRMTI0R
     C                     PARM W#MSDT    P$MSDT256                       USRMTI0R
     C                     PARM W#MSFN    P$MSFN 10                       USRMTI0R
     C                     PARM W#MSCL    P$MSCL  8                       USRMTI0R
     C                     PARM W#MSFL    P$MSFL 65                       USRMTI0R
     C                     PARM *BLANKS   P$MSID  7                       USRMTI0R
     C*                                                                   USRMTI0R
     C           ZXEMP1    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
     C/EJECT                                                              USRMTI0R
     C******************************************************************* USRMTI0R
     C* XXMSG0 - Execute program - PSXMSG0R                             * USRMTI0R
     C******************************************************************* USRMTI0R
     C           XXMSG0    BEGSR                                          USRMTI0R
     C*                                                                   USRMTI0R
     C                     MOVELW#PFPR    W#PFPR  8                       USRMTI0R
     C                     MOVELW#SHDN    W#SHDN  8                       USRMTI0R
     C                     MOVELW#BLRQ    W#BLRQ  8                       USRMTI0R
     C                     MOVELW#KYGN    W#KYGN  8                       USRMTI0R
     C                     MOVELW#MNTY    W#MNTY 10                       USRMTI0R
     C                     MOVELW#OBCL    W#OBCL 10                       USRMTI0R
     C                     MOVELW#KYDT    W#KYDT  1                       USRMTI0R
     C                     MOVELW#KYST    W#KYST256                       USRMTI0R
     C                     Z-ADDW#KYNU    W#KYNU 309                      USRMTI0R
     C                     MOVELW#FDNM    W#FDNM  6                       USRMTI0R
     C                     MOVELW#FDST    W#FDST256                       USRMTI0R
     C                     Z-ADDW#FDSL    W#FDSL  50                      USRMTI0R
     C                     MOVELW#FDSM    W#FDSM  8                       USRMTI0R
     C                     Z-ADDW#FDNU    W#FDNU 309                      USRMTI0R
     C                     MOVELW#FDDT    W#FDDT  1                       USRMTI0R
     C                     MOVELW#FDFA    W#FDFA256                       USRMTI0R
     C                     Z-ADDW#FDFB    W#FDFB  30                      USRMTI0R
     C                     MOVELW#FDRA    W#FDRA256                       USRMTI0R
     C                     MOVELW#FDOP    W#FDOP  1                       USRMTI0R
     C                     Z-ADDW#FDOV    W#FDOV 309                      USRMTI0R
     C                     MOVELW#RSCD    W#RSCD 10                       USRMTI0R
     C*                                                                   USRMTI0R
     C                     CALL 'PSXMSG0R'             90                 USRMTI0R
     C                     PARM W#PFPR    P$PFPR  8                       USRMTI0R
     C                     PARM W#SHDN    P$SHDN  8                       USRMTI0R
     C                     PARM W#BLRQ    P$BLRQ  8                       USRMTI0R
     C                     PARM W#KYGN    P$KYGN  8                       USRMTI0R
     C                     PARM W#MNTY    P$MNTY 10                       USRMTI0R
     C                     PARM W#OBCL    P$OBCL 10                       USRMTI0R
     C                     PARM W#KYDT    P$KYDT  1                       USRMTI0R
     C                     PARM W#KYST    P$KYST256                       USRMTI0R
     C                     PARM W#KYNU    P$KYNU 309                      USRMTI0R
     C                     PARM W#FDNM    P$FDNM  6                       USRMTI0R
     C                     PARM W#FDST    P$FDST256                       USRMTI0R
     C                     PARM W#FDSL    P$FDSL  50                      USRMTI0R
     C                     PARM W#FDSM    P$FDSM  8                       USRMTI0R
     C                     PARM W#FDNU    P$FDNU 309                      USRMTI0R
     C                     PARM W#FDDT    P$FDDT  1                       USRMTI0R
     C                     PARM W#FDFA    P$FDFA256                       USRMTI0R
     C                     PARM W#FDFB    P$FDFB  30                      USRMTI0R
     C                     PARM W#FDRA    P$FDRA256                       USRMTI0R
     C                     PARM W#FDOP    P$FDOP  1                       USRMTI0R
     C                     PARM W#FDOV    P$FDOV 309                      USRMTI0R
     C                     PARM W#RSCD    P$RSCD 10                       USRMTI0R
     C                     PARM *BLANKS   P$MSID  7                       USRMTI0R
     C*                                                                   USRMTI0R
     C* If there is an error on the call to this program,                 USRMTI0R
     C*  report it.                                                       USRMTI0R
     C*                                                                   USRMTI0R
     C           *IN90     IFEQ *ON                                       USRMTI0R
     C           W#PFPR    ANDEQ'*YES    '                                USRMTI0R
     C           P$MSID    ORNE *BLANKS                                   USRMTI0R
     C           W#PFPR    ANDEQ'*YES    '                                USRMTI0R
     C                     MOVEL'PSX0001' W#MSID                          USRMTI0R
     C                     MOVE *BLANKS   W#MSDT                          USRMTI0R
     C                     MOVEL'PSXMSG0R'W#WA10 10                       USRMTI0R
     C           W#SBTG    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C           $PPGNM    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C           W#WA10    CAT  W#MSDT    W#MSDT                          USRMTI0R
     C                     EXSR PGMABT                                    USRMTI0R
     C                     END                                            USRMTI0R
     C*                                                                   USRMTI0R
     C                     CLEARW#KYST                                    USRMTI0R
     C                     CLEARW#FDST                                    USRMTI0R
     C*                                                                   USRMTI0R
     C           ZXMSG0    ENDSR                                          USRMTI0R
     C******************************************************************* USRMTI0R
** QCMDEXC COMMAND  ARR(#SQ)
SELECT ITNBR, OPSEQ FROM ROUTNG WHERE RTOOL = '      ' ORDER BY ITNBR, OPSEQ